 主界面 = {
	{2333,60,0xd5c4a2},
	{2340,89,0xd5c4a2},
	{2483,86,0xd5c4a3},
	{2426,1232,0xdacac2},
	{2373,1304,0xdacac1},
	探索 = {603,124,0x27190b},
	打开菜单 = {2391,1278,0x530a0a},
	组队 = {487,1249,0xd6cebe},
	邮件 = {2342,68,0xd5c5a3},
}

主界面没打开卷轴 ={
	{2394,1309,0xd9c9c3},
	{2438,1232,0xdfcfc7},
	{2486,1187,0xddb472},
	{2379,1352,0xd4b483},
}

主界面打开卷轴 = {
	{503,1237,0xe5e5e5},
	{1062,1310,0xda6e2c},
	{2494,1270,0xdecec6},
	{2501,1359,0xd8b37e},
	{2512,1179,0xc9a05e},
}

战斗中 = {
	{20,1263,0x594f77},
	{2504,121,0x31200f},
	{2552,120,0xf1b744},
	{2534,165,0x423221},
	自动战斗 = {114,1316,0x7b6b47},
}

邮件界面 = {
	{224,1261,0xf5d4a3},
	{254,1262,0xf3d5a4},
	{239,1305,0xe4b371},
	{183,1308,0x281818},
	{309,1299,0x291919},
  未读 = {437,366,0xca5f4f},
  收取 = {1687,1226,0xf4b25f},
  关闭 = {2355,146,0xe8d5cf},
}

 主界面1 = {
	{2509,1288,0xdacac2},
	{1967,1208,0xc12f2f},
	{1293,1229,0xcac1b9},
	{1069,1314,0xd86c2a},
	{487,1249,0xd6cebe},
}
 
  退出战斗 = {
	{419,376,0xf4b25f},
	{497,378,0xf4b25f},
	{630,374,0xf4b25f},
	{713,375,0xf4b25f},
	取消 = {452,376,0xf4b25f},
}
 推图中 = {
	{34,57,0xeef6fe},
	{38,52,0xeef6fe},
	{39,63,0xedf5fd},
	{1018,19,0xd5c4a2},
	{1082,32,0xd5c4a2},
  锁定式神 = {887,570,0x4b5ee9},
	右边 = {829,456,0x934388},
	左边 = {288,448,0x944487},
	退出 = {44,62,0x616569},
	确认退出 = {690,358,0xf4b25f},
 }

退出探索 = {
	{404,359,0xf4b25f},
	{482,354,0xf4b25f},
	{636,365,0xf4b25f},
	{736,358,0xf4b25f},
	确认退出 = {690,358,0xf4b25f},
}

剧情中 = {
	{36,27,0xd5c4a2},
	{46,34,0xd5c4a2},
	{32,45,0xd5c4a2},
	{95,42,0xd4c3a1},
	{106,40,0xd5c4a3},
}

战斗结束领奖 = {
	{1215,512,0xbc4e25},
	{1263,653,0xe4decb},
	{1356,626,0x000000},
	{1172,757,0xb93d22},
	{1228,828,0x000000},
	点击 = {1296,1247,0x250103},
}

领奖结束 = {
	{1369,1048,0xbb391a},
	{1074,842,0xd88016},
	{1220,1081,0x1f1d1a},
	{1507,1031,0xd19118},
	{1320,908,0xcab498},
	点击 = {1296,1247,0x250103},
}

战斗胜利 = {
	{893,408,0x9e1c12},
	{1030,408,0xa21b11},
	{1210,441,0xb49460},
	{1643,345,0xe2d0a4},
	{1823,338,0xe0cea1},
	点击 = {1296,1247,0x250103},
}


发现妖怪 = {
	{518,511,0xf5f0dd},
	{548,509,0xf5f0dd},
	{576,520,0xf4efdc},
	{528,544,0xf4efdc},
	{687,552,0xefe9d7},
	点击 = {548,292,0xc7bf8d},
}

副本大地图 = {
	{508,22,0x371f0e},
	{41,54,0xebf3fb},
	{659,15,0xe97029},
	{867,28,0x311910},
	第三章 = {1034,382,0x3f2a2a},
	最后章 = {1047,494,0x8b714},
	觉醒材料 = {84,593,0x4877e3},
	御魂 = {173,594,0x22180f},
	返回 = {47,49,0xeaf3fe},
	选图 = {571,293,0x2c252b},
}

副本选图 = {
	{1042,208,0xc7afab},
	{1040,326,0x390a0e},
	{1039,424,0x2a130c},
	{1043,531,0x818181},
}

副本探索界面 = {
	{807,476,0xf4b25f},
	{880,474,0xf4b25f},
	{850,455,0xf4b25f},
	{841,489,0xf4b25f},
	探索 = {843,476,0xf4b25f},
	普通 = {304,192,0x731aae},
	困难 = {421,195,0x191512},
}

获得奖励提示 = {
	{464,204,0xdece8c},
	{506,201,0xf3e4b2},
	{546,211,0xecdcaa},
	{598,214,0xead9a0},
	点击 = {567,538,0x271228},
}

战斗准备 = {
	{2194,1384,0xebd2a0},
	{2478,1384,0xe8cb99},
	{2424,1356,0xe3be82},
	{2268,1386,0xcf9d64},
	{2366,1294,0x2c2b25},
	点击 = {2329,1109,0xbb9869},
}

跳过对话 = {
	{762,479,0x56aef3},
	{762,474,0x4945e0},
	{762,487,0x3a33dc},
	{754,487,0x4a3add},
	点击 = {762,479,0x56aef3},
}

快进 = {
	{986,73,0x7a59ec},
	{1002,95,0x5959e1},
	{1011,67,0x4f47c7},
	{980,77,0x6443de},
	点击 = {1014,79,0x456485},
}

提示框 = {
	{953,861,0xdd6951},
	{1160,866,0xdd6951},
	{1414,858,0xf4b25f},
	{1612,864,0xf4b25f},
	取消 = {1044,861,0xde6951},
	确定 = {1501,862,0xf5b35f},
}

觉醒选择界面 = {
	{162,192,0xbf787c},
	{490,208,0xe8f4e0},
	{913,262,0xe9e7e5},
	{1058,197,0x13c3f9},
	点击 = {1108,312,0xffe3b9},
}

觉醒挑战界面 = {
	{533,479,0xf4b25f},
	{615,478,0xf4b25f},
	{718,473,0xfc842b},
	{809,472,0xf4b25f},
	{879,475,0xf4b25f},
	组队 = {574,483,0xf4b25f},
	挑战 = {845,478,0xf4b25f},
	拖到前4层 = {360,174,358,379},
	拖到后4层 = {358,379,360,174},
	拖动 = {366,276,361,164},
	拖动1 = {361,164,366,276},
}

觉醒选择第几层 = {
	{354,180,0x34312e},
	{360,245,0x75706a},
	{358,312,0x75706a},
	{357,377,0x45423e},
}

组队界面有左边 = {
	{179,440,0x8c7342},
	{180,498,0xf7e7b5},
	{137,271,0xe7d27a},
	{162,528,0x7f1c1c},
	{777,442,0x785743},
	{777,559,0x785743},
}

组队界面 = {
	{179,440,0x8c7342},
	{180,498,0xf7e7b5},
	{137,271,0xe7d27a},
	{162,528,0x7f1c1c},
	{782,471,0xc6bdb5},
	{781,593,0xc6bdb5},
	刷新 = {1496,1251,0xf4b25f},
	创建 = {2060,1247,0xf4b25f},
	加入 = {2092,431,0x6d4427},
	拖动 = {487,1192,491,364},
	妖力封印 = {492,1162,0xe5d4bc},
	石距 = {494,904,0xe7d6be},
	点一下 = {925,1235,0xc6bdb5},
	关闭 =  {2350,261,0xe6d5cd},
}

组队详情= {
	{470,1197,0xdd6951},
	{753,1198,0xdd6951},
	{1656,1202,0xffa643},
	{1635,1224,0x0c0d0a},
	离开队伍 = {598,1207,0xdd6951},
	开始战斗 = {1955,1170,0xf3b25e},
	开组2人 = {467,263,0x777777},
	开组3人 = {779,260,0x777777},
}

创建队伍 = {
	{727,1148,0xdd6951},
	{883,1146,0xdd6951},
	{1678,1149,0xf4b25f},
	{1846,1147,0xf4b25f},
	{1252,1135,0xccb49b},
	创建 = {782,508,0xc8924e},
	取消 =  {812,1146,0xdd6951},
  买体力 = {972,100,0xd6c4a1},
}

邀请队友 = {
	{403,508,0xdd6951},
	{487,504,0xdd6951},
	{649,511,0xf4b25f},
	{727,512,0xf4b25f},
	取消 = {448,508,0xdd6951},
}

进入队伍 = {
	{2090,431,0x5d3616},
	{2086,629,0x927125},
	{2090,832,0x663d22},
	{2091,1025,0x5c3611},
}

聊天界面 = {
	{56,1364,0xec915f},
	{165,1372,0xec915f},
	{741,1359,0xfaf2ea},
	{854,1372,0xf4b25f},
	{1039,1370,0xf4b25f},
	关闭 = {1064,77,0xf0dad6},
}

战斗失败 = {
	{1842,371,0xa69d8d},
	{1700,359,0xd3cec1},
	{1457,408,0x948979},
	{1240,527,0xc4bb90},
	{1037,389,0x635a6f},
}
被顶号了 = {
	{529,359,0xf4b25f},
	{604,353,0xf4b25f},
	{686,358,0xccb49b},
	{460,363,0xccb49b},
	{589,318,0xccb49b},
	点击 = {571,361,0xf4b25f},
}

登陆界面 = {
	{573,526,0xffffff},
	{587,521,0xffffff},
	{583,354,0xffffff},
	{538,213,0xffffff},
	{563,141,0xffffff},
	点击= {575,524,0xfffff7},
}

点击进入游戏 = {
	{730,562,0x282f88},
	{409,575,0x11198d},
	{579,322,0x101062},
	{589,231,0x0e0e50},
	{576,201,0x0e0e48},
	点击= {649,537,0x443c4b},
}

登陆后活动界面 = {
	{73,83,0xc8c8c8},
	{45,87,0xc5c5c5},
	{48,44,0xd9d9d9},
	{70,49,0xd8d8d8},
	返回 = {83,88,0xcccccc},
	拖动 = {809,367,201,341},
	探索 = {450,116,0xffffbd},
}

登陆后活动界面1 = {
	{73,83,0xe8ebed},
	{45,87,0xe8ebed},
	{48,44,0xe8ebed},
	{70,49,0xe8ebed},
	}
	function 个人攻击()
return false
end
function 准备时识别满字()
return false
end
function 更换时识别满字()
return false
end
function 判断白达摩()
return false
end
function 判断红达摩()
return false
end
function 判断黑达摩()
return false
end
function 判断N卡()
return false
end

function 选择阴阳寮对手()
	return false
end
function 判断击破()
	return false
end
function 阴阳寮攻击()
	return false
end
function 找关闭按钮()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xe7d6ce,"-1|-30|0x68363f,-34|0|0x7f4646,40|2|0x662c45,-4|39|0x723040,20|-16|0xe5d4ce", 93, 0, 0, 2559, 1439)
--keepScreen(false)
--sysLog("找关闭按钮"..x..":"..y)
if x > -1 then
  sysLog("找关闭按钮"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end
function 地图找宝箱()
	return false
end

function 找小怪()

	return false
end

function 找boss()

	return false
end

经验怪 = {
{c=0xe0cfa4,str = "-4|0|0xd9c69d,4|-2|0xddcda2,20|-2|0x8d1b1a,19|26|0xf7dd23"},
{c=0xe0cfa5,str = "-7|0|0xcebb93,5|-2|0xd6c59b,19|1|0x951d1d,19|28|0xf5dd23"},
{c=0xe0cfa6,str = "-7|0|0xceba93,5|0|0xe5cea4,20|0|0x901d1c,19|29|0xf7df24"},
{c=0xe0cfa5,str = "-7|0|0xd4c49a,3|0|0xe3cfa5,18|0|0x901d1b,17|28|0xf7de23"},
{c=0xe0cea4,str = "-5|1|0xd9c99f,3|0|0xd8c39a,14|0|0x8e1a1b,13|23|0xf6dc22"},
{c=0xdecdaa,str = "-5|0|0xd7c692,2|0|0xdccba8,12|0|0x8b2020,11|19|0xecd228"},
{c=0xe1d0a8,str = "-7|2|0xd1c298,20|3|0x911f20,20|32|0xf2dd24,-1|2|0xdfcfa6"},
{c=0xdfcfa6,str = "-4|1|0xdccba4,-16|10|0x962525,15|2|0x971d1e,15|24|0xf5dd24"},
{c=0xdfcfa6,str = "-7|0|0xcdb893,20|-2|0x961d1e,-17|11|0x8d1e1f,19|29|0xf6de23"},
{c=0xdfcfa6,str = "-11|0|0xc4ac8b,34|3|0x9b2122,-26|17|0x942323,33|48|0xf8e023"},
{c=0xdfcfa6,str = "-12|0|0xc8af8f,24|-1|0x911b1b,-24|12|0x8e1d1e,22|36|0xf5dc20"},
}
function 找经验怪()

	--sysLog("没有")
	return false
end

function 副本结束领奖()

		return false

end

function 找剧情对话()

	return false
end

function 大眼睛()

	return false
end

function 问号()

	return false
end

function 判断选哪个队伍(y)
	if y < 530 then
		click(random_click(进入队伍[1][1],进入队伍[1][2]))
	elseif y < 770 then
		click(random_click(进入队伍[2][1],进入队伍[2][2]))
	elseif y < 1000 then
		click(random_click(进入队伍[3][1],进入队伍[3][2]))
	else
		click(进入队伍[4][1],进入队伍[4][2])
	end
end

识别参数1440 = {
{c=0x2d2a25,str = "13|20|0x292622,34|18|0x292622,86|22|0x292622,69|0|0x35322d,85|-13|0x282521,-22|4|0xd8ba8c,115|9|0xdecdb4,27|12|0x322f2a,76|5|0x302d28"},--椒图
{c=0x3c3833,str = "-14|27|0x33302b,-33|19|0xdcbe8e,24|29|0x292622,41|5|0x282521,72|28|0x2c2924,62|-4|0x2e2b27,124|-8|0x2b2824,129|27|0x2e2b26,149|10|0xdecdb4"},--鬼使黑
{c=0x3d3a34,str = "8|13|0x36332e,6|32|0x272420,19|6|0x2c2925,61|8|0x2c2925,52|-4|0x2f2c28,64|28|0x2d2a26,55|22|0x282521"},--骨女
{c=0x393630,str =	"11|22|0x292622,57|8|0x272420,53|21|0x302d29,31|6|0x292622,104|11|0x302d28,106|29|0x282521,97|24|0x272420"},--二口女
{c=0x2f2c27,str = "-5|20|0x272420,-45|4|0xdabb8b,28|-7|0x35322d,53|18|0x272420,62|-10|0x282521,95|-4|0x292621,115|15|0x2a2723,135|4|0xdecdb4,22|9|0x292621"},--海坊主
{c=0x302c27,str = "-3|-14|0x2e2b26,19|-15|0x2d2925,27|-2|0x272420,51|10|0x282521,53|-3|0x2e2a26,108|-6|0x2a2723,130|10|0x282521"},--鸟
{c=0x3a3631,str = "2|12|0x2c2925,40|22|0x3a3732,90|0|0x312e29,87|12|0x36332e,148|23|0x2d2a25,-18|13|0xdcbe8d,189|14|0x433f39,197|5|0x272420,229|-4|0xdecdb4"},--经验怪
{c=0x302d29,str = "15|15|0x2a2723,-42|6|0xdec090,15|-8|0x2a2723,68|5|0x302d29,61|-24|0x2b2823,115|-3|0x322f2a,127|14|0x302d28,149|3|0x413e38,175|-6|0x36332e"},--金币怪
{c=0x33302b,str = "40|3|0x292622,65|-28|0x2b2824,83|-32|0x302d28,134|-36|0x35322d,132|6|0x292622,187|6|0x272420,199|-19|0x33302b"},--跳跳
{c=0x282521,str = "23|-2|0x292622,20|9|0x2c2925,19|-23|0x2f2c27,44|8|0x393631,80|-10|0x312e29,87|-18|0xe3d5bd,-30|-3|0xddbf8e"},--石距
}
function 识别函数(第几个)
	--keepScreen(true)
	local x = -1
	local y=-1
		if 识别参数1440[第几个].c == 0 then
			return false
		end
		x, y = findMultiColorInRegionFuzzy(识别参数1440[第几个].c,识别参数1440[第几个].str, 90,1050,338,1286,1174)

		sysLog(第几个.."识别"..x..":"..y)
		if x > -1 then
			判断选哪个队伍(y)
			mSleep(100)
			判断选哪个队伍(y)
			return true
		end
		return false
end

被顶号了 = {
	{1205,813,0xf4b25f},
	{1380,812,0xf4b25f},
	{1106,815,0xccb49b},
	{1019,819,0xccb49b},
	{1470,817,0xccb49b},
	{1545,817,0xccb49b},
	{1288,715,0xccb49b},
	{1267,893,0xb8a087},
  点击 = {1284,810,0xf4b25f},
}

登陆界面 = {
	{1311,803,0xffffff},
	{1308,734,0xffffff},
	{1217,470,0xffffff},
	{1213,423,0xffffff},
	{1262,318,0xffffff},
	{1661,780,0x5996b9},
	{459,850,0x871c24},
  点击= {1292,1188,0xffffff},
}

点击进入游戏 = {
	{427,832,0x812426},
	{405,583,0xd1d1d9},
	{1197,821,0x0a0a54},
	{1279,700,0x101062},
	{1312,626,0x11115b},
	{1652,777,0x4a7fa8},
	{1292,827,0x0b0b55},
  点击= {1292,1188,0xffffff},
}

登陆后活动界面 = {
	{53,45,0xc6c6c6},
	{82,41,0xc6c6c6},
	{53,80,0xc6c6c6},
	{86,83,0xc6c6c6},
	{95,63,0xc6c6c6},
  返回 = {64,62,0xd2d2d2},
  拖动 = {2009,367,101,341},
  探索 = {1006,272,0xffffd6},
}

登陆后活动界面1 = {
  {73,83,0xe8ebed},
  {45,87,0xe8ebed},
  {48,44,0xe8ebed},
  {70,49,0xe8ebed},
}

战斗中调整视角 = {
	{32,513,0x923155},
	{40,512,0x9b355c},
	{40,506,0x983459},
	点击 ={40,512,0x9b355c},
}

个人突破打开了奖励 = {
	{545,407,0xccb49b},
	{559,338,0xccb49b},
	{436,407,0xea2d10},
	{412,415,0x5e4566},
	{407,385,0x5f4667},
	点击 ={736,403,0x2a2824},
}

打标记位置 = {
	{745,111,0x4f3886},
	{803,404,0xbdd6f2},
}

悬赏邀请 = {
	{1697,851,0x52ae5c},
	{1726,825,0x5cb768},
	{1703,1044,0xda6957},
	{1722,1012,0xdf7360},
	接受 = {1698,850,0x53af5d},
	拒绝 = {1703,1036,0xdd725f},
}

好友界面 = {
	{1111,1242,0xe3c297},
	{1928,1243,0xe8c699},
	{2070,1250,0xf3b25e},
	{2245,1256,0xf3b25e},
  关闭 = {2367,153,0xe3cec9},
}

体力不足界面 = {
	{1189,957,0xf3b25e},
	{1386,956,0xf3b25e},
	{1158,764,0x0d0e0b},
	{1581,752,0xd6c9b9},
	{929,742,0xd6c9b9},
	购买 = {1287,957,0xf3b25e},
	关闭 = {1870,388,0xe8d4cf},
}