 主界面 = {--1
	{1983,70,0xd5c4a2},
	{1874,68,0xd5c49f},
	{1937,1371,0xdacac2},
	{1898,1436,0xdacac2},
	{1977,1340,0xad7c52},
	探索 = {1120,291,0xffffaa},
	打开菜单 = {1929,1392,0x801d1},
	组队 = {385,1406,0xcbc2b2},
	邮件 = {1873,57,0xd6c6a5},
}

 主界面1 = {--1
	{2013,1414,0xdbcbc2},
	{1572,1347,0xc22e2e},
	{1035,1372,0xc9c1b8},
	{851,1431,0xda6e2c},
	{385,1406,0xcbc2b2},
}

主界面没打开卷轴 = {
	{1898,1466,0xd0ad7b},
	{1912,1434,0xd9c7c2},
	{1951,1367,0xe0d0cb},
	{1986,1338,0xd9ae6a},
}

主界面打开卷轴 ={
	{1998,1473,0xe0be8b},
	{2014,1499,0x7c2a2b},
	{1998,1408,0xdecdc7},
	{2006,1327,0xcfa76e},
	{865,1433,0xda6e2a},
}

商城界面 = {--
	{785,222,0xeb2f12},
	{775,223,0xcbaa8f},
	{132,123,0xe3dac2},
	{430,159,0x563e35},
	{589,162,0x553c34},
	体力 = {221,318,0xff4061},
	关闭 = {952,196,0xe8d4cf},
}

邮件界面 = {--
	{171,1205,0xefd6a5},
	{188,1204,0xf5d4a3},
	{206,1202,0xf4d4a3},
	{188,1241,0xe2af6f},
	{145,1242,0x281818},
	{243,1242,0x261616},
	未读 = {351,491,0xc75c4b},
	收取 = {1353,1173,0xf4b25f},
	关闭 = {1883,318,0xe5d4cc},
}

购买体力 = {--
	{457,466,0xf4b25f},
	{573,466,0xf4b25f},
	{389,330,0x0d0f0b},
	{402,316,0xffa234},
	{423,301,0x5c4465},
	购买 = {516,469,0xf4b25f},
}

体力不足判断 = {
	{525,210,0xf7f7f7},
	{534,209,0xf6f6f6},
	{562,210,0xffffff},
	{603,216,0xfefefe},
}
 
个人突破 = {--
	{135,598,0xf4b25f},
	{256,593,0xf4b25f},
	{574,606,0xb3b3b3},
	{908,605,0xb7323d},
	阴阳寮 = {986,369,0x5d3d2c},
	关闭 = {951,153,0xd78787},
	刷新 = {837,527,0xf2b15},
}

阴阳寮突破 = {--
	{332,233,0x71160e},
	{332,374,0x6f140c},
	{332,512,0x73160f},
	{941,164,0x783e47},
}

阴阳寮选择 ={--
	{230,233,0x534b42},
	{238,369,0x534b42},
	{240,501,0x534b42},
	点击 = {173,607,0xcab299},
}

对手选择 = {--
	{483,231,0xa4937b},
	{746,236,0xa4937b},
	{484,330,0xa4937b},
	{745,329,0xa4937b},
	{481,423,0xa4937b},
	{743,424,0xa4937b},
	{481,520,0xa4937b},
	{742,518,0xa4937b},
	{482,611,0xa4937b},
	{745,611,0xa4937b},
}

个人突破选择 = {--
	{258,223,0x656058},
	{520,223,0x656058},
	{790,218,0x5d3d24},
	{251,309,0x656058},
	{523,309,0xcac1b1},
	{790,308,0xcac1b1},
	{251,401,0xcac1b1},
	{524,400,0xcac1b1},
	{778,396,0xcac1b1},
}

突破卷满 = {--
	{803,20,0xdfd8c5},
	{798,27,0xe7e0ce},
	{798,28,0xe4ddcb},
	{800,25,0xe3dcca},
}

 退出战斗 = {--
	{758,876,0xf4b25f},
	{879,861,0xf4b25f},
	{1150,874,0xf4b25f},
	{1300,865,0xf3b15f},
	{974,859,0xccb49b},
	取消 = {822,872,0xf4b25f},
}

好友界面 = {--
	{875,1171,0xec915f},
	{920,1177,0xec915f},
	{1550,1178,0xfaf2ea},
	{1653,1183,0xf4b25f},
	{1783,1188,0xf4b25f},
	关闭 = {1896,306,0xe7d3d3},
}

 推图中 = {--
	{31,52,0xeef6fe},
	{53,51,0x334c7d},
	{754,15,0xe42622},
	{915,28,0xd5c4a2},
	{758,26,0xfa9341},
  锁定式神 = {801,706,0x4b5ee9},
	右边 = {1294,930,0xc6bdb5},
	左边 = {243,591,0x4b5391},
	退出 = {30,52,0xeef6fe},
	确认退出 = {616,414,0x58462f},
	买体力 = {867,25,0xd5c4a2},
 }

退出探索 = {--
	{358,419,0xf4b25f},
	{451,422,0xf4b25f},
	{578,424,0xf4b25f},
	{660,424,0xf4b25f},
	{512,413,0xccb49b},
	确认退出 = {613,423,0xe5a75a},
}

剧情中 = {--
	{29,24,0xd5c4a2},
	{28,39,0xd5c4a2},
	{41,35,0xd6c5a4},
	{95,37,0xd5c4a2},
	{95,26,0xd5c4a3},
}

战斗结束领奖 = {--
	{986,799,0xbb461a},
	{949,803,0xb93e22},
	{1077,808,0xba401b},
	{1026,711,0xe7e0cd},
	{984,602,0xc34f28},
	点击 = {1110,990,0x3d3011},
}

战斗中 = {--
	{20,1394,0x5b5374},
	{2007,479,0x2f1e15},
	{2032,529,0x5d4428},
	{2016,528,0x4b3323},
	自动战斗 = {88,1446,0x7c6b48},
}

领奖结束 = {--
	{1091,1028,0xbb3e1b},
	{998,1023,0xbb471a},
	{918,857,0xd88016},
	{1047,913,0xc4ad8e},
	{1178,988,0xd29017},
	点击 = {1110,990,0x3d3011},
}

战斗胜利 = {--
	{1465,279,0xdbc697},
	{1316,281,0xdbc697},
	{1053,388,0xd8b375},
	{829,333,0xa21b11},
	{1024,361,0xf14a36},
	点击 = {1110,990,0x3d3011},
}

战斗失败 = {--
	{1168,274,0xbcb4a6},
	{1354,288,0xd7d2c5},
	{957,262,0x5a4c38},
	{811,311,0x5d5467},
	{748,236,0x544e60},
}

发现妖怪 = {--
	{484,554,0xf1ecd9},
	{484,561,0xf1ecd9},
	{476,582,0xeae5d2},
	{476,592,0xe5dfcd},
	{502,592,0xdfd9c7},
	{502,585,0xe5e0cd},
	{610,586,0xd1cbba},
	{610,593,0xe0dac8},
	点击 = {562,615,0x896540},
}

副本大地图 = {--
	{35,45,0xeef6fe},
	{60,45,0x25356f},
	{915,28,0xd5c4a2},
	{591,20,0xed4d27},
	{157,748,0x2625c1},
	觉醒材料 = {66,725,0x4830d2},--
	御魂 = {157,726,0x2f251c},--
	返回 = {44,43,0xc0d1f3},--
	选图 = {512,374,0x090a0e},--
	结界突破 = {332,729,0x62bbfb},--
	拖动 = {941,471,945,156},--
	十四章 = {438,291,0xe5263f},
	十三章 = {379,298,0xe8d8c4},
	十二章 = {438,292,0x9f5b85},
	买体力 = {704,22,0xd5c4a2},--
	邮件 = {925,19,0xa4936a},--
}

副本选图 = {--
	{945,184,0x493030},
	{951,283,0xffffff},
	{956,372,0x3b221a},
	{952,473,0x493030},
}

副本探索界面 = {--
	{725,528,0xf4b25f},
	{798,525,0xf4b25f},
	{257,461,0x630909},
	{325,464,0xc7ad94},
	探索 = {763,521,0xf4b25f},
	普通 = {277,270,0xdeb7cf},
	困难 = {381,270,0x50473c},
}

获得奖励提示 = {--
	{289*2,419*2,0x88673d},
	{732*2,413*2,0x8c6b40},
	{457*2,280*2,0xf0e0ae},
	{538*2,288*2,0xead9a0},
	{597*2,280*2,0xf2e1ae},
	点击 = {523*2,634*2,0x0e1118},
}

战斗准备 = {--1
	{1761,1493,0xefd7a8},
	{1810,1490,0xd6a86d},
	{1860,1460,0xe5c38a},
	{1896,1422,0x201c18},
	{1979,1490,0xf1daac},
	点击 = {1869,1286,0xc78d5c},
}

跳过对话 = {--
	{678,626,0x5037da},
	{677,616,0x694bdb},
	{685,633,0x4341e0},
	{736,624,0x1f3f8c},
	{688,623,0x69c0fe},
	点击 = {707,625,0x22180f},
}

快进 = {--
	{905,181,0x5959eb},
	{915,181,0x4044db},
	{942,169,0x2547b1},
	{944,160,0x1e3c98},
	点击 = {926,171,0xefead7},
}

提示框 = {--
	{382,442,0xdd6951},
	{453,443,0xdd6951},
	{566,443,0xf4b25f},
	{647,442,0xf3b15f},
	取消 = {421,438,0xdd6951},
	确定 = {602,435,0xf4b25f},
}

觉醒选择界面 = {--
	{142,278,0xfbc6aa},
	{439,281,0xc3e7bb},
	{830,282,0x1caae5},
	{837,381,0x656372},
	点击 = {998,385,0xfee4bd},
	关闭 = {971,182,0xcdafad},
}

觉醒挑战界面 = {--
	{483,525,0xf4b25f},
	{550,531,0xf4b25f},
	{646,522,0xff7834},
	{724,524,0xf4b25f},
	{789,527,0xf4b25f},
	组队 = {514,530,0xf4b25f},
	挑战 = {765,528,0x332c24},
	拖到前4层 = {317,264,318,432},
	拖到后4层 = {318,432,317,264},
	拖动 = {334,436,328,353},
	拖动1 = {361,164,366,276},
	关闭 = {838,227,0xebd8d1},
}

觉醒选择第几层 = {--
	{328,259,0xc0b8af},
	{322,322,0xc0b8af},
	{319,385,0x34312c},
	{329,437,0xb0a9a0},
}

组队界面有左边 = {--1
	{140,641,0x8d7245},
	{132,711,0xa52729},
	{111,509,0xe5ca6f},
	{923,411,0x6b523e},
	{1907,646,0x8d7245},
	{621,757,0x795943},
	{619,869,0x725440},
}

组队界面 = {--1
	{140,641,0x8d7245},
	{132,711,0xa52729},
	{111,509,0xe5ca6f},
	{923,411,0x6b523e},
	{1907,646,0x8d7245},
	{621,757,0xc7bdb4},
	{619,869,0xc7bdb4},
	刷新 = {1127,1295,0xf3b25e},
	创建 = {1569,1300,0xf3b25e},
	加入 = {1699,636,0x673c21},
	拖动 = {404,1265,396,590},
	妖力封印 = {397,1225,0xe8d6c1},
	石距 = {396,1027,0xe8d6c1},
	点一下 = {721,1281,0xc7bdb4},
	关闭 = {1909,498,0xe9d5cf},
}

组队详情= {--
	{370,1153,0xdd6951},
	{603,1154,0xdd6951},
	{1324,1149,0xfe7a30},
	{1308,1174,0x0c0d0a},
	离开队伍 = {242,571,0xdd6951},
	开始战斗 = {1453,1154,0xf4b25f},
	开组2人 = {753,353,0x777777},
	开组3人 = {451,339,0x777777},
}

创建队伍 = {--
	{570,1112,0xdd6951},
	{712,1114,0xdd6951},
	{1055,1116,0xccb49b},
	{1342,1111,0xf4b25f},
	{1470,1114,0xf4b25f},
	创建 = {1408,1111,0xd39a52},
	取消 =  {642,1110,0xdd6951},
	买体力 = {872,187,0x585143},
}

邀请队友 = {--
	{370,552,0xdd6951},
	{439,554,0xdd6951},
	{585,555,0xf4b25f},
	{658,555,0xf4b25f},
	取消 = {405,553,0xd96850},
}


进入队伍 = {--1
	{1699,633,0x48240c},
	{1701,793,0x51270d},
	{1700,960,0x6b4123},
	{1699,1127,0x693820},
}

聊天界面 = {--
	{42,1486,0xec915f},
	{119,1484,0xec915f},
	{596,1467,0xf8f8f0},
	{670,1476,0xf4b25f},
	{832,1486,0xf4b25f},
	关闭 = {854,61,0xedd9d3},
}

被顶号了 = {
	{471,419,0xf4b25f},
	{552,416,0xf4b25f},
	{600,417,0xccb49b},
	{396,412,0xccb49b},
	{515,422,0xf4b25f},
	点击 = {515,421,0xf4b25f},
}

登陆界面 = {
	{1011,450,0xffffff},
	{966,557,0xffffff},
	{1053,755,0xffffff},
	{1053,847,0xffffff},
	{1026,1141,0xffffff},
	{1084,1084,0xffddc8},
	点击= {1028,1141,0xffffff},
}

点击进入游戏 = {
	{286*2,573*2,0x496264},
	{446*2,608*2,0x2f4651},
	{644*2,586*2,0x3c555f},
	{945*2,431*2,0x4c86a7},
	{161*2,325*2,0x779dcc},
	点击= {545,481,0x070749},
}
战斗失败 = {
	{1349,305,0xbbb4a6},
	{1487,296,0xa39a8b},
	{1172,276,0xbcb5a7},
	{975,421,0xb4a97c},
	{824,317,0x60576c},
}
被顶号了 = {
	{529,359,0xf4b25f},
	{604,353,0xf4b25f},
	{686,358,0xccb49b},
	{460,363,0xccb49b},
	{589,318,0xccb49b},
	点击 = {571,361,0xf4b25f},
}

登陆界面 = {
	{573,526,0xffffff},
	{587,521,0xffffff},
	{583,354,0xffffff},
	{538,213,0xffffff},
	{563,141,0xffffff},
	点击= {575,524,0xfffff7},
}

点击进入游戏 = {
	{730,562,0x282f88},
	{409,575,0x11198d},
	{579,322,0x101062},
	{589,231,0x0e0e50},
	{576,201,0x0e0e48},
	点击= {649,537,0x443c4b},
}

登陆后活动界面 = {
	{73,83,0xc8c8c8},
	{45,87,0xc5c5c5},
	{48,44,0xd9d9d9},
	{70,49,0xd8d8d8},
	返回 = {83,88,0xcccccc},
	拖动 = {809,367,201,341},
	探索 = {450,116,0xffffbd},
}

登陆后活动界面1 = {
	{73,83,0xe8ebed},
	{45,87,0xe8ebed},
	{48,44,0xe8ebed},
	{70,49,0xe8ebed},
	}
	function 个人攻击()
return false
end
function 准备时识别满字()
return false
end
function 更换时识别满字()
return false
end
function 判断白达摩()
return false
end
function 判断红达摩()
return false
end
function 判断黑达摩()
return false
end
function 判断N卡()
return false
end

function 选择阴阳寮对手()
	return false
end
function 判断击破()

	return false
end
function 找关闭按钮()--
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xe9dbd4,"4|-31|0x6d3540,-30|0|0x763b3f,33|-2|0x682c40,-5|30|0x71313e,15|-16|0xe8d5cf", 93, 0, 0, 2047, 1535)
--keepScreen(false)
--sysLog("找关闭按钮"..x..":"..y)
if x > -1 then
  sysLog("找关闭按钮"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 个人攻击()--

	return false
end

function 阴阳寮攻击()

	return false
end

function 地图找宝箱()

	return false
end

function 找小怪()--

	return false
end

function 找boss()--

	return false
end

经验怪 = {
  {c=0xdecea4,str = "-13|1|0xb79f7b,17|3|0x8b2121,17|-9|0x2e6979,16|28|0xf9da17"},
  {c=0xe0cfa6,str = "-9|0|0xc4ab8a,22|-2|0x931c1c,22|-14|0x2e6b7e,21|30|0xf7dd22"},
  {c=0xdecda4,str = "-11|2|0xb79d7c,22|32|0xf4dc22,25|0|0x842222,21|-10|0x387881"},
  {c=0xe2cfa3,str = "-8|0|0xb89e7c,15|-2|0x8c1a19,14|-9|0x2f6e7d,14|20|0xf8db1b"},
  {c=0xdfcea4,str = "-14|0|0xbea583,43|-1|0x801b1a,35|-19|0x4e7677,39|47|0xf5dc1a"},
  {c=0xdecda3,str = "-13|2|0xd2c297,30|50|0xf5dd23,32|2|0x8c1b1a,29|-17|0x327380"},
  {c=0xe0cfa6,str = "-9|0|0xceb894,19|2|0x901d1e,19|-10|0x316f7b,18|30|0xf5db21"},
  {c=0xcebd9d,str = "64|-2|0x911d1d,65|-33|0x26687d,70|52|0xfb9017,-36|28|0x8a2021"},
  {c=0xe1ca9e,str = "74|1|0x831e1a,70|-29|0x205d74,-47|3|0x2d6b78,72|60|0xfa9916"},
  {c=0xdfc79a,str = "53|-20|0x2b707d,54|1|0x8c1518,-27|27|0xa02423,56|45|0xfaa015"},
  {c=0xe1cfa8,str = "77|6|0x861c1b,71|-32|0x23657b,-48|6|0x2b677b,73|58|0xf79017"},
  {c=0xe4cc9b,str = "58|4|0x921f1d,64|-27|0x20556f,65|55|0xfe9517,-58|0|0x2d7f8a"},
  {c=0xe1d1a9,str = "59|3|0x8c1619,59|-30|0x1f5d76,-38|28|0x8f1f1e,59|49|0xf48b18"},
  {c=0xe6cc9b,str = "42|-17|0x296d7e,47|4|0x82181c,-23|18|0x8d2119,45|36|0xfa8e17"},
  {c=0xe2cea0,str = "24|1|0x8b1317,24|-11|0x256378,-20|1|0x326673,25|22|0xfb9716"},

}
function 找经验怪()--
keepScreen(true)
sysLog("找经验怪")
sysLog('mTime:' .. mTime())
for i=1,#经验怪 do
  x, y = findMultiColorInRegionFuzzy(经验怪[i].c,经验怪[i].str,  92, 0, 400, 2040, 1530)
  if x > -1 then
    sysLog(i.."找到经验怪"..x..":"..y)
    point = findMultiColorInRegionFuzzyExt(0xadaed9,"-14|-46|0xf4b5c0,11|15|0x333a6b,-27|-11|0x384173,26|2|0xd07f83",90, x-400, y-700, x+400, y-100)
    --mSleep(500)
    --keepScreen(false)
    if #point ~= 0 then	
      local temp_table = {}
      for var = 1,#point do
        if var == 1 then
          table.insert(temp_table,point[var])
        else
          if math.abs((point[var].x-point[var-1].x)) > 50 then
            table.insert(temp_table,point[var])
          end
        end
      end
      if #temp_table ~= 0 then
        --print(temp_table)
        if #temp_table == 1 then
          sysLog("找到攻击"..temp_table[1].x..":"..temp_table[1].y)
					--showHUD(id,"找到攻击"..temp_table[1].x..":"..temp_table[1].y,20,"0xff130c09","0xffffffff",0,50,50,200,50)
          click(temp_table[1].x,temp_table[1].y)
					--mSleep(3000)
					sysLog('mTime:' .. mTime())
          return true
        else
          local final_x = temp_table[1].x
          local final_y = temp_table[1].y
          for t = 2,#temp_table do
            if math.abs((temp_table[t].x - x))+math.abs((temp_table[t].y - y)) < math.abs((final_x - x))+math.abs((final_y - y)) then
              final_x = temp_table[t].x
              final_y = temp_table[t].y
            end
          end
          sysLog("找到攻击"..final_x..":"..final_y)
					--showHUD(id,"找到攻击"..final_x..":"..final_y,20,"0xff130c09","0xffffffff",0,50,50,200,50)
					click(final_x,final_y)
					--mSleep(3000)
					sysLog('mTime:' .. mTime())
          return true
        end
      end
    end
  end
end
--sysLog("没有")
sysLog('mTime:' .. mTime())
return false
end

金币怪 = {
{c=0xd9c875,str = "-1|6|0xceb553,19|9|0x6f3828,32|18|0xeeaa1f,29|23|0xf2dd1f"},
{c=0xdecc7a,str = "0|9|0xdecc72,23|9|0x713f26,41|23|0xeaa31c,38|31|0xefdd22"},
{c=0xd9c975,str = "-2|8|0xceb553,26|11|0x6e3927,40|23|0xf99c17,38|32|0xf7de24"},
{c=0xdecd79,str = "-2|9|0xdecd74,22|11|0x6f3c26,40|25|0xefac19,37|32|0xf5e42a"},
{c=0xd8c977,str = "-2|7|0xd1ba58,29|12|0x6a3523,49|27|0xedaa1a,44|35|0xeddd23"},
{c=0xe0d07b,str = "1|15|0xd9c96c,35|17|0x63321f,52|34|0xfa9618,53|48|0xeedd23"},
{c=0xddcc7a,str = "-1|8|0xdece75,36|13|0x62301e,58|32|0xf8a40d,51|43|0xf8dc1d"},
{c=0xdbcc7a,str = "-5|13|0xc9b04f,36|15|0x6f3d26,58|34|0xf9a310,53|45|0xfbdc18"},
{c=0xe1d282,str = "-5|9|0xd5c560,28|14|0x683821,49|31|0xe8a620,43|40|0xecdc21"},
{c=0xdbcd79,str = "-6|15|0xc5ad4b,38|19|0x6f3726,61|36|0xf7921c,58|52|0xf3dc21"},
{c=0xe4d48a,str = "-4|16|0xd5c669,35|20|0x62301d,60|39|0xeda81b,57|48|0xfddf1a"},
{c=0xdccd77,str = "-3|13|0xd6c569,23|11|0x6f3f24,43|27|0xecaa1a,40|35|0xf3e328"},
}
function 找金币怪()--

	return false
end

御魂怪 = {
{c=0xd63126,str = "4|-17|0xefead9,25|9|0xf5db21,1|-36|0xd05c2c,-6|0|0xd63126"},
{c=0xd63021,str = "-6|0|0xd52f24,3|-15|0xf8f8e7,9|-30|0xd34e27,20|7|0xf9db19"},
{c=0xd62d26,str = "-14|-1|0xd72d25,35|12|0xf0db21,-3|-52|0xd65c2c,5|-27|0xf6f6e7"},
{c=0xd53424,str = "-11|2|0xdb2e26,32|12|0xf5db21,4|-22|0xf6e5d5,-1|-48|0xd35929"},
{c=0xd82d24,str = "-11|0|0xd82e26,36|13|0xf4db21,4|-27|0xf6f6e3,-2|-55|0xd35928"},
{c=0xd03526,str = "-9|-1|0xd33323,31|10|0xf7da18,4|-19|0xf1f1e0,1|-38|0xd25828"},
{c=0xd82e26,str = "-8|0|0xd82e26,37|11|0xeddb21,8|-29|0xd7cec6,-1|-53|0xd15728"},
{c=0xd43324,str = "-8|0|0xd63124,22|8|0xf8db1a,4|-16|0xf5f4e4,-2|-33|0xd15727"},
{c=0xd43223,str = "-14|0|0xd92e22,29|11|0xf5db21,-3|-44|0xce5523,0|-21|0xf1eedc"},
{c=0xd0411f,str = "-12|1|0xd43322,29|13|0xeedc21,3|-18|0xf2f1e0,-3|-38|0xd15726"},
{c=0xd23622,str = "-5|0|0xcf3322,20|7|0xfcd910,4|-14|0xf7f7e7,0|-29|0xd15b2a"},
{c=0xda2e25,str = "-3|0|0xd92d24,21|6|0xf5db21,5|-17|0xf7f7e7,1|-32|0xd45a29"},
}
function 找御魂怪()--

	return false
end

function 副本结束领奖()--
	--keepScreen(true)
	local x=-1
	local y=-1

	x, y = findMultiColorInRegionFuzzy(0x7d3317,"-8|-5|0xfff4d3,-7|8|0xfff4d3,10|7|0xfff4d3,12|-6|0xfff4d3,4|-13|0x5d2313",  90, 0, 50, 1000, 700)
	--sysLog("副本结束领奖"..x..":"..y)
	if x > -1 then
		click(random_click(x,y))
		mSleep(500)
		return true
	end
end

function 找剧情对话()--

	return false
end

function 大眼睛()--

	return false
end

function 问号()--

	return false
end

function 判断选哪个队伍(y)--1
	if y < 712 then
		click(random_click(进入队伍[1][1],进入队伍[1][2]))
	elseif y < 874 then
		click(random_click(进入队伍[2][1],进入队伍[2][2]))
	elseif y < 1040 then
		click(random_click(进入队伍[3][1],进入队伍[3][2]))
	else
		click(进入队伍[4][1],进入队伍[4][2])
	end
end

识别参数1536 = {
{c=0x35322d,str = "-17|8|0xdebd86,28|16|0x2d2a25,56|1|0x35322d,94|3|0xdfcdb3,11|-6|0x3e3b35,44|-8|0x33302b,68|-10|0x272420,60|5|0x2c2824,68|18|0x2d2a26"},--椒图
{c=0x383530,str = "10|-3|0x322e2a,19|22|0x312e29,-24|7|0xdebd88,32|4|0x282521,57|23|0x282521,57|4|0x2e2b27,99|-6|0x2a2723,122|11|0xdfcdb3,87|12|0x272420"},--鬼使黑
{c=0x3e3b35,str = "8|9|0x302d28,-2|31|0x292622,-34|18|0xdcb981,36|22|0x272420,45|26|0x2d2a26,42|11|0x2d2a26,70|14|0xdfcdb3,-21|13|0x3c3933"},--骨女
{c=0x312e29,str = "-5|10|0xdecdb4,-22|21|0x292621,-36|12|0xdabc8d,49|5|0x282521,37|12|0xdfc496,45|16|0x322f2a,89|24|0x2c2924,87|8|0x2d2a26,117|15|0xdecdb4"},--二口女
{c=0x2e2b27,str ="-3|17|0x272420,-38|5|0xdebc86,43|15|0x272420,23|-4|0x2e2b26,76|3|0x272420,76|13|0x272420,85|-8|0x3b3832,116|6|0xdfcdb3,38|1|0x2a2723"},--海坊主
{c=0x332f2a,str="7|10|0x272420,-15|12|0x2c2924,-17|1|0x332f2a,27|9|0x2f2b27,40|5|0x36322c,42|-11|0x2f2b27,71|7|0x2c2924,90|20|0x272420"},--鸟
{c=0x312e29,str="32|17|0x3a3631,51|19|0x292622,73|-1|0x2b2824,117|17|0x292622,114|-10|0x3b3832,160|18|0x33302b,158|3|0x272420,150|-2|0x2e2b26,27|-8|0x3e3b35"},--经验
{c=0x302c28,str="16|-4|0x2a2723,-29|4|0xdcba83,55|5|0x312e29,50|-19|0x35322d,102|11|0x2f2c27,98|-15|0x36332e,135|5|0x35322d,144|-3|0x292622,119|14|0x43403a"},--金币
{c=0x38352f,str="34|1|0x2f2c27,54|-24|0x3e3b35,77|1|0x2b2823,108|4|0x292622,111|-31|0x302d29,152|5|0x272420,163|-16|0x403d37,68|-16|0x5f5b53,10|-24|0x302d28"},--跳跳
{c=0x292621,str="17|1|0x272420,15|-17|0x2b2824,35|8|0x292622,50|10|0x37342f,50|-15|0x302d28,64|10|0x3d3a35,83|-2|0xdecdb4"},--石距
}
function 识别函数(第几个)--1
	--keepScreen(true)
	local x = -1
	local y=-1
		if 识别参数1536[第几个].c == 0 then
			return false
		end
		x, y = findMultiColorInRegionFuzzy(识别参数1536[第几个].c,识别参数1536[第几个].str,90, 846,564,1017,1162)
		if x > -1 then
			sysLog(第几个.."识别"..x..":"..y)
			判断选哪个队伍(y)
			mSleep(100)
			判断选哪个队伍(y)
			return true
		end
		return false
end

被顶号了 = {
	{602,403,0xf4b25f},
	{685,402,0xf4b25f},
	{530,407,0xccb49b},
	{756,400,0xccb49b},
	{633,361,0xccb49b},
	{461,404,0xccb49b},
	{667,445,0xbda48b},
  点击 = {648,404,0xf4b25f},
}

登陆界面 = {
	{1050,839,0xffffff},
	{1047,788,0xffffff},
	{969,568,0xffffff},
	{1013,446,0xffffff},
	{363,864,0x8b1c25},
	{1334,840,0x518cb5},
	{1054,764,0xffffff},
  点击= {1017,1137,0xffffff},
}

点击进入游戏 = {
	{985,865,0x121161},
	{920,769,0x15135e},
	{1111,855,0x121063},
	{1141,788,0x14125d},
	{370,856,0x8d1d26},
	{1332,834,0x528eb6},
	{325,774,0xa8a6a7},
   点击= {1017,1137,0xffffff},
}

登陆后活动界面 = {
	{64,113,0xe7eaec},
	{93,113,0xe7eaec},
	{62,59,0xfbfcfc},
	{88,58,0xfbfcfc},
	{116,82,0xf2f4f5},
  返回 = {78,88,0xe7e9ea},
  拖动 = {909,367,101,341},
  探索 = {506,133,0xffffc1},
}

登陆后活动界面1 = {
  {73,83,0xe8ebed},
  {45,87,0xe8ebed},
  {48,44,0xe8ebed},
  {70,49,0xe8ebed},
}

战斗中调整视角 = {
	{32,513,0x923155},
	{40,512,0x9b355c},
	{40,506,0x983459},
	点击 ={40,512,0x9b355c},
}

个人突破打开了奖励 = {
	{545,407,0xccb49b},
	{559,338,0xccb49b},
	{436,407,0xea2d10},
	{412,415,0x5e4566},
	{407,385,0x5f4667},
	点击 ={736,403,0x2a2824},
}

打标记位置 = {
	{745,111,0x4f3886},
	{803,404,0xbdd6f2},
}

悬赏邀请 = {
	{679*2,430*2,0x57b361},
	{689*2,425*2,0x58b562},
	{682*2,503*2,0xde6e5c},
	{689*2,498*2,0xdf7866},
	接受 = {679*2,428*2,0x50ac5a},
		拒绝 = {681*2,508*2,0xd96856},
}

体力不足界面 = {
	{473*2,481*2,0xf3b25e},
	{557*2,476*2,0xf3b25e},
	{361*2,392*2,0xd6c9b9},
	{648*2,391*2,0xd6c9b9},
	{695*2,308*2,0xd3ccc3},
	{505*2,478*2,0xf14828},
	购买 = {515*2,479*2,0xf3b25e},
	关闭 = {749*2,252*2,0xe8d4cf},
}