主界面 = {
  --{1038,26,0xd5c4a2},
  --{1103,38,0xd5c4a3},
  {1070,547,0xcdbcb4},
  {1096,533,0xac7a51},
  {1051,558,0x7d1a1a},
  {1054,584,0xdbcac2},
  探索 = {603,124,0x27190b},
  打开菜单 = {1119,574,0xd0c0b7},
  组队 = {214,563,0xcdc5b4},
  邮件 = {1031,31,0x998f68},
  阴阳寮 = {354,563,0x494138},
  点头像 = {44,59,0x68584c},
  好友= {743,567,0x8f8798},
  好友红点 = {765,520,0xff1616},
  聊天 = {1096,33,0x787050},
  式神录 = {985,562,0xc79797},
  邮件红点 = {1056,16,0xff0c0c},
  任务 = {608,551,0xbfa5a1},
  点一下 = {188,160,0x2e3237},
}

主界面没打开卷轴 = {
  {1054,601,0xd5b488},
  {1058,578,0xcdbebc},
  {1080,547,0xdacbc7},
  {1102,529,0xd7aa66},
}

主界面打开卷轴 = {
  {1097,619,0x691a21},
  {1109,585,0xdbcac5},
  {1106,555,0xdfcfc9},
  {1114,520,0xc8a05d},
  {220,550,0xe8e6e3},
}

卡屏检测坐标 = {
  {1089,127,0x80518b},
  {1091,203,0x875d94},
  {1099,295,0x6f425b},
  {1098,370,0x6e2f0b},
  {1101,471,0x563a34},
}

卡屏检测坐标1 = {
  {53,185,0x3b2b4b},
  {52,278,0x473245},
  {53,340,0x775147},
  {50,420,0x8b5240},
  {54,472,0x9c6348},
}

斗技界面 = {
  {981,559,0xe8c488},
  {941,515,0xddc6a9},
  {1031,508,0xddc2a2},
  {1005,484,0xdac4ac},
  {1020,601,0x891408},
  点击 = {998,530,0xe1c090},
}


邮件界面 = {
  {94,561,0xf2d5a3},
  {113,559,0xf2d4a2},
  {103,560,0xf2d5a3},
  {132,581,0x2a1b1a},
  {79,584,0x251817},
  未读 = {194,169,0xc75c4b},
  收取 = {711,544,0xf3b25e},
  关闭 = {1047,67,0xe8d4ce},
  拖动 = {315,516,315,173},
  拖动1 = {286,521,286,316},
}

邮件界面模拟器 = {
  {115,85,0xa89f97},
  {119,581,0x9d8f85},
  {966,53,0x483726},
  {358,569,0x3a2a21},
  {318,87,0x493520},
}

购买体力 = {
  {504,417,0xf3b25e},
  {634,416,0xf3b25e},
  {430,263,0x0c0d0a},
  {446,245,0xff9e33},
  {468,236,0x5c4562},
  购买 = {574,416,0xf3b25e},
}

体力不足判断 = {
  {525,210,0xf7f7f7},
  {534,209,0xf6f6f6},
  {562,210,0xffffff},
  {603,216,0xfefefe},
}

主界面1 = {
  {133,551,0xc2b2a9},
  {219,552,0xd8d0c0},
  {975,538,0xe4e4dc},
  {571,548,0xc7bfb7},
  {476,581,0xda6e2c},
}

个人突破 = {
  {291,479,0x732606},
  {288,481,0x742706},
  {142,554,0xf3b25e},
  {275,555,0xf3b25e},
  {628,51,0x735e4f},
  个人 = {1090,188,0xb9661b},
  阴阳寮 = {1090,301,0x917f6f},
  关闭 = {1051,59,0xe8d4cf},
  刷新 = {891,479,0xf3b25e},
}

判断卷是0 = {
  {379,554,0xc0b5a6},
  {379,552,0xc0b5a6},
  {379,550,0xc0b5a6},
  {379,549,0xc0b5a6},
  {367,550,0xc0b5a6},
  {369,550,0xc0b5a6},
  {371,550,0xc0b5a6},
}

判断卷是0模拟器 = {
  {379,554,0xd5c6b5},
  {379,552,0xd5c6b5},
  {379,550,0xd5c6b5},
  {379,549,0xd5c6b5},
  {367,550,0xd5c6b5},
  {369,550,0xd5c6b5},
  {371,550,0xd5c6b5},
}

阴阳寮突破 = {
  {527,48,0xf8f3e0},
  {577,55,0xf8f3e0},
  {552,50,0xf8f3e0},
  --{610,48,0xf8f3e0},
  {1078,279,0x764722},
  {1099,292,0xa95e1b},
  拖动 = {723,563,723,133},
  拖动1 = {724,566,721,103},
}

阴阳寮选择 ={
  {257,155,0xbdae9c},
  {259,320,0xbeafa0},
  {259,486,0xbdae9f},
  点击 = {412,268,0xa39686},
}

阴阳寮选择位置 ={
  {260,164,0xcbc0b4},
  {258,330,0xcbc0b4},
  {257,497,0xcbc0b4},
}

对手选择 = {
  {698,124,0xd0c1ae},
  {1003,123,0xcebeab},
  {702,241,0xcdbda9},
  {1001,243,0xcfbfac},
  {697,362,0xcfc0ad},
  {1004,358,0xccbaa6},
  {700,481,0xcebeaa},
  {1004,481,0xcdbca8},
}

个人突破选择 = {
  {269,143,0xd5c8b8},
  {584,141,0xd5c8b8},
  {896,140,0xd5c8b8},
  {284,258,0xd5c8b8},
  {578,263,0xd5c8b8},
  {897,256,0xd5c8b8},
  {268,382,0xd5c8b8},
  {585,378,0xd5c8b8},
  {913,371,0xd5c8b8},
}

突破卷满 = {
  --{884,24,0x361d0f},
  --{884,26,0x341c0f},
  --{884,28,0x321b0e},
  --{884,30,0x301a0d},
  --{884,32,0x2e190d},
  --{884,34,0x2c180c},
  
  --{711,25,0x351c0f},
  --{710,25,0x351c0f},
  --{709,25,0x351c0f},
  --{708,25,0x341c0f},
  --{707,25,0x341c0f},
  --{706,25,0x351c0f},
  --{705,25,0x341c0f},
  --{704,25,0x341c0f},
  
  --{702,21,0x371e0f},
  --{705,25,0x341c0f},
  --{705,27,0x321b0e},
  --{705,29,0x301a0d},
  --{705,31,0x2e190d},

  {666,21,0x371e0f},
  {666,25,0x341c0f},
  {669,27,0x321b0e},
  {669,29,0x301a0d},
  {669,31,0x2e190d},
}

退出战斗 = {
  {419,376,0xf4b25f},
  {497,378,0xf4b25f},
  {630,374,0xf4b25f},
  {713,375,0xf4b25f},
  取消 = {452,376,0xf4b25f},
  确定 = {672,377,0xf3b25e},
}

好友界面 = {
  {495,551,0xe6c59a},
  {638,562,0xe3dcd4},
  {859,552,0xe6c49a},
  {918,549,0xf3b25e},
  {992,548,0xf3b25e},
  关闭 = {1051,66,0xead4d2},
  添加 = {1081,297,0x5b3824},
  添加红点 = {1118,263,0xa50013},
  点击切换 = {962,114,0x281d1b},
  删除 = {825,112,0xf0806a},
  确认删除 = {667,375,0x4d3f2c},
  空间 = {1088,404,0xc26b1b},
}

空间界面 = {
  {455,430,0x880707},
  {624,91,0xc7bdb4},
  {986,560,0xf3b25e},
  {912,560,0xf3b25e},
  {849,556,0xe3dcd4},
}

推图中 = {
  {34,57,0xeef6fe},
  {38,52,0xeef6fe},
  {39,63,0xedf5fd},
  {1018,19,0x493c2b},
  {1082,32,0xdfc69d},
  锁定式神 = {887,570,0x4b5ee9},
  右边 = {782,500,0x524e4a},
  左边 = {288,448,0x944487},
  退出 = {41,57,0xe9f1fa},
  确认退出 = {690,358,0xf4b25f},
  买体力 = {962,27,0xd6c4a1},
  邮件 = {1012,23,0xccbc98},
  拖动 = {874,502,266,502},
}

退出探索 = {
  {404,359,0xf4b25f},
  {482,354,0xf4b25f},
  {636,365,0xf4b25f},
  {736,358,0xf4b25f},
  确认退出 = {690,358,0xf4b25f},
}

退出探索日服 = {
  {503,360,0xf3b25e},
  {389,356,0xf3b25e},
  {635,358,0xf3b25e},
  {734,358,0xf3b25e},
  {573,367,0xcbb59c},
  --{682,290,0xcbb59c},
  {437,291,0xcbb59c},
}

剧情中 = {
  {36,27,0xd5c4a2},
  {46,34,0xd5c4a2},
  {32,45,0xd5c4a2},
  {95,42,0xd4c3a1},
  {106,40,0xd5c4a3},
}

战斗结束领奖 = {
  --{517,341,0xb83823},
  --{607,337,0xbb461a},
  -- {562,287,0xe8e1ce},
  -- {540,228,0xbc4e25},
  {530,338,0xbb461a},
  {597,341,0xba401b},
  {543,226,0xbd4e25},
  {581,228,0xbe3e21},
  点击 = {110,447,0x192a30},
}

战斗中 = {
  {11,561,0x5e5276},
  {1112,53,0x2e1d12},
  {1126,75,0x3d2a1a},
  {1121,72,0x44301d},
  {97,35,0xd6c4a1},
  {161,33,0xd6c4a1},
  自动战斗 = {51,600,0x6e5a4c},
}

战斗中640 = {
  {11,561,0x5e5276},
  {1112,53,0x2e1d12},
  {1126,75,0x3d2a1a},
  {1121,72,0x44301d},
  {97,35,0xd6c4a1},
  {161,33,0xd6c4a1},
  自动战斗 = {51,600,0x6e5a4c},
}

战斗中750 = {
  {14,654,0x5b537b},
  {1309,92,0x3d2a1a},
  {1306,61,0x302114},
  {1328,64,0xf1b547},
  自动战斗 = {64,693,0x51432f},
}

战斗中720 = {
  {11,634,0x5b5579},
  {1271,568,0x574e7c},
  {1256,58,0x322219},
  {1276,58,0xefb64a},
  自动战斗 = {53,659,0x7c6d4a},
}

战斗中1080 = {
  {19,949,0x605778},
  {1880,91,0x2e1d15},
  {1906,90,0xa57034},
  {1893,123,0x4a3828},
  自动战斗 = {88,989,0x67593c},
}

战斗中1242 = {
  {19,1081,0x534a6e},
  {2162,100,0x2f1f16},
  {2201,103,0xf1b744},
  {2177,142,0x483626},
  自动战斗 = {95,1146,0x7c6c49},
}

战斗中1440 = {
  {20,1263,0x594f77},
  {2504,121,0x31200f},
  {2552,120,0xf1b744},
  {2534,165,0x423221},
  自动战斗 = {114,1316,0x7b6b47},
}

领奖结束 = {
  --{634,549,0x370204},
  {615,468,0xbb391a},
  {668,461,0xd19118},
  {611,410,0xc4ae8f},
  {512,551,0x340204},
  点击 = {110,447,0x192a30},
}

战斗胜利 = {
  {813,153,0xddc99a},
  {725,162,0xd7bf8d},
  {585,215,0xd9b476},
  {532,182,0xbb9964},
  {470,177,0x9c1c12},
  点击 = {110,447,0x192a30},
}

新战斗胜利 = {
  {400,133,0xa01c12},
  {453,131,0xa21b11},
  {422,92,0x7e1910},
  {523,129,0xac8d5a},
  {526,49,0xa38a5a},
}

战斗胜利640 = {
  {813,153,0xddc99a},
  {725,162,0xd7bf8d},
  {585,215,0xd9b476},
  {532,182,0xbb9964},
  {470,177,0x9c1c12},
  点击 = {1020,517,0x393922},
}

新战斗胜利640 = {
  {400,133,0xa01c12},
  {453,131,0xa21b11},
  {422,92,0x7e1910},
  {523,129,0xac8d5a},
  {526,49,0xa38a5a},
}

战斗胜利750 = {
  {856,158,0xf4edce},
  {851,188,0xd9c392},
  {953,174,0xe3d1a6},
  {953,213,0xa58857},
  {530,213,0xa21b11},
  点击 = {1197,605,0xf4edce},
}

新战斗胜利750 = {
  {474,157,0xa01c12},
  {534,158,0xa21b11},
  {498,109,0x801910},
  {611,145,0xa28756},
  {622,101,0x88582b},
}

战斗胜利720 = {
  {506,201,0x9e1c12},
  {449,200,0x9b1c12},
  {820,184,0xd5be90},
  {925,174,0xdac494},
  {595,208,0xc1a86e},
  点击 = {1149,581,0x305869},
}

新战斗胜利720 = {
  {461,147,0x9d1c12},
  {508,145,0x9e1c12},
  {479,100,0x841b12},
  {590,144,0xa3895a},
  {597,98,0x8f5a2a},
}

战斗胜利1080 = {
  {681,302,0x991c12},
  {769,296,0x9b1c12},
  {895,311,0xbf9b64},
  {1226,266,0xdac596},
  {1381,257,0xdecb9d},
  点击 = {1723,872,0x2e4747},
}

新战斗胜利1080 = {
  {679,214,0x991c12},
  {714,152,0x801a11},
  {760,214,0x991c12},
  {891,208,0xa38a5a},
  {903,121,0x7e572a},
}

战斗胜利1242 = {
  {886,346,0x9c1c12},
  {769,353,0x9e1c12},
  {1413,280,0xece0bc},
  {1591,307,0xdbc696},
  {1127,423,0xd8b274},
  点击 = {1982,1003,0x052024},
}

新战斗胜利1242 = {
  {784,257,0x9e1c12},
  {823,178,0x811a11},
  {877,248,0x9a1c12},
  {1029,242,0xa98e5d},
  {1032,134,0x7e582c},
}

战斗胜利1440 = {
  {893,408,0x9e1c12},
  {1030,408,0xa21b11},
  {1210,441,0xb49460},
  {1643,345,0xe2d0a4},
  {1823,338,0xe0cea1},
  点击 = {2298,1163,0x250103},
}

新战斗胜利1440 = {
  {910,294,0x9d1c12},
  {964,197,0x831b12},
  {1026,285,0x981c12},
  {1177,283,0xa58b5b},
  {1184,106,0xa38a5a},
}

发现妖怪 = {
  {548,509,0xf5f0dd},
  {576,520,0xf4efdc},
  {528,544,0xf4efdc},
  {687,552,0xefe9d7},
  点击 = {548,292,0xc7bf8d},
}

副本大地图 = {
  {521,27,0x311910},
  {132,605,0x1c1415},
  {41,54,0xebf3fb},
  {974,109,0x6c4221},
  {515,28,0x311910},
  第三章 = {1034,382,0x3f2a2a},
  最后章 = {1047,494,0x8b714},
  觉醒材料 = {83,594,0x3d98da},
  御魂 = {179,593,0xc3bdad},
  返回 = {47,49,0xeaf3fe},
  选图 = {571,293,0x2c252b},
  结界突破 = {370,596,0x68b2fc},
  拖动 = {1044,169,1035,496},
  十四章 = {438,291,0xe5263f},
  十三章 = {379,298,0xe8d8c4},
  十二章 = {438,292,0x9f5b85},
  买体力 = {782,25,0x585142},
  邮件 = {1017,27,0x4b4536},
  右边拖动 = {1044,158,1041,508},
  右边拖动1 = {1050,549,1040,131},
  右边拖动2 = {1044,208,1041,408},
  右边拖动3 = {1041,408,1044,208},
  御灵 = {468,594,0x3e3121},
  点地面 = {419,431,0xd8c692},
}

副本选图 = {
  {1042,208,0xc7afab},
  {1040,326,0x390a0e},
  {1039,424,0x2a130c},
  {1043,531,0x818181},
}

副本探索界面 = {
  {807,476,0xf4b25f},
  {880,474,0xf4b25f},
  {850,460,0xf4b25f},
  {841,489,0xf4b25f},
  {370,246,0xc8af96},
  探索 = {843,476,0xf4b25f},
  普通 = {303,198,0x84495d},
  困难 = {424,199,0xafa999},
  组队 = {582,475,0xf3b25e},
  挑战 = {982,366,0xc16a19},
}

副本式神挑战界面 = {
  {807,476,0xf4b25f},
  {880,474,0xf4b25f},
  {850,455,0xf4b25f},
  {841,489,0xf4b25f},
  {462,463,0xc7af94},
}

式神挑战选择 = {
  {356,183,0xc1b8ae},
  {360,268,0xc1b8ae},
  {366,350,0x69645e},
}

判断是第二章 = {
  {707,347,0xf52252},
  {706,427,0xd2173a},
  {763,289,0xdf7684},
  {608,419,0x5b7290},
  {829,275,0xe2707f},
}

获得奖励提示 = {
  {464,204,0xdece8c},
  {506,201,0xf3e4b2},
  {546,211,0xecdcaa},
  {598,214,0xead9a0},
  点击 = {567,538,0x271228},
}

获得奖励提示日服 = {
  {480,214,0xae9664},
  {526,188,0xe7dab2},
  {565,195,0xd9c99e},
  {583,200,0xcebb8e},
  {624,220,0xa18653},
  {662,193,0xdecea4},
  点击 = {567,538,0x271228},
}

战斗准备 = {
  {979,614,0xefd8a8},
  {1002,614,0xd6a86d},
  {1036,603,0xd9ac6f},
  {1104,619,0xe8cc97},
  {1094,571,0xaa200e},
  {823,613,0x2e2231},
  {761,614,0x312331},
  {390,609,0x392d3f},
  {305,603,0x322737},
  {278,600,0x392e3c},
  {252,600,0x372938},
  点击 = {1019,483,0xcb7a3e},
  更换式神 = {405,439,0x3e5c79},
  更换观战 = {362,227,0x63766f},
}


战斗准备640 = {
  {979,614,0xefd8a8},
  {1002,614,0xd6a86d},
  {1036,603,0xd9ac6f},
  {1104,619,0xe8cc97},
  {1094,571,0xaa200e},
  {823,613,0x2e2231},
  {761,614,0x312331},
  {390,609,0x392d3f},
  {305,603,0x322737},
  {278,600,0x392e3c},
  {252,600,0x372938},
  点击 = {991,477,0xab845c},
  更换式神 = {405,439,0x3e5c79},
  更换观战 = {362,227,0x63766f},
}

战斗准备750 = {
  {1137,722,0xeacf9c},
  {1237,709,0xe6c790},
  --{1291,717,0xe7c993},
  {1229,673,0x413a34},
  {1256,647,0xebc87f},
  点击 = {1214,586,0xe8ceb8},
  更换式神 = {405,439,0x3e5c79},
  更换观战 = {362,227,0x63766f},
}

战斗准备720 = {
  {1101,693,0xeed5a5},
  {1167,673,0xe4c085},
  {1211,680,0xe3be82},
  {1246,690,0xeacf9d},
  {1182,647,0x2a2822},
  点击 = {1167,564,0xb9773f},
  更换式神 = {405,439,0x3e5c79},
  更换观战 = {362,227,0x63766f},
}

战斗准备1080 = {
  {1648,1043,0xf2dcae},
  {1865,1041,0xebd09e},
  {1806,1026,0xe3c188},
  {1695,1040,0xd1a269},
  {1774,971,0x2b2a24},
  点击 = {1749,839,0xb27943},
  更换式神 = {405,439,0x3e5c79},
  更换观战 = {362,227,0x63766f},
}

战斗准备1242 = {
  {1937,1187,0xc79963},
  {2072,1177,0xdeb67a},
  {2032,1114,0x514138},
  {1988,1064,0xffffc5},
  {2123,1195,0xf1daac},
  点击 = {2012,970,0xf6ead9},
  更换式神 = {405,439,0x3e5c79},
  更换观战 = {362,227,0x63766f},
}

战斗准备1440 = {
  {2194,1384,0xebd2a0},
  {2478,1384,0xe8cb99},
  {2424,1356,0xe3be82},
  {2268,1386,0xcf9d64},
  {2366,1294,0x2c2b25},
  点击 = {2329,1109,0xbb9869},
  更换式神 = {405,439,0x3e5c79},
  更换观战 = {362,227,0x63766f},
}

战斗准备1 = {
  {733,618,0x342232},
  {1037,580,0xd4a76c},
  {1088,593,0xe3c9a6},
  {1033,577,0xe5c28c},
  {989,596,0xe6c496},
  {331,623,0x2f1d29},
  {305,603,0x322737},
  {278,600,0x392e3c},
  {252,600,0x372938},
}

跳过对话 = {
  {762,479,0x56aef3},
  {762,474,0x4945e0},
  {762,487,0x3a33dc},
  {754,487,0x4a3add},
  点击 = {762,479,0x56aef3},
}

快进 = {
  {986,73,0x7a59ec},
  {1002,95,0x5959e1},
  {1011,67,0x4f47c7},
  {980,77,0x6443de},
  点击 = {1014,79,0x456485},
}


新快进1 = {
  {909,79,0xddb993},
  {923,81,0xcfa680},
  {1000,83,0xc79c76},
  {1020,83,0xd1aa83},
  {1012,59,0x322430},
  点击 = {1012,86,0x6e5239},
}

新快进 = {
  {1036,54,0xc59c78},
  {1043,50,0xd0a77e},
  {1025,63,0x352847},
  {1028,81,0x9a7960},
  {1027,19,0xc2a077},
  点击 = {1028,50,0xd1b498},
}


提示框 = {--这个是被邀请时候的那个
  {426,384,0xdd6951},
  {509,387,0xdd6951},
  {626,381,0xf4b25f},
  {707,380,0xf4b25f},
  取消 = {463,382,0xdd6951},
  确定 = {668,383,0xf4b25f},
}


觉醒选择界面 = {
  {162,192,0xbf787c},
  {490,208,0xe8f4e0},
  {913,262,0xe9e7e5},
  {1058,197,0x13c3f9},
  点击 = {1108,312,0xffe3b9},
  关闭 = {1077,99,0xe8d4cf},
}

觉醒选择界面1 = {
  {161,269,0xe6e4e5},
  {485,290,0xe9e7e5},
  {916,272,0xeae5e3},
  {927,324,0x3a3a42},
  点击 = {23,317,0xffe4be},
}

觉醒挑战界面 = {
  {532,437,0xf3b25e},
  {617,436,0xf3b25e},
  {798,443,0xf3b25e},
  {888,438,0xf3b25e},
  {290,446,0xc4ae93},
  {353,404,0xc7af95},
  组队 = {572,443,0xf3b25e},
  挑战 = {845,443,0xf3b25e},
  拖到前4层 = {360,134,358,339},
  拖到后4层 = {358,339,360,134},
  拖动 = {366,236,361,124},
  拖动1 = {361,124,366,236},
  关闭 = {928,106,0xe9d4cf},
}

觉醒选择第几层 = {
  {356,139,0xc0b7ac},
  {356,206,0x9c948b},
  {356,270,0xc1b8ad},
  {357,339,0x757069},
}

组队界面有左边 = {
  {79,226,0xead39c},
  --{79,221,0xf6e7b9},
  {76,204,0x8d7245},
  {61,121,0xe5cb70},
  {1056,198,0x8d7245},
  --{1065,242,0x821d20},
  {344,199,0x785843},
  {344,282,0x765742},
}

组队界面有左边1 = {
  {721,531,0xf4b25f},
  {797,537,0xf4b25f},
  {1010,532,0xf4b25f},
  {301,161,0x3b3836},
  {310,446,0x3b3836},
}

组队界面 = {
  {79,226,0xead39c},
  --{79,221,0xf6e7b9},
  {76,204,0x8d7245},
  {61,121,0xe5cb70},
  {1056,198,0x8d7245},
  --{1065,242,0x821d20},
  {345,196,0xc7bdb4},
  {347,346,0xc7bdb4},
  刷新 = {480,562,0xf3b25e},
  刷新国服 = {480,562,0xf3b25e},
  刷新日服 = {438,562,0xf3b25e},
  创建 = {929,558,0xf3b25e},
  加入 = {968,196,0x6a3b21},
  加入日服 = {973,186,0x68391f},
  拖动 = {226,526,222,167},
  妖力封印 = {226,516,0xb9ab9a},
  石距 = {221,403,0xe8d6c1},
  点一下 = {553,564,0xc7bdb4},
  关闭 = {1059,118,0xe8d4cf},
  年兽 = {220,346,0xffcb7b},
  结界突破 = {226,538,0xe8d6c1},
  经验妖怪 = {217,217,0xe8d6c1},
  金币妖怪 = {221,274,0xe8d6c1},
  组队转圈判定点 = {684,332,0xffffff},
  在排队判定 = {674,502,0xc7bdb4},
  排队按钮 = {680,559,0xf3b25e},
}


组队界面640 = {
  {79,226,0xead39c},
  --{79,221,0xf6e7b9},
  {76,204,0x8d7245},
  {61,121,0xe5cb70},
  {1056,198,0x8d7245},
  --{1065,242,0x821d20},
  {345,196,0xc7bdb4},
  {347,346,0xc7bdb4},
  刷新 = {480,562,0xf3b25e},
  创建 = {929,558,0xf3b25e},
  加入 = {968,196,0x6a3b21},
  拖动 = {226,516,222,177},
  妖力封印 = {226,516,0xb9ab9a},
  石距 = {221,403,0xe8d6c1},
  点一下 = {653,542,0xc7bdb4},
  关闭 = {1059,118,0xe8d4cf},
  年兽 = {220,346,0xffcb7b},
  经验妖怪 = {217,217,0xe8d6c1},
  金币妖怪 = {221,274,0xe8d6c1},
  组队转圈判定点 = {684,332,0xffffff},
  结界突破 = {226,538,0xe8d6c1},
  在排队判定 = {674,502,0xc7bdb4},
  排队按钮 = {680,559,0xf3b25e},
}
组队界面750 = {
  {95,233,0x8d7245},
  {73,142,0xe5cb70},
  {94,267,0xe7ce98},
  {85,286,0x751a1c},
  {1238,227,0x8d7245},
  {1239,263,0xf1deab},
  {407,301,0xc7bdb4},
  {405,371,0xc7bdb4},
  刷新 = {563,658,0xf3b25e},
  创建 = {1088,652,0xf3b25e},
  加入 = {1136,229,0x6a3b21},
  拖动 = {265,623,258,198},
  妖力封印 = {264,605,0xfdd881},
  石距 = {260,486,0xe8d6c1},
  点一下 = {765,633,0xc7bdb4},
  关闭= {1245,133,0xe8d7d1},
  年兽 = {257,406,0xffcb7b},
  经验妖怪 = {260,258,0xe8d6c1},
  金币妖怪 = {257,322,0xe8d6c1},
  组队转圈判定点 = {803,390,0xffffff},
  结界突破 = {259,633,0xe6d4bf},
}

组队界面720 = {
  {89,225,0x8c7342},
  {67,137,0xead988},
  {90,250,0xf6e6b1},
  {80,278,0x7b1818},
  {1190,219,0x8c7342},
  {1199,271,0x801f1f},
  {391,308,0xc6bdb5},
  {389,368,0xc6bdb5},
  刷新 = {540,632,0xf4b25f},
  创建 = {1040,625,0xf4b25f},
  加入 = {1090,220,0x6a3b21},
  拖动 = {248,593,246,170},
  妖力封印 = {254,582,0xb9ab9a},
  石距 = {248,463,0xe7d6be},
  点一下 = {734,625,0xc6bdb5},
  关闭 = {1190,132,0xead3d0},
  年兽 = {247,389,0xffcb7b},
  经验妖怪 = {250,238,0xe2d1ba},
  金币妖怪 = {249,311,0xe7d6be},
  组队转圈判定点 = {769,377,0xffffff},
  结界突破 = {248,607,0xdbcbb7},
}

组队界面1080 = {
  {130,332,0x8c7342},
  {137,387,0xfae1ac},
  {124,407,0x921e1e},
  {99,203,0xead982},
  {587,365,0xc6bdb5},
  {585,447,0xc6bdb5},
  {1787,329,0x8c7342},
  刷新 = {811,948,0xf4b25f},
  创建 = {1566,940,0xf4b25f},
  加入 = {1636,330,0x6a3b21},
  拖动 = {369,904,385,288},
  妖力封印 = {381,872,0xe7d6be},
  石距 = {369,684,0xe7d6be},
  点一下 = {1100,912,0xc6bdb5},
  关闭 = {1791,193,0xf0c6c6},
  年兽 = {371,584,0xffcb7b},
  经验妖怪 = {377,358,0x9c9080},
  金币妖怪 = {374,475,0xe7d6be},
  组队转圈判定点 = {1155,566,0xffffff},
  结界突破 = {373,908,0xe8d6c1},
}

组队界面1242 = {
  {154,371,0x8c7342},
  {117,232,0xead97f},
  {154,438,0xe0ce95},
  {137,469,0x711b1b},
  {676,350,0xc6bdb5},
  {676,448,0xc6bdb5},
  刷新 = {932,1090,0xf3b25e},
  创建 = {1752,1082,0xf4b25f},
  加入 = {1878,368,0x704626},
  拖动 = {431,1011,437,33},
  妖力封印 = {438,1002,0xe7d6be},
  石距 = {424,785,0xe7d6be},
  点一下 = {1247,1069,0xc6bdb5},
  关闭 = {2061,220,0xf2dad6},
  年兽 = {426,672,0xffcb7b},
  经验妖怪 = {476,415,0xe8d6c1},
  金币妖怪 = {469,544,0x675f56},
  组队转圈判定点 = {1330,651,0xffffff},
  结界突破 = {427,1043,0xe8d6c1},
}

组队界面1440 = {
  {179,440,0x8c7342},
  {180,498,0xf7e7b5},
  {137,271,0xe7d27a},
  {162,528,0x7f1c1c},
  {782,471,0xc6bdb5},
  {781,593,0xc6bdb5},
  刷新 = {1081,1264,0xf4b25f},
  创建 = {2060,1247,0xf4b25f},
  加入 = {2181,441,0x6a3b21},
  拖动 = {487,1192,491,364},
  妖力封印 = {492,1162,0xe5d4bc},
  石距 = {494,904,0xe7d6be},
  点一下 = {1469,1217,0xc6bdb5},
  关闭 =  {2350,261,0xe6d5cd},
  年兽 = {459,779,0xffcb7b},
  经验妖怪 = {499,484,0xe7d6be},
  金币妖怪 = {499,632,0xe7d6be},
  组队转圈判定点 = {1545,753,0xffffff},
  结界突破 = {497,1209,0xe8d6c1},
}

function 重写界面参数(设定值)
local w = 设定值 or 640*1136
if w == 640*1136 then
  组队界面= 组队界面640
  战斗中 = 战斗中640
  战斗胜利 = 战斗胜利640
  战斗失败 = 战斗失败640
  组队详情 = 组队详情640
  进入队伍 = 进入队伍640
  战斗准备 = 战斗准备640
  新战斗胜利 = 新战斗胜利640
  新战斗失败 = 新战斗失败640
elseif w == 750*1334 then
  组队界面= 组队界面750
  战斗中 = 战斗中750
  战斗胜利 = 战斗胜利750
  战斗失败 = 战斗失败750
  组队详情 = 组队详情750
  进入队伍 = 进入队伍750
  战斗准备 = 战斗准备750
  新战斗胜利 = 新战斗胜利750
  新战斗失败 = 新战斗失败750
elseif w == 720*1280 then
  组队界面= 组队界面720
  战斗中 = 战斗中720
  战斗胜利 = 战斗胜利720
  战斗失败 = 战斗失败720
  组队详情 = 组队详情720
  进入队伍 = 进入队伍720
  战斗准备 = 战斗准备720
  新战斗胜利 = 新战斗胜利720
  新战斗失败 = 新战斗失败720
elseif w == 1080*1920 then
  组队界面= 组队界面1080
  战斗中 = 战斗中1080
  战斗胜利 = 战斗胜利1080
  战斗失败 = 战斗失败1080
  组队详情 = 组队详情1080
  进入队伍 = 进入队伍1080
  战斗准备 = 战斗准备1080
  新战斗胜利 = 新战斗胜利1080
  新战斗失败 = 新战斗失败1080
elseif w == 1242*2208 then
  组队界面= 组队界面1242
  战斗中 = 战斗中1242
  战斗胜利 = 战斗胜利1242
  战斗失败 = 战斗失败1242
  组队详情 = 组队详情1242
  进入队伍 = 进入队伍1242
  战斗准备 = 战斗准备1242
  新战斗胜利 = 新战斗胜利1242
  新战斗失败 = 新战斗失败1242
elseif w == 1440*2560 then
  组队界面= 组队界面1440
  战斗中 = 战斗中1440
  战斗胜利 = 战斗胜利1440
  战斗失败 = 战斗失败1440
  组队详情 = 组队详情1440
  进入队伍 = 进入队伍1440
  战斗准备 = 战斗准备1440
  新战斗胜利 = 新战斗胜利1440
  新战斗失败 = 新战斗失败1440
end
end

组队详情= {
  {139,537,0xdf6851},
  {272,531,0xdf6851},
  {687,530,0xc7bdb4},
  {907,52,0x493625},
  {948,50,0x493625},
  离开队伍 = {267,531,0xdd6951},
  开始战斗 = {895,539,0xf3b25e},
  开组2人 = {622,440,0x31251a},
  开组3人 = {919,439,0x2b2015},
}

组队详情日服= {
  {199,531,0xdf6851},
  {325,535,0xdf6851},
  {724,542,0x0d0f0b},
  {443,109,0x9c8d7e},
  {765,120,0xc7bdb4},
  离开队伍 = {260,530,0xdf6851},
  开始战斗 = {868,533,0xf3b25e},
  开组2人 = {591,327,0xf6eee4},
  开组3人 = {891,329,0xf5ecdd},
}

组队详情640= {
  {139,537,0xdf6851},
  {272,531,0xdf6851},
  {687,530,0xc7bdb4},
  {907,52,0x493625},
  {948,50,0x493625},
  离开队伍 = {267,531,0xdd6951},
  开始战斗 = {895,539,0xf3b25e},
  开组2人 = {622,440,0x31251a},
  开组3人 = {919,439,0x2b2015},
}

组队详情750= {
  {243,628,0xdf6851},
  {383,627,0xdf6851},
  {863,626,0xfe9d3d},
  {851,636,0x0d0f0b},
  离开队伍 = {308,627,0xdf6851},
  开始战斗 = {1089,627,0xf3b25e},
  开组2人 = {467,263,0x777777},
  开组3人 = {779,260,0x777777},
}

组队详情720= {
  {230,599,0xdd6951},
  {376,598,0xdd6951},
  {826,599,0xe7572e},
  {815,609,0x0b0d0a},
  离开队伍 = {295,606,0xdd6951},
  开始战斗 = {1042,596,0xf4b25f},
  开组2人 = {467,263,0x777777},
  开组3人 = {779,260,0x777777},
}

组队详情1080= {
  {346,903,0xdd6951},
  {565,901,0xdd6951},
  {1242,895,0xfd7031},
  {1228,921,0x0c0e0a},
  离开队伍 = {446,900,0xd2654e},
  开始战斗 = {1570,911,0xf4b25f},
  开组2人 = {467,263,0x777777},
  开组3人 = {779,260,0x777777},
}

组队详情1242= {
  {396,1032,0xdd6951},
  {636,1038,0xdd6951},
  {1428,1034,0xff9935},
  {1417,1055,0x11140e},
  离开队伍 = {516,1042,0xdd6951},
  开始战斗 = {1804,1031,0xf4b25f},
  开组2人 = {467,263,0x777777},
  开组3人 = {779,260,0x777777},
}

组队详情1440= {
  {470,1197,0xdd6951},
  {753,1198,0xdd6951},
  {1656,1202,0xffa643},
  {1635,1224,0x0c0d0a},
  离开队伍 = {598,1207,0xdd6951},
  开始战斗 = {1955,1170,0xf3b25e},
  开组2人 = {467,263,0x777777},
  开组3人 = {779,260,0x777777},
}

创建队伍 = {
  {320,509,0xdd6951},
  {396,511,0xdd6951},
  {746,505,0xf4b25f},
  {819,505,0xf4b25f},
  创建 = {782,508,0xc8924e},
  取消 =  {355,510,0xdf6851},
  买体力 = {972,100,0xd6c4a1},
  所有人可见 = {278,459,0x402f11},
  拖动 = {732,378,729,233},
  拖动1 = {732,388,729,353},
  拖动ss = {732,350,735,308},
  寮可见 = {678,457,0x402f11},
}

邀请队友 = {
  {403,508,0xdd6951},
  {487,504,0xdd6951},
  {649,511,0xf4b25f},
  {727,512,0xf4b25f},
  取消 = {448,508,0xdd6951},
}

进入队伍 = {
  {943,191,0x7c4f2e},
  {942,291,0x67371f},
  {942,384,0x674125},
  {937,467,0xe6c767},
}

进入队伍640 = {
  {943,191,0x7c4f2e},
  {942,291,0x67371f},
  {942,384,0x674125},
  {937,467,0xe6c767},
}

进入队伍750 = {
  {1105,230,0xdabc66},
  {1106,340,0x6e4425},
  {1107,448,0x67361e},
  {1106,564,0x6b3b22},
}

进入队伍720 = {
  {1058,223,0x765915},
  {1056,322,0xe6c567},
  {1056,429,0xd5af4f},
  {1057,534,0xb9a9a0},
}

进入队伍1080 = {
  {1594,330,0x7b502e},
  {1594,483,0x724828},
  {1591,627,0x582b0f},
  {1591,771,0xb7aa9e},
}

进入队伍1242 = {
  {1825,381,0x401d09},
  {1824,557,0x3d1d0a},
  {1828,734,0x6b3b22},
  {1830,883,0xb7aa9e},
}

进入队伍1440 = {
  {2115,448,0x462411},
  {2115,645,0x3f1f09},
  {2120,841,0x5e3718},
  {2117,1022,0xb7aa9e},
}

战斗失败 = {
  {645,182,0x8f8474},
  {642,148,0xc0baac},
  {436,171,0x5a5164},
  {531,148,0x574936},
}

新战斗失败 = {
  {396,118,0x5e5569},
  {444,120,0x5e5468},
  {412,84,0x514a5b},
  {506,81,0x62523d},
  {495,50,0x95866e},
}

战斗失败640 = {
  {645,182,0x8f8474},
  {642,148,0xc0baac},
  {436,171,0x5a5164},
  {531,148,0x574936},
}

新战斗失败640 = {
  {396,118,0x5e5569},
  {444,120,0x5e5468},
  {412,84,0x514a5b},
  {506,81,0x62523d},
  {495,50,0x95866e},
}

战斗失败750 = {
  {879,188,0xd3cec1},
  {962,191,0xa49b8c},
  {764,177,0xc0baac},
  {642,274,0xbeb588},
  {537,205,0x61586d},
}

新战斗失败750 = {
  {468,137,0x5a5164},
  {525,138,0x60566b},
  {482,98,0x514a5b},
  {591,91,0x685640},
  {583,52,0x8d8169},
}

战斗失败720 = {
  {922,182,0xa89f90},
  {847,184,0xccc7b9},
  {728,169,0xbeb8aa},
  {609,259,0xb9a976},
  {516,198,0x61576c},
}

新战斗失败720 = {
  {447,134,0x5e5469},
  {496,130,0x595063},
  {464,86,0x4f4757},
  {588,72,0x725b44},
  {553,47,0x8b7f67},
}

战斗失败1080 = {
  {1385,274,0xa59c8d},
  {1091,306,0x938878},
  {928,398,0xc4bb90},
  {970,314,0x564838},
  {768,290,0x61586d},
}

新战斗失败1080 = {
  {666,195,0x5e5468},
  {693,136,0x50495a},
  {743,190,0x524b5c},
  {864,104,0x67543f},
  {852,67,0x90846c},
}

战斗失败1242 = {
  {1583,316,0xa79f90},
  {1459,318,0xcec9bc},
  {1258,297,0xbab2a4},
  {1056,455,0xbaab7a},
  {900,329,0x635a6f},
}

新战斗失败1242 = {
  {769,226,0x5f5468},
  {817,154,0x564e61},
  {864,234,0x5e5468},
  {1019,135,0x7a6147},
  {993,74,0x91846c},
}

战斗失败1440 = {
  {1842,371,0xa69d8d},
  {1700,359,0xd3cec1},
  {1457,408,0x948979},
  {1240,527,0xc4bb90},
  {1037,389,0x635a6f},
}

新战斗失败1440 = {
  {886,253,0x5b5265},
  {927,193,0x4f4859},
  {994,262,0x595063},
  {1155,145,0x675440},
  {1120,89,0x8e826a},
}

聊天界面 = {
  {31,613,0x805f49},
  {49,612,0x805f49},
  {113,601,0xe2c197},
  {379,601,0xdfba91},
  {440,598,0xf3b25e},
  关闭 = {557,54,0xe9d6d1},
  世界频道 = {33,178,0xf3b25e},
  频道号码 = {311,41,0xcbb59c},
  点击 = {96,519,0xc1bebd},
  阴阳寮= {56,313,0xffca7b},
}

聊天界面1 = {--这是系统频道
  {59,102,0xffcb7b},
  {38,226,0xe8d6c1},
  {56,316,0xe8d6c1},
  {52,606,0x83624c},
  {173,603,0xad957e},
}

被顶号了 = {
  {528,360,0xf4b25f},
  {607,361,0xf4b25f},
  {652,360,0xccb49b},
  {687,360,0xccb49b},
  {414,358,0xccb49b},
  {467,360,0xccb49b},
  {455,284,0xccb49b},
  {670,285,0xccb49b},
  点击 = {571,361,0xf4b25f},
}

登陆界面 = {
  {918,582,0x912e36},
  {966,420,0xbec7ea},
  --{593,512,0xffffe6},
  {99,565,0x181518},
  {103,363,0xb271a3},
  点击= {575,524,0xfffff7},
  用户中心 = {1075,109,0xffd2c6},
}

新登陆界面 = {
  {561,547,0xffd181},
  {627,499,0xffc04d},
  {562,502,0xffe57e},
  {984,576,0xc86877},
  {889,581,0x912f37},
}

登陆界面170520 = {
  {317,554,0x20162a},
  {614,558,0xfdf3e0},
  {898,218,0xbe9c75},
  {296,259,0x9d765d},
}

登陆界面170528 = {
  {166,557,0x1e1628},
  {846,473,0x331833},
  {887,130,0xc5a77e},
  {55,375,0x130514},
}

点击进入游戏 = {
  {346,569,0x151e58},
  {391,511,0x344c56},
  {926,358,0x4d87a8},
  {883,528,0x2b3c45},
  {221,302,0x698ece},
  点击= {649,537,0x443c4b},
  创建角色 = {568,590,0xf3b25e},
}
新点击进入游戏 = {
  {127,546,0x1e1d25},
  {210,543,0xe8c2db},
  {213,402,0xc5beea},
  {872,545,0x913037},
  {904,241,0xd8def6},
}

点击进入游戏170520 = {
  {1057,299,0x180816},
  {338,68,0x36212f},
  {72,518,0x100110},
  {635,602,0xaf95b5},
  {1037,602,0x66694c},
}

function 选择阴阳寮对手()
keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xa4937b,"36|1|0xa4937b,71|1|0xa4937b,109|3|0xa4937b,145|-2|0xa39279,-22|9|0xcac1b1,165|0|0xcac1b1,85|-16|0xcac1b1", 92,434,106, 1011,512)
keepScreen(false)
--sysLog("选择阴阳寮对手"..x..":"..y)
if x > -1 then
  sysLog("选择阴阳寮对手"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end
function 判断击破()
keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0x651725,"10|-2|0xd2c2b1,-21|-5|0x591420,-24|-21|0xcfbfac,16|-36|0xa93636",  92,434,106, 1011,582)
keepScreen(false)
sysLog("判断击破"..x..":"..y)
if x > -1 then
  sysLog("判断击破"..x..":"..y)
  --click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 找关闭按钮()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xeedad4,"-17|-2|0x74383a,0|13|0x713740,15|2|0x6b2943,1|-15|0x65333c,6|-5|0xe7d6ce",93, 0, 0, 1135, 550)
--keepScreen(false)
--sysLog("找关闭按钮"..x..":"..y)
if x > -1 then
  sysLog("找关闭按钮"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 个人攻击()
keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xf4b25f,"-46|0|0xf4b25f,51|-2|0xf4b25f,-193|1|0xccb49b,-138|25|0xccb49b,-89|6|0xccb49b,71|-3|0xccb49b,15|-34|0xccb49b", 95, 0, 50, 1135, 600)
if x > -1 then
  sysLog("个人攻击"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  keepScreen(false)
  return true
end
x, y = findMultiColorInRegionFuzzy(0xf3b25e,"-47|0|0xf3b25e,54|0|0xf3b15e,-188|0|0xb0a9a1,-89|-1|0xb0a9a1,-68|-1|0xcbb59c",  95, 0, 50, 1135, 600)
if x > -1 then
  sysLog("个人攻击"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  keepScreen(false)
  return true
end
return false
end

function 阴阳寮攻击()
keepScreen(true)
if 组队突破 == 0 or 组队突破 == 1 then
  x, y = findMultiColorInRegionFuzzy(0xf4b25f,"-37|2|0xf4b25f,44|3|0xf4b25f,-174|-2|0xf4b25f,-93|0|0xf4b25f", 95, 434,106,1011,582)
  if x > -1 then
    keepScreen(false)
    sysLog("1阴阳寮攻击"..x..":"..y)
    if 组队突破 == 1 then
      阴阳寮第几个 = 阴阳寮第几个 - 1
    end
    click(x,y)
    mSleep(1000)
    click(x,y)
    mSleep(5000)
    return true
  end
  x, y = findMultiColorInRegionFuzzy(0xf3b25e,"-45|2|0xf3b25e,49|-1|0xf3b25e,-64|2|0xcbb59c,-100|-1|0xb0a9a1,-180|0|0xb0a9a1,71|-6|0xcbb59c", 95, 434,106,1011,582)
  if x > -1 then
    keepScreen(false)
    if 组队突破 == 1 then
      阴阳寮第几个 = 阴阳寮第几个 - 1
    end
    sysLog("2阴阳寮攻击"..x..":"..y)
    click(x,y)
    mSleep(1000)
    click(x,y)
    mSleep(5000)
    return true
  end
end
--后面两个是点组队
if 组队突破 == 1 or 组队突破 == 2 then
  x, y = findMultiColorInRegionFuzzy(0xf3b25e,"-74|-1|0xf3b25e,44|-5|0xcbb59c,-95|4|0xcbb59c,70|2|0xf3b25e,161|3|0xf3b25e,191|11|0xcbb59c", 95, 434,106,1011,582)
  if x > -1 then
    keepScreen(false)
    sysLog("3阴阳寮攻击"..x..":"..y)
    首次进入组队详情 = true
    是否在阴阳寮组队 = true
    click(random_click(x,y))
    mSleep(5000)
    return true
  end
  x, y = findMultiColorInRegionFuzzy(0xf3b25e,"-79|-2|0xf3b25e,21|-2|0xf3b25e,62|-2|0xb0a9a1,157|-3|0xb0a9a1,39|-1|0xcbb59c,187|0|0xcbb59c,-105|5|0xcbb59c", 95, 434,106,1011,582)
  if x > -1 then
    keepScreen(false)
    sysLog("4阴阳寮攻击"..x..":"..y)
    首次进入组队详情 = true
    是否在阴阳寮组队 = true
    click(random_click(x,y))
    mSleep(5000)
    return true
  end
end
keepScreen(false)
return false
end

function 地图找宝箱()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xb33619,"-22|-7|0xb02a19,20|1|0x4d0405,-8|-17|0x5a2c2a,9|24|0xda9512,-26|18|0xd68f15,-15|7|0xe4a91e", 92, 100, 50, 1000, 550)
--keepScreen(false)
if x > -1 then
  sysLog("地图找宝箱"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 找小怪()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xbfc1eb,"-6|0|0xd8dafa,5|11|0x353d6e,-18|-3|0x3e487b,-7|-13|0x442618",90, 100, 80, 1072,490)
--keepScreen(false)
if x > -1 then
  sysLog("找小怪"..x..":"..y)
  click(x,y)
  mSleep(500)
  return true
end
return false
end

function 找boss()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xfce8d3,"-7|7|0xfffffc,-12|20|0xedadb4,4|16|0x99632a,-18|3|0xeaa8af,-9|-6|0x462b52,-18|-16|0x221208",88, 0,80, 1135, 550)
--keepScreen(false)
if x > -1 then
  showHD_b("找到boss了:"..x.."："..y)
  sysLog("找boss"..x..":"..y)
  click(x,y)
  mSleep(500)
  return true
end
return false
end

经验怪 = {
  {c=0xe0cfa4,str = "-4|0|0xd9c69d,4|-2|0xddcda2,20|-2|0x8d1b1a,19|26|0xf7dd23"},
  {c=0xe0cfa5,str = "-7|0|0xcebb93,5|-2|0xd6c59b,19|1|0x951d1d,19|28|0xf5dd23"},
  {c=0xdfd1ac,str = "-46|1|0x326b74,-34|27|0x8c221f,65|53|0xfa9a16,-27|55|0xa76c50"},
  {c=0xe0cfa6,str = "-7|0|0xceba93,5|0|0xe5cea4,20|0|0x901d1c,19|29|0xf7df24"},
  {c=0xe1c999,str = "20|0|0x8d1e1b,19|23|0xfbe81a,-11|10|0x931918,-12|1|0x346970"},
  {c=0xe0cfa5,str = "-7|0|0xd4c49a,3|0|0xe3cfa5,18|0|0x901d1b,17|28|0xf7de23"},
  {c=0xe0cea4,str = "-5|1|0xd9c99f,3|0|0xd8c39a,14|0|0x8e1a1b,13|23|0xf6dc22"},
  {c=0xd8c8a6,str = "19|-2|0x9a2524,19|23|0xfbe717,-11|7|0x841814,20|-9|0x296c7d"},
  {c=0xdecdaa,str = "-5|0|0xd7c692,2|0|0xdccba8,12|0|0x8b2020,11|19|0xecd228"},
  {c=0xdac295,str = "-29|2|0x306875,-22|23|0x8c201c,36|62|0xf9ed1c,16|3|0xe2d1aa,-16|50|0x986949"},
  {c=0xe1d0a8,str = "-7|2|0xd1c298,20|3|0x911f20,20|32|0xf2dd24,-1|2|0xdfcfa6"},
  {c=0xdfcfa6,str = "-4|1|0xdccba4,-16|10|0x962525,15|2|0x971d1e,15|24|0xf5dd24"},
  {c=0xdfcfa6,str = "-7|0|0xcdb893,20|-2|0x961d1e,-17|11|0x8d1e1f,19|29|0xf6de23"},
  {c=0xdfcfa6,str = "-11|0|0xc4ac8b,34|3|0x9b2122,-26|17|0x942323,33|48|0xf8e023"},
  {c=0xdfcfa6,str = "-12|0|0xc8af8f,24|-1|0x911b1b,-24|12|0x8e1d1e,22|36|0xf5dc20"},
  {c=0xddd2aa,str = "20|-1|0x8b1c19,22|-11|0x21556c,19|28|0xf8e418,-6|1|0xccba98,8|-3|0xbda47a"},
  {c=0xe8d7ae,str = "12|-2|0xad9473,21|-1|0x8e1b1c,23|-10|0x215c73,20|31|0xf9e41d"},
  {c=0xeee1ba,str = "13|-4|0xa78d6b,24|-1|0x891a1f,21|-11|0x2d7481,20|27|0xfae817"},
  {c=0xefe0b6,str = "13|-5|0xb29a75,25|-2|0x921e1e,27|-16|0x1f5a71,24|34|0xfbe81b"},
  {c=0xe1d0a4,str = "-21|4|0xb79d7c,58|3|0x8b1a16,62|-26|0x225a73,57|77|0xf6da21,57|52|0xf0911d"},
  {c=0xe5d0a3,str = "-14|-1|0xd8c298,31|31|0xf18f16,30|3|0x87191a,30|-16|0x1f5873,-35|19|0x921a1a"},	
  {c=0xcbb895,str = "55|38|0xef9017,52|1|0x96181f,-23|-2|0x295d74,-23|23|0x941a19"},
}
function 找经验怪()
local 开始时间 = mTime()
--keepScreen(true)
--sysLog("找经验怪")
sysLog('开始时间:' .. 开始时间)
local st_count = 1
local step = 1
if w ==1242 or h == 1242 or w == 1920 or h == 1920 or w == 2560 or h == 2560 then
  st_count = math.random(1,2)
  step = 2
end
for i=st_count,#经验怪 , step do
  x, y = findMultiColorInRegionFuzzy(经验怪[i].c,经验怪[i].str,  92, 0, 50, 1135, 550)
  if x > -1 then
    sysLog(i.."找到经验怪"..x..":"..y)
    --showHUD(id,"找到经验怪"..x..":"..y,20,"0xff130c09","0xffffffff",0,0,0,200,50)
    --mSleep(3000)
    --click(x,y)
    point = findMultiColorInRegionFuzzyExt(0xbfc1eb,"-6|0|0xd8dafa,5|11|0x353d6e,-18|-3|0x3e487b,-7|-13|0x442618",90, x-120, y-350, x+120, y-50)
    --mSleep(500)
    --keepScreen(false)
    if #point ~= 0 then	
      local temp_table = {}
      for var = 1,#point do
        if var == 1 then
          table.insert(temp_table,point[var])
        else
          if math.abs((point[var].x-point[var-1].x)) > 50 then
            table.insert(temp_table,point[var])
          end
        end
      end
      --print(temp_table)
      if #temp_table ~= 0 then
        --print(temp_table)
        if #temp_table == 1 then
          sysLog("找到攻击"..temp_table[1].x..":"..temp_table[1].y)
          showHD_b("找到经验怪了:"..temp_table[1].x..":"..temp_table[1].y)
          --showHUD(id,"找到攻击"..temp_table[1].x..":"..temp_table[1].y,20,"0xff130c09","0xffffffff",0,50,50,200,50)
          click(temp_table[1].x,temp_table[1].y)
          --mSleep(3000)
          return true
        else
          local final_x = temp_table[1].x
          local final_y = temp_table[1].y
          for t = 2,#temp_table do
            if math.abs((temp_table[t].x - x))+math.abs((temp_table[t].y - y)) < math.abs((final_x - x))+math.abs((final_y - y)) then
              final_x = temp_table[t].x
              final_y = temp_table[t].y
            end
          end
          sysLog("找到攻击"..final_x..":"..final_y)
          showHD_b("找到经验怪了:"..final_x..":"..final_y)
          --showHUD(id,"找到攻击"..final_x..":"..final_y,20,"0xff130c09","0xffffffff",0,50,50,200,50)
          click(final_x,final_y)
          --mSleep(3000)
          return true
        end
      end
    end
    
    --if x > -1 then
    --  sysLog("找到攻击")
    --  click(random_click(x,y))
    --  return true
    --end
  end
end
sysLog("没有")
sysLog('结束时间:' .. mTime() - 开始时间)
showHD_b("没有找到，用时".. mTime() - 开始时间.."毫秒")
return false
end


金币怪 = {
  {c=0xc3b661 ,str = "2|0|0xa69546,-11|12|0xe2d278,-5|24|0xebdda8,-5|17|0xd8c470 "},
  {c=0xe3d37f ,str = "-5|0|0xd6c070,-4|14|0xd1c076,0|12|0xd6bc7a,0|14|0x694714   "},
  {c=0xe6cf7d ,str = "2|0|0xdaba74,4|3|0xc6a754,4|8|0xfdfec4,5|10|0xf0f1bd       "},
  {c=0x613f05 ,str = "4|0|0x5d421e,8|0|0xe0af21,11|0|0x2b0c05,2|4|0x462e17       "},
  {c=0xa18947 ,str = "11|0|0x7d5c26,19|0|0xb0904c,2|8|0x7e6525,1|17|0x664d20     "},
  {c=0xe6da86 ,str = "3|0|0xae9e49,4|0|0xb4a452,1|6|0xdac870,6|6|0xe2d389        "},
  {c=0xb4a452 ,str = "5|1|0xe7c992,1|3|0xe7de8c,8|3|0xdec57a,3|0|0xb09e55        "},
  {c=0x633b13 ,str = "2|0|0xa05d15,3|0|0x60401d,1|0|0xb9671a,6|0|0xd6be69        "},
  {c=0xd4c36e ,str = "-3|1|0xc9b063,-3|5|0xfef3bf,0|5|0x784724,0|1|0xd6c575      "},
  {c=0xf6db92 ,str = "4|0|0xcfae5c,4|-1|0xc6ad5a,1|2|0x8e6e34,-2|3|0xead193      "},
  {c=0xe7d586 ,str = "3|0|0xe5dd8c,0|1|0xa99946,7|2|0xd7ba7f,10|1|0xdebe84       "},
  {c=0x462604 ,str = "2|0|0xd19e4a,3|0|0xbf8c37,-1|4|0xbd9a46,0|4|0xbe9d49       "},
  {c=0xa48646 ,str = "5|0|0xe1cb7e,1|6|0xdaca6f,8|6|0xac8c43,6|10|0xcfbe79       "},
  {c=0xb49e5b ,str = "5|0|0x9a793a,2|0|0xebdb97,8|0|0xd7c774,11|0|0xe2ca78       "},
  {c=0xd9c873 ,str = "2|0|0xdecd79,-3|6|0xede4af,1|6|0xcbab57,3|7|0xe4d792       "},
  {c=0xd4c263 ,str = "2|0|0x947433,-2|3|0xcbaf5c,0|3|0xc7b26b,1|3|0xb59c5b       "},
}
function 找金币怪()
--keepScreen(true)
local 开始时间 = mTime()
local st_count = 1
local step = 1
if w ==1242 or h == 1242 or w == 1920 or h == 1920 or w == 2560 or h == 2560 then
  st_count = math.random(1,2)
  step = 2
end
for i=st_count,#金币怪 , step do
  x, y = findMultiColorInRegionFuzzy(金币怪[i].c,金币怪[i].str,  92, 0, 50, 1135, 550)
  if x > -1 then
    sysLog("找到金币怪"..x..":"..y)
    --click(x,y)
    point = findMultiColorInRegionFuzzyExt(0xbfc1eb,"-6|0|0xd8dafa,5|11|0x353d6e,-18|-3|0x3e487b,-7|-13|0x442618",90, x-120, y-350, x+120, y-50)
    --mSleep(500)
    --keepScreen(false)
    if #point ~= 0 then	
      local temp_table = {}
      for var = 1,#point do
        if var == 1 then
          table.insert(temp_table,point[var])
        else
          if math.abs((point[var].x-point[var-1].x)) > 50 then
            table.insert(temp_table,point[var])
          end
        end
      end
      if #temp_table ~= 0 then
        --print(temp_table)
        if #temp_table == 1 then
          sysLog("找到攻击"..temp_table[1].x..":"..temp_table[1].y)
          showHD_b("找到金币怪了:"..temp_table[1].x..":"..temp_table[1].y)
          click(temp_table[1].x,temp_table[1].y)
          return true
        else
          local final_x = temp_table[1].x
          local final_y = temp_table[1].y
          for t = 2,#temp_table do
            if math.abs((temp_table[t].x - x))+math.abs((temp_table[t].y - y)) < math.abs((final_x - x))+math.abs((final_y - y)) then
              final_x = temp_table[t].x
              final_y = temp_table[t].y
            end
          end
          sysLog("找到攻击"..final_x..":"..final_y)
          showHD_b("找到金币怪了:"..final_x..":"..final_y)
          click(final_x,final_y)
          return true
        end
      end
    end
  end
end
--sysLog("没有")
showHD_b("没有找到，用时".. mTime() - 开始时间.."毫秒")
return false
end

御魂怪 = {
  {c=0xcf3d1f,str = "6|-27|0xf8f7e9,13|-54|0xd96530,45|15|0xecd014,-10|4|0xd32f23"},
  {c=0xd03a23,str = "12|-24|0xf8f3e5,15|8|0xf3b602,46|14|0xdec411,-5|3|0xd32f25"},
  {c=0xd62d24,str = "12|10|0xfcee21,39|5|0xfccf04,8|-20|0xf3ecde,-3|-2|0xce3626"},
  {c=0xd62d23,str = "-8|-3|0xd13d2c,16|9|0xf8ec25,26|8|0xf8e11a,4|-18|0xf3eee0"},
  {c=0xd62d22,str = "-7|-3|0xce3f2a,10|5|0xf3bf02,28|8|0xfce714,6|-21|0xfaf9eb"},
  {c=0xd52e23,str = "-7|0|0xd43a29,11|10|0xfde112,30|11|0xfce71a,10|-19|0xf7f4e5"},
  {c=0xd23421,str = "-13|1|0xde2d28,12|11|0xfcd109,39|14|0xf4dc17,8|-25|0xf6f6e5"},
  {c=0xd62e23,str = "-7|-1|0xd52f26,7|7|0xfedb08,26|8|0xfae515,6|-21|0xf8f3e5"},
  {c=0xd73227,str = "17|7|0xfcf425,25|6|0xfae319,7|-17|0xf5f3e3,-3|-3|0xcf3a28"},
  {c=0xd72a22,str = "-6|0|0xd43627,8|7|0xf3d510,22|7|0xfbe613,5|-15|0xf7f6e7"},
  {c=0xd72f26,str = "-9|0|0xd33426,5|7|0xf3d510,19|7|0xfbe613,2|-15|0xf7f6e8"},
  {c=0xd52e22,str = "-9|-2|0xce3225,12|7|0xf6c802,37|11|0xfae319,6|-28|0xf3eede"},
  {c=0xd13821,str = "-11|1|0xd13626,10|12|0xfddb0b,33|14|0xfbe619,8|-23|0xf8f4e7"},
  {c=0xcb481c,str = "-13|0|0xcb3f29,9|14|0xf3ce08,33|16|0xfbe616,5|-22|0xf4f3e4"},
  {c=0xd62f27,str = "-9|-2|0xd62c21,12|9|0xfbea1a,38|9|0xf8e01c,7|-31|0xf5f3e2"},
}
function 找御魂怪()
--keepScreen(true)
local 开始时间 = mTime()
local st_count = 1
local step = 1
if w ==1242 or h == 1242 or w == 1920 or h == 1920 or w == 2560 or h == 2560 then
  st_count = math.random(1,2)
  step = 2
end
for i=st_count,#御魂怪 , step do
  x, y = findMultiColorInRegionFuzzy(御魂怪[i].c,御魂怪[i].str,  92, 0, 50, 1135, 550)
  if x > -1 then
    sysLog("找到御魂怪"..x..":"..y)
    --click(x,y)
    point = findMultiColorInRegionFuzzyExt(0xbfc1eb,"-6|0|0xd8dafa,5|11|0x353d6e,-18|-3|0x3e487b,-7|-13|0x442618",90, x-120, y-350, x+120, y-50)
    --mSleep(500)
    -- keepScreen(false)
    if #point ~= 0 then	
      local temp_table = {}
      for var = 1,#point do
        if var == 1 then
          table.insert(temp_table,point[var])
        else
          if math.abs((point[var].x-point[var-1].x)) > 50 then
            table.insert(temp_table,point[var])
          end
        end
      end
      if #temp_table ~= 0 then
        --print(temp_table)
        if #temp_table == 1 then
          sysLog("找到攻击"..temp_table[1].x..":"..temp_table[1].y)
          showHD_b("找到御魂怪了:"..temp_table[1].x..":"..temp_table[1].y)
          click(temp_table[1].x,temp_table[1].y)
          return true
        else
          local final_x = temp_table[1].x
          local final_y = temp_table[1].y
          for t = 2,#temp_table do
            if math.abs((temp_table[t].x - x))+math.abs((temp_table[t].y - y)) < math.abs((final_x - x))+math.abs((final_y - y)) then
              final_x = temp_table[t].x
              final_y = temp_table[t].y
            end
          end
          sysLog("找到攻击"..final_x..":"..final_y)
          showHD_b("找到御魂怪了:"..final_x..":"..final_y)
          click(final_x,final_y)
          return true
        end
      end
    end
  end
end
--sysLog("没有")
showHD_b("没有找到，用时".. mTime() - 开始时间.."毫秒")
return false
end

function 计算怪物数量(m_type)--1经验2金币3御魂
local point = {}
--keepScreen(true)
if m_type == 1 then
  sysLog("找经验怪")
  for i=1,#经验怪 do
    t_table = findMultiColorInRegionFuzzyExt(经验怪[i].c,经验怪[i].str,  92, 0, 50, 1135, 550)
    if #t_table ~= 0 then
      for var=1,#t_table do
        table.insert(point,t_table[var])
      end
    end
  end
elseif m_type == 2 then
  for i=1,#金币怪 do
    t_table = findMultiColorInRegionFuzzyExt(金币怪[i].c,金币怪[i].str,  92, 0, 50, 1135, 550)
    if #t_table ~= 0 then
      for var=1,#t_table do
        table.insert(point,t_table[var])
      end
    end
  end
elseif m_type == 3 then
  for i=1,#御魂怪 do
    t_table = findMultiColorInRegionFuzzyExt(御魂怪[i].c,御魂怪[i].str,  92, 0, 50, 1135, 550)
    if #t_table ~= 0 then
      for var=1,#t_table do
        table.insert(point,t_table[var])
      end
    end
  end
end
--keepScreen(false)
table.sort(point, function(a,b) return a.x<b.x end )
--print(point)
if #point ~= 0 then	
  local temp_table = {}
  for var = 1,#point do
    if var == 1 then
      table.insert(temp_table,point[var])
    else
      if math.abs((point[var].x-point[var-1].x)) > 50 then
        table.insert(temp_table,point[var])
      end
    end
  end
  sysLog("目标怪物数量"..#temp_table)
  return #temp_table
end
return 0
end

function 副本结束领奖()
--keepScreen(true)
local x=-1
local y=-1
if false then
  resetScreenScale()
  keepScreen(false)
  x, y = findMultiColorInRegionFuzzy(0xa54922,"15|-8|0xf7ffd7,15|8|0xffe9d7,-12|9|0xfdf4e3,3|-17|0xa24313", 88, 0, 50, 1333, 740)
  --sysLog("w副本结束领奖"..x..":"..y)
  if x > -1 then
    sysLog("w副本结束领奖"..x..":"..y)
    click(random_click(x,y))
    mSleep(500)
    setScreenScale(640,1136)
    return true
  end
  setScreenScale(640,1136)
  return false
elseif false then
  resetScreenScale()
  keepScreen(false)
  x, y = findMultiColorInRegionFuzzy(0xb1441e,"16|-29|0xa03d1f,22|-10|0xfff4d4,-14|-9|0xfff4d4,23|17|0xfff4d4", 88, 0, 50, 2207, 1200)
  sysLog("w副本结束领奖"..x..":"..y)
  if x > -1 then
    click(random_click(x,y))
    mSleep(500)
    setScreenScale(640,1136)
    return true
  end
  setScreenScale(640,1136)
  return false
else
  x, y = findMultiColorInRegionFuzzy(0xfff4d3,"22|2|0xfff4d3,22|12|0xfff4d3,-1|14|0xfff5d4,21|-10|0x672c14", 88, 192,140, 978,535)
  --keepScreen(false)
  --sysLog("副本结束领奖"..x..":"..y)
  if x > -1 then
    click(random_click(x,y))
    mSleep(500)
    return true
  end
  x, y = findMultiColorInRegionFuzzy(0xb0431d,"11|9|0xfff4d4,15|-7|0xfff4d4,-7|-6|0xfff4d4,-8|7|0xfff4d4", 95,192,140, 978,535)
  if x > -1 then
    click(random_click(x,y))
    mSleep(500)
    return true
  end
  return false
end
end

function 找剧情对话()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xffebeb,"19|0|0xfde8e8,33|2|0xfde8e8,23|-20|0x12100c,6|-22|0x12100c,6|14|0x18110d,30|19|0x12100c", 92, 0, 50, 1135, 550)
--keepScreen(false)
if x > -1 then
  sysLog("找剧情对话"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 大眼睛()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xdee4e9,"23|-1|0xf0f3f5,12|17|0xfbfbfc,17|-21|0xfcfcfd,-43|6|0xe0b60c,57|26|0xe2be04,28|23|0x443741,-6|-32|0x332a28", 92, 200, 100, 1135, 550)
--keepScreen(false)
if x > -1 then
  sysLog("大眼睛"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 问号()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xffefdd,"-7|5|0xffefdd,10|6|0xffefdd,10|25|0x261e0a,-11|25|0x16120b,-1|36|0xffefdd", 92, 0, 50, 1135, 550)
--keepScreen(false)
if x > -1 then
  sysLog("问号"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 庭院找町中()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xb3ac9a,"-15|-9|0xbcb2a2,-7|-27|0xb9b6c1,-6|37|0x989494,-23|-36|0xb2aaa1,0|-40|0xb5adad", 90, 487,97,781,431)
--keepScreen(false)
if x > -1 then
  sysLog("庭院找町中"..x..":"..y)
  click(x,y)
  mSleep(500)
  return true
end
return false
end

function 判断选哪个队伍(y)
if w == 640 then
  if y < 230 then
    click(random_click(进入队伍[1][1],进入队伍[1][2]))
  elseif y < 320 then
    click(random_click(进入队伍[2][1],进入队伍[2][2]))
  elseif y < 420 then
    click(random_click(进入队伍[3][1],进入队伍[3][2]))
  else
    click(进入队伍[4][1],进入队伍[4][2])
  end
elseif w == 750 then
  if y < 278 then
    click(random_click(进入队伍[1][1],进入队伍[1][2]))
  elseif y < 380 then
    click(random_click(进入队伍[2][1],进入队伍[2][2]))
  elseif y < 486 then
    click(random_click(进入队伍[3][1],进入队伍[3][2]))
  else
    click(进入队伍[4][1],进入队伍[4][2])
  end
elseif w == 720 then
  if y < 267 then
    click(random_click(进入队伍[1][1],进入队伍[1][2]))
  elseif y < 363 then
    click(random_click(进入队伍[2][1],进入队伍[2][2]))
  elseif y < 463 then
    click(random_click(进入队伍[3][1],进入队伍[3][2]))
  else
    click(进入队伍[4][1],进入队伍[4][2])
  end
elseif w == 1080 then
  if y < 400 then
    click(random_click(进入队伍[1][1],进入队伍[1][2]))
  elseif y < 545 then
    click(random_click(进入队伍[2][1],进入队伍[2][2]))
  elseif y < 695 then
    click(random_click(进入队伍[3][1],进入队伍[3][2]))
  else
    click(进入队伍[4][1],进入队伍[4][2])
  end
elseif w == 1242 then
  if y < 450 then
    click(random_click(进入队伍[1][1],进入队伍[1][2]))
  elseif y < 623 then
    click(random_click(进入队伍[2][1],进入队伍[2][2]))
  elseif y < 804 then
    click(random_click(进入队伍[3][1],进入队伍[3][2]))
  else
    click(进入队伍[4][1],进入队伍[4][2])
  end
elseif w == 1440 then
  if y < 530 then
    click(random_click(进入队伍[1][1],进入队伍[1][2]))
  elseif y < 770 then
    click(random_click(进入队伍[2][1],进入队伍[2][2]))
  elseif y < 1000 then
    click(random_click(进入队伍[3][1],进入队伍[3][2]))
  else
    click(进入队伍[4][1],进入队伍[4][2])
  end
end
end

识别参数640 = {
  {c=0x46433d,str = "0|12|0x3a3732,15|11|0x302d29,12|8|0x434039,38|0|0x524f48,38|13|0x43403a,49|4|0xdecdb4,-11|8|0xdbc094,55|4|0xdecdb4"},--椒图
  {c=0x3b3833,str ="11|11|0x2a2723,-5|10|0x33302b,-15|4|0xdcc195,19|0|0x37342f,33|11|0x36322d,32|1|0x292622,49|2|0x2d2a26,56|-4|0x302d28,73|1|0xdecdb4"},--鬼使黑
  {c=0x393630,str = "4|4|0x413d37,-1|11|0x646058,-1|16|0x282521,-20|6|0xdcc097,43|10|0xdecdb4,20|11|0x272420,19|1|0x2b2824,24|5|0x2f2c28"},--骨女
  {c=0x3f3c35,str = "-4|6|0xdfcdb3,-8|11|0x3a3832,-18|6|0xdab57c,28|3|0x272420,27|9|0x3e3b35,46|10|0x272420,54|4|0x3b3833,46|-1|0x36322e,68|5|0xdfcdb3"},--二口女
  {c=0x272420,str = "2|-10|0x2c2925,-20|-9|0xdabe94,25|-1|0x272420,25|-16|0x423f39,44|-9|0x282521,53|-2|0x312e29,67|-7|0xdecdb4,15|-11|0x3e3a35"},--海坊主
  {c=0x3a362b,str="8|-6|0x31342b,-12|0|0xdcae72,23|3|0x383224,23|-9|0x322f28,32|-7|0x393529,56|-10|0x3d3528,60|-1|0x262717,74|-1|0xdecdb3,59|5|0x2b2310"},--鸟
  {c=0x2b2823,str="-8|0|0xdebd87,12|2|0x605d54,28|6|0x2d2a25,40|-5|0x2f2c27,52|2|0x292622,64|5|0x2d2a25,74|5|0x2a2723,82|-5|0x35322d,87|-3|0x272420"},--经验怪
  {c=0x656159,str="8|-7|0x2f2d28,-15|0|0xdbb67d,31|-1|0x2a2723,25|-10|0x2a2723,45|0|0x292622,57|2|0x2b2823,67|2|0x2a2723,75|-8|0x35322d,81|-5|0x282521"},--金币怪
  {c=0x2e2b26,str="15|7|0x2d2a25,21|5|0x2a2723,34|-8|0x36332e,57|-8|0x423e38,56|8|0x2b2823,80|8|0x2b2823,86|-3|0x302d29,-12|3|0xdbbf93"},--跳跳哥哥
  --{c=0x2e2b26,str="9|1|0x272420,-12|0|0xdbb67d,22|-1|0x3e3b35,27|6|0x2b2824,34|-3|0x292621,46|-4|0xdfcdb3,64|-2|0xdfcdb3,0|6|0x292622"},--石距
  {c=0x312d29,str="9|0|0x33302b,-11|-1|0xddc195,3|-8|0x4d4943,22|-4|0x514e46,27|-3|0x726e65,44|-3|0xdecdb4,51|-3|0xdecdb4"},--石距
  {c=0x35312c,str="6|3|0x3a3832,9|8|0x2d2a25,-7|7|0x34302b,-18|3|0xdab67d,22|-4|0x433f3a,33|9|0x2b2823,42|0|0xdfcdb3,60|0|0xdfcdb3"},--饿鬼
  {c=0x3a3732,str="-1|13|0x272420,-9|-1|0xdfcdb3,18|4|0x322e2a,18|13|0x3a3732,31|5|0x272420,45|2|0x2a2723,44|9|0x35322d,57|13|0x2d2a25,55|4|0xdfcdb3"},--小松丸
}

识别参数750 = {
  {c=0x33302b,str = "-13|5|0xddb97c,14|5|0x34302c,18|10|0x312e29,44|12|0x292622,44|-6|0x282521,53|0|0xdfcdb3,22|3|0xdeb97d,56|3|0xdfcdb3"},--椒图
  {c=0x403d37,str = "-7|14|0x34312c,13|14|0x36332e,-16|6|0xdab57c,22|2|0x322f2b,31|11|0x2e2b26,37|14|0x272420,57|-1|0x322f2a,64|-3|0x302d28,84|2|0xdfcdb3"},--鬼使黑
  {c=0x4c4842,str = "0|9|0x2d2a25,6|-4|0x2b2823,-22|4|0xdab272,10|-13|0xdeb97d,56|4|0xdfcdb3,82|3|0xdfcdb3,25|4|0x272420,30|7|0x2a2723,28|-4|0x322f2a"},--骨女
  {c=0x34312c,str = "-7|7|0xdfcdb3,-15|14|0x292622,-22|8|0xdbb273,23|7|0xd9af6e,31|4|0x272420,17|4|0x292622,55|5|0x2e2b26,57|16|0x34312c,72|11|0xdfcdb3"},--二口女
  {c=0x47433d,str ="14|4|0x272420,16|-9|0x272420,-11|-3|0xd9b070,43|3|0x272420,28|-1|0x383530,76|2|0x33302b,71|-12|0x35312c,93|-7|0xdfcdb3,66|-5|0x2f2c28"},--海坊主
  {c=0x423e38,str="4|8|0x282521,-17|7|0xd6c9b9,18|8|0x2d2925,32|8|0xd6c9b9,26|-5|0x292622,19|-5|0x2f2b27,46|5|0x312d28,58|14|0x272420,59|0|0xd6c9b9"},--鸟
  {c=0x302d28,str="14|9|0x646158,15|-2|0x413e38,33|12|0x2b2824,47|0|0x37342f,61|8|0x35322d,76|11|0x292622,98|7|0x2f2c28,103|2|0x282521,98|-1|0x2c2925"},--经验
  {c=0x34302c,str="-19|0|0xdeb97c,9|-4|0x2b2824,36|2|0x292622,29|-7|0x2d2a25,53|3|0x312e29,67|6|0x312e29,94|-3|0x282521,88|-6|0x302d29,-9|-2|0x3b3832"},--金币
  {c=0x2b2824,str="6|6|0x322f2a,18|7|0x383530,28|0|0x3f3c37,46|7|0x312e29,67|10|0x2c2924,67|-9|0x48443e,95|-9|0x494640,94|10|0x282521,-11|-1|0xdcb981"},--跳跳
  {c=0x2a2723,str = "11|1|0x2c2925,26|-4|0x413e38,40|-4|0x45423c,42|7|0x5e5a52,1|7|0x2c2925,9|-10|0x2c2924,59|-3|0xdfcdb3"},--石距
  {c=0x33302b,str = "7|4|0x302d28,26|-6|0x403d37,33|-7|0x37342f,39|9|0x2f2c27,40|-2|0xdfcdb3,16|-2|0xddbc85,-18|-2|0xdebd88,-8|7|0x34312c"},--饿鬼
  {c=0x35322d,str = "-1|15|0x272420,-11|0|0xdfcdb3,5|13|0xdfcdb3,21|16|0x272420,21|4|0x272420,35|13|0x34312c,51|10|0x272420,67|14|0x292622,64|6|0xdfcdb3"},--小松丸
}
识别参数720 = {
  {c=0x302d28,str = "-12|5|0xddbf8e,16|9|0x282521,42|12|0x3c3933,42|-5|0x2f2c27,34|1|0x2a2723,53|1|0xdecdb4,21|3|0xdec090,0|10|0x322f2a,0|-6|0x2f2c27"},--椒图
  {c=0x413d37,str = "12|14|0x282521,-7|13|0x383530,-17|9|0xdbc094,21|2|0x292622,36|14|0x292622,31|-3|0x302d28,62|-4|0x292622,55|6|0x3a3731,79|6|0xdecdb4"},--鬼使黑
  {c=0x3d3a34,str ="-1|10|0x37342e,5|-2|0x282521,-22|0|0xd9bb8e,23|5|0x272420,27|7|0x2a2723,32|-2|0x2c2924,22|-8|0x3a3631,48|0|0xdecdb4,10|6|0xdbbd8c"},--骨女
  {c=0x272420,str = "-5|-11|0x43403a,-10|-5|0xdecdb4,-26|-2|0xdbbc8c,25|-7|0x272420,22|0|0x322f2a,50|4|0x282521,54|-6|0x2c2925,71|-4|0xdecdb4,44|-12|0x3b3732"},--二口女
  {c=0x3f3c36,str ="-2|8|0x2c2925,-23|-1|0xdbc094,15|-5|0x2e2b26,27|6|0x33302b,48|5|0x302d28,49|-7|0x383530,67|-1|0xdecdb4,-15|5|0x45423c,24|-6|0x292622"},--海坊主
  {c=0x282521,str="-13|1|0x312d28,-19|0|0xd8c8b7,13|0|0x2f2b27,22|-13|0x332f2a,30|-5|0xd8c8b7,41|-2|0x2c2924,52|6|0x272420,54|-8|0xd8c8b7,44|-13|0x39352f"},--
  {c=0x302d28,str="13|3|0x58554d,14|-7|0x403d37,32|4|0x413e38,38|-10|0x2d2a26,56|-3|0x332f2b,67|-4|0x44413b,83|-6|0x4c4842,83|1|0x36332e"},--经验
  {c=0x3c3933,str="9|-3|0x2a2723,-19|3|0xdbbd8d,35|2|0x36322d,31|-12|0x322f2a,50|4|0x2f2c27,64|6|0x393631,85|3|0x2c2924,90|-2|0x282521,59|-4|0x4c4942"},--金币
  {c=0x282521,str="-17|-10|0x2e2a26,-31|-10|0xdabc8b,27|-1|0x292622,18|-14|0x2c2924,47|2|0x272420,48|-20|0x302d29,70|-10|0x282521,81|-11|0x33302b,81|-5|0xdecdb4"},--跳跳
  {c=0x292622,str = "11|0|0x2f2c28,10|5|0x494640,25|-4|0x383530,39|-4|0x2d2a26,40|6|0x393530,47|-2|0xdecdb4,58|0|0xdecdb4"},--石距
  {c=0x2f2c27,str ="10|10|0x2c2925,-8|6|0x3e3934,-21|3|0xdcc195,25|-4|0x3f3c36,37|10|0x272420,31|-5|0x43403a,46|0|0xdecdb4,75|-1|0xdecdb4"},--饿鬼
  {c=0x49463f,str ="-1|15|0x322f2a,-8|1|0xdecdb4,21|5|0x2a2723,21|16|0x2e2b26,34|14|0x383530,50|10|0x272420,65|14|0x282521,63|5|0xdecdb4,52|-2|0x393530"},--小松丸
}
识别参数1080 = {
  {c=0x423f39,str = "0|15|0x494640,25|14|0x292622,20|8|0x2c2925,-19|8|0xdbbc8c,82|5|0xdecdb4,63|17|0x282521,63|-9|0x292622,51|1|0x2f2c27,56|4|0x2e2b26"},--椒图
  {c=0x3d3d33,str = "18|20|0x2c2c22,53|20|0x23241e,54|3|0x2b2b21,93|-6|0x24251d,97|20|0x2c2c24,122|8|0xddcdb3,-27|10|0xddc094,-10|19|0x363530,30|3|0x20211c"},--鬼使黑
  {c=0x37342f,str = "-1|16|0x282521,8|-4|0x322f2a,-32|2|0xdabc8c,1|-15|0x2a2722,43|12|0x272420,51|-3|0x302d28,34|-13|0x2f2c28,35|8|0x272420,74|5|0xdecdb4"},--骨女
  {c=0x292621,str = "-9|9|0xdecdb4,9|17|0x2b2824,-20|20|0x292622,-33|12|0xdcbe8d,44|4|0x302d28,35|10|0xdbbd8c,83|22|0x272420,76|17|0x272420,104|13|0xdecdb4"},--二口女
  {c=0x292621,str = "-3|15|0x272420,-35|0|0xdbbc8e,39|13|0x272420,21|-14|0x272420,86|11|0x282521,79|-8|0x3d3a35,103|-1|0xdecdb4,35|-6|0x312e29,-24|11|0x2c2924"},--海坊主
  {c=0x2c2924,str="6|10|0x272420,-15|12|0x282521,-23|11|0xd8c8b7,25|9|0x2e2b26,46|18|0x282521,46|9|0xd8c8b7,38|-9|0x34302b,73|-13|0x302d28,83|19|0x272420"},--鸟
  {c=0x302d28,str="-12|5|0xdabc8d,30|16|0x282521,47|18|0x292622,68|0|0x2d2a25,88|-9|0x2c2925,109|16|0x282420,125|16|0x403d37,148|3|0x282521,140|-2|0x2d2a26"},--经验怪
  {c=0x312e29,str="12|-6|0x272420,-31|5|0xdec091,46|-18|0x282521,50|4|0x282521,74|5|0x2a2723,96|10|0x282521,111|10|0x3d3934,134|-4|0x292621,-27|5|0xdabc8c"},--金币怪
   {c=0x2e2b27,str="32|2|0x2f2c27,51|-22|0x393631,72|2|0x2d2a25,-9|-9|0xdabb8b,102|4|0x282521,103|-26|0x3a3731,153|-15|0x2b2824,142|4|0x292622,143|-28|0x36332e"},--跳跳
  {c=0x272420,str = "17|-1|0x33302b,13|-16|0x302d28,37|-8|0x423f39,47|-15|0x383530,58|-7|0x292521,60|8|0x282521,31|6|0x504d46"},--石距
  {c=0x33302b,str = "9|6|0x302d29,15|15|0x2c2925,-12|12|0x312e29,-26|13|0xdcc197,66|0|0xdecdb4,90|8|0xdecdb4,55|16|0x292622,38|-6|0x393530,47|-9|0x2a2723"},--饿鬼
  {c=0x3b3833,str = "-2|23|0x272420,-15|1|0xdecdb4,8|18|0xdecdb4,30|9|0x2b2824,30|24|0x292622,49|20|0x33302b,74|15|0x272420,97|21|0x322e2a,89|11|0xe2d3bb"},--小松丸
}
识别参数1242 = {
  {c=0x322f2a,str = "12|16|0x282521,29|15|0x322e2a,-23|2|0xddbf8e,74|19|0x2a2723,98|5|0xdecdb4,73|-12|0x292621,65|4|0x2b2824,12|-3|0x403d37,24|9|0x312e29"},--椒图
  {c=0x3e3a35,str = "21|25|0x2c2925,11|-1|0x2f2c27,-26|14|0xdcb981,35|5|0x282521,60|25|0x312e2a,62|5|0x2c2925,107|-6|0x2a2723,95|10|0x36332e,140|10|0xdfcdb3"},--鬼使黑
  {c=0x2c2925,str = "-9|-12|0x292622,-11|22|0x2b2824,-44|10|0xdcb981,31|13|0x272420,39|18|0x282521,37|2|0x322f2a,70|10|0xdfcdb3,29|-9|0x2f2c27"},--骨女
  {c=0x282521,str = "-14|12|0xdfcdb3,-23|22|0x2a2723,-37|11|0xdcb981,52|5|0x282521,39|12|0xdcb880,47|18|0x2b2823,87|20|0x272420,95|25|0x282521,127|13|0xdfcdb3"},--二口女
  {c=0x2c2925,str = "-4|16|0x272420,-41|-1|0xdbb57c,45|14|0x272420,24|-17|0x282521,82|12|0x2e2b27,91|-11|0x38352f,112|-2|0xdfcdb3,98|12|0x35322d,-27|11|0x3d3a35"},--海坊主
  {c=0x2c2925,str="-12|-2|0xd8c8b7,24|-4|0x272420,30|-9|0xd8c8b7,45|-10|0x2d2a25,62|-25|0x322e2a,77|-18|0xd8c8b7,93|-8|0x34302b,113|8|0x272420,117|-14|0xd8c8b7"},--鸟
  {c=0x2d2a26,str="35|17|0x3a3631,54|20|0x2b2824,-15|10|0xddbf8e,78|-1|0x2d2a26,102|12|0x2c2925,126|18|0x2b2823,144|19|0x3c3933,170|2|0x282521,161|-3|0x2e2b26"},--经验
  {c=0x3a3631,str="16|-6|0x272420,-31|3|0xdcbe8e,60|5|0x33302b,54|-21|0x2f2c28,87|6|0x2c2924,110|11|0x292621,147|4|0x2b2824,156|-3|0x282521,87|-17|0x3e3b35"},--金币
  {c=0x393630,str="26|26|0x2a2722,37|23|0x302d28,72|25|0x312e29,108|-8|0x3a3732,106|29|0x282521,152|29|0x292622,163|7|0x312e29,-28|14|0xddba84,47|-1|0x282521"},--跳跳
  {c=0x272420,str="20|0|0x282521,16|-19|0x2f2c27,6|-14|0x2a2723,38|8|0x33302b,54|10|0x2f2b27,54|-17|0x2f2c28,68|-8|0x2b2824"},--石距
  {c=0x282521,str="11|6|0x2e2b27,18|16|0x2b2823,-13|12|0x322f2a,-33|4|0xdebd87,81|-2|0xdfcdb3,123|1|0xdfcdb3,64|17|0x282521,44|-9|0x3b3832,55|-11|0x36332e"},--饿鬼
  {c=0x2c2924,str="-2|20|0x272420,-16|-10|0xdfcdb3,35|1|0x282521,57|16|0x35322d,85|10|0x272420,111|18|0x282521,105|4|0xdfcdb3,89|-10|0x322f2a,-36|8|0xddbc86"},--小松丸
}
识别参数1440 = {
  {c=0x2d2a25,str = "13|20|0x292622,34|18|0x292622,86|22|0x292622,69|0|0x35322d,85|-13|0x282521,-22|4|0xd8ba8c,115|9|0xdecdb4,27|12|0x322f2a,76|5|0x302d28"},--椒图
  {c=0x3c3833,str = "-14|27|0x33302b,-33|19|0xdcbe8e,24|29|0x292622,41|5|0x282521,72|28|0x2c2924,62|-4|0x2e2b27,124|-8|0x2b2824,129|27|0x2e2b26,149|10|0xdecdb4"},--鬼使黑
  {c=0x3d3a34,str = "8|13|0x36332e,6|32|0x272420,19|6|0x2c2925,61|8|0x2c2925,52|-4|0x2f2c28,64|28|0x2d2a26,55|22|0x282521"},--骨女
  {c=0x393630,str =	"11|22|0x292622,57|8|0x272420,53|21|0x302d29,31|6|0x292622,104|11|0x302d28,106|29|0x282521,97|24|0x272420"},--二口女
  {c=0x2f2c27,str = "-5|20|0x272420,-45|4|0xdabb8b,28|-7|0x35322d,53|18|0x272420,62|-10|0x282521,95|-4|0x292621,115|15|0x2a2723,135|4|0xdecdb4,22|9|0x292621"},--海坊主
  {c=0x302c27,str = "-3|-14|0x2e2b26,19|-15|0x2d2925,27|-2|0x272420,51|10|0x282521,53|-3|0x2e2a26,108|-6|0x2a2723,130|10|0x282521"},--鸟
  {c=0x3a3631,str = "2|12|0x2c2925,40|22|0x3a3732,90|0|0x312e29,87|12|0x36332e,148|23|0x2d2a25,-18|13|0xdcbe8d,189|14|0x433f39,197|5|0x272420,229|-4|0xdecdb4"},--经验怪
  {c=0x302d29,str = "15|15|0x2a2723,-42|6|0xdec090,15|-8|0x2a2723,68|5|0x302d29,61|-24|0x2b2823,115|-3|0x322f2a,127|14|0x302d28,149|3|0x413e38,175|-6|0x36332e"},--金币怪
  {c=0x33302b,str = "40|3|0x292622,65|-28|0x2b2824,83|-32|0x302d28,134|-36|0x35322d,132|6|0x292622,187|6|0x272420,199|-19|0x33302b"},--跳跳
  {c=0x282521,str = "23|-2|0x292622,20|9|0x2c2925,19|-23|0x2f2c27,44|8|0x393631,80|-10|0x312e29,87|-18|0xe3d5bd,-30|-3|0xddbf8e"},--石距
  {c=0x2b2823,str = "21|20|0x2a2723,-16|16|0x312e2a,-37|10|0xddc195,75|21|0x292621,51|-9|0x3b3833,63|-11|0x302d28,101|1|0xdecdb4,132|3|0xdecdb4,9|-3|0x2d2a25"},--饿鬼
  {c=0x312e29,str = "-2|31|0x272420,-18|3|0xdecdb5,40|9|0x2a2722,40|32|0x292621,66|26|0x35322d,98|20|0x272420,129|28|0x2a2723,122|15|0xdecdb4,103|-3|0x34312c"},--小松丸
}
function 识别函数(第几个)
--keepScreen(true)
if w == 640 then
  local x = -1
  local y=-1
  if 识别参数640[第几个].c == 0 then
    return false
  end
  x, y = findMultiColorInRegionFuzzy(识别参数640[第几个].c,识别参数640[第几个].str,90, 468,149, 582,520)
  if x > -1 then
    sysLog(第几个.."识别"..x..":"..y)
    判断选哪个队伍(y)
    mSleep(100)
    判断选哪个队伍(y)
    return true
  end
  return false
elseif w == 750 then
  local x = -1
  local y=-1
  if 识别参数750[第几个].c == 0 then
    return false
  end
  x, y = findMultiColorInRegionFuzzy(识别参数750[第几个].c,识别参数750[第几个].str, 90, 548,173,672,579)
  --sysLog(第几个.."识别"..x..":"..y)
  if x > -1 then
    sysLog(第几个.."识别"..x..":"..y)
    判断选哪个队伍(y)
    mSleep(100)
    判断选哪个队伍(y)
    return true
  end
  return false
elseif w == 1242 then
  local x = -1
  local y=-1
  if 识别参数1242[第几个].c == 0 then
    return false
  end
  x, y = findMultiColorInRegionFuzzy(识别参数1242[第几个].c,识别参数1242[第几个].str, 90, 912,297, 1132,964)
  sysLog(第几个.."识别"..x..":"..y)
  if x > -1 then
    判断选哪个队伍(y)
    mSleep(100)
    判断选哪个队伍(y)
    return true
  end
  return false
elseif w == 720 then
  local x = -1
  local y=-1
  if 识别参数720[第几个].c == 0 then
    return false
  end
  x, y = findMultiColorInRegionFuzzy(识别参数720[第几个].c,识别参数720[第几个].str, 90, 530,173,657,580)
  sysLog(第几个.."识别"..x..":"..y)
  if x > -1 then
    判断选哪个队伍(y)
    mSleep(100)
    判断选哪个队伍(y)
    return true
  end
  return false
elseif w == 1080 then
  local x = -1
  local y=-1
  if 识别参数1080[第几个].c == 0 then
    return false
  end
  x, y = findMultiColorInRegionFuzzy(识别参数1080[第几个].c,识别参数1080[第几个].str, 90, 791,260,976,847)
  
  sysLog(第几个.."识别"..x..":"..y)
  if x > -1 then
    判断选哪个队伍(y)
    mSleep(100)
    判断选哪个队伍(y)
    return true
  end
  return false
elseif w == 1440 then
  local x = -1
  local y=-1
  if 识别参数1440[第几个].c == 0 then
    return false
  end
  x, y = findMultiColorInRegionFuzzy(识别参数1440[第几个].c,识别参数1440[第几个].str, 90,1050,338,1286,1174)
  
  sysLog(第几个.."识别"..x..":"..y)
  if x > -1 then
    判断选哪个队伍(y)
    mSleep(100)
    判断选哪个队伍(y)
    return true
  end
  return false
end
end


满字参数 = {
  {c = 0xfea418,str = "0|7|0xfaca0c,8|10|0xffe007,4|-2|0xfc9a1a,4|2|0xffb015,8|12|0xffea04,3|6|0xfac40e"},
  {c = 0xffa319,str = "-3|0|0xfda219,-6|8|0xfacd0b,4|10|0xffdd08,0|6|0xfdc30f,-3|6|0xf9c00f,1|3|0xf9ae14"},
  { c = 0xff9d1a,str = "-4|1|0xffa219,-4|9|0xfbcd0b,4|12|0xffe106,-1|5|0xe8a513"},
  { c = 0xf8a61e,str = "3|0|0xfd9f16,-3|10|0xf2d40a,7|10|0xfada14,3|3|0xfab01c"},
}

满字判断范围 = {
  {586,273,748,464},
  {368,229,501,356},
  {156,121,327,331},
  {184,42,320,242},
  {322,61,478,218},
  
  {0,203,131,440},
  {307,359,633,582},
}

function 准备时识别满字(第几个)
--keepScreen(true)
local degree = 90
if w == 720 or h == 720 then
  degree = 90
end
for i=1,#满字参数 do
  local x, y = findMultiColorInRegionFuzzy(满字参数[i].c,满字参数[i].str,degree, 满字判断范围[第几个][1],满字判断范围[第几个][2], 满字判断范围[第几个][3],满字判断范围[第几个][4])
  if x > -1 then
    sysLog(第几个.."准备"..x..":"..y)
    return true
  end
end
return false
end

更换式神界面= {
  
  {980,612,0xeed6a7},
  {1032,600,0xdeb87f},
  {1099,612,0xf2dbad},
  {1119,576,0x615974},
  {591,620,0x3c3144},
  {97,34,0xd6c4a1},
  
  拖动 = {830,538,184,526},
  拖动1 = {184,526,830,538},
  返回 = {25,35,0xf0f5fb},
  全部 = {60,491,0x564e47},
  选N = {61,290,0xb4b3b4},
  点击 = {594,526,0x6bbfe7},
}

更换式神界面1= {
  {50,603,0x4e4791},
  {58,576,0x504882},
  {84,595,0x31315c},
  {27,38,0xd6c4a1},
  {1043,600,0xe3be83},
}

更换式神界面2= {
  {542,41,0x201815},
  {591,39,0x26150d},
  {880,310,0x391f10},
  {881,204,0x3a2011},
  {27,38,0xd6c4a1},
}

更换式神界面3 ={
  {978,616,0xf3dcaf},
  {1095,610,0xebcf9c},
  {1119,578,0x504657},
  {59,477,0x3f3b96},
  {38,397,0xf9faf1},
  {44,392,0xf5f7e9},
}

更换式神界面4 ={
  {978,616,0xf3dcaf},
  {1095,610,0xebcf9c},
  {1119,578,0x504657},
  {60,458,0x433123},
  {38,397,0xf9faf1},
  {44,392,0xf5f7e9},
}

观战界面 = {
  {26,570,0x605974},
  {23,588,0x534a5f},
  {56,606,0x1d251d},
  {27,38,0xd6c4a1},
  {979,614,0xefd8a8},
  {1002,614,0xd6a86d},
  {1036,603,0xd9ac6f},
  {1104,619,0xe8cc97},
  {1094,571,0xaa200e},
}


更换判断范围 = {
  {92,67,265,341},
  {452,67,655,341},
  {839,67,1073,341},
  {238,0,497,341},
  {559,0,870,389},
  
  {191,79,386,395},
  
  {760,113,900,327},
}

function 更换时识别满字(第几个)
local degree = 92
if w == 720 or h == 720 then
  degree = 90
end
keepScreen(true)
for i=1,#满字参数 do
  local x, y = findMultiColorInRegionFuzzy(满字参数[i].c,满字参数[i].str,degree, 更换判断范围[第几个][1],更换判断范围[第几个][2], 更换判断范围[第几个][3],更换判断范围[第几个][4])
  if x > -1 then
    keepScreen(false)
    sysLog(第几个.."更换"..x..":"..y)
    return true
  end
end
keepScreen(false)
return false
end

function 更换时识别满字返回位置(第几个)
local degree = 92
if w == 720 or h == 720 then
  degree = 90
end
keepScreen(true)
for i=1,#满字参数 do
  local x, y = findMultiColorInRegionFuzzy(满字参数[i].c,满字参数[i].str,degree, 更换判断范围[第几个][1],更换判断范围[第几个][2], 更换判断范围[第几个][3],更换判断范围[第几个][4])
  if x > -1 then
    keepScreen(false)
    sysLog(第几个.."更换"..x..":"..y)
    return x,y+10
    --return true
  end
end
keepScreen(false)
return -1,-1
end

更换拖动位置 = {
  {187,293,0x4e342c},
  {578,277,0xcec2ba},
  {954,290,0xbb875a},
  {329,267,0xecd6c3},
  {691,228,0x691923},
    {311,309,0x171b28},
  {829,212,0xdec7b9},
}
function 判断5星(x1,y1,x2,y2)
local x, y = findMultiColorInRegionFuzzy(0x75a3cb,"12|0|0x6ea1c7,26|1|0x7398c9,38|1|0x719cc8,51|0|0x6da0c6", 88, x1,y1,x2,y2)
if x > -1 then
  sysLog("判断5星"..x..":"..y)
  return true
end
return false
end
function 判断白达摩(x1,y1,x2,y2)
--keepScreen(true)
local x, y = findMultiColorInRegionFuzzy(0xfbe0cc,"19|-21|0x2a2424,-12|-23|0x2a2424,2|-53|0xffffff,-18|11|0xffffff,19|13|0xffffff", 85, x1,y1,x2,y2)
if x > -1 then
  --sysLog("判断白达摩"..x..":"..y)
  return true
end
return false
end
function 判断红达摩(x1,y1,x2,y2)
--keepScreen(true)
local x, y = findMultiColorInRegionFuzzy(0xfff1dc,"-21|-2|0xe6dfde,16|-7|0xffffff,-11|-26|0xe7534a,9|43|0xf6f3f2,22|59|0x9deef6,-21|43|0xe55c4e", 85, x1,y1,x2,y2)
if x > -1 then
  --sysLog("判断红达摩"..x..":"..y)
  return true
end
return false
end
function 判断黑达摩(x1,y1,x2,y2)
--keepScreen(true)
local x, y = findMultiColorInRegionFuzzy(0xeeccb7,"-13|-12|0xffffff,14|-12|0x272524,-11|-39|0x464342,-27|26|0x4a4847,16|28|0xb88d44,21|29|0x595655",85, x1,y1,x2,y2)
if x > -1 then
  sysLog("判断黑达摩"..x..":"..y)
  return true
end
return false
end

function 判断蓝达摩(x1,y1,x2,y2)
--keepScreen(true)
local x, y = findMultiColorInRegionFuzzy(0x3d3836,"-17|-6|0x81b1d7,24|-13|0x71a1d0,-1|-57|0x3651a4,5|-41|0xefe6df,-2|10|0x322c2a",85, x1,y1,x2,y2)
if x > -1 then
  sysLog("判断蓝达摩"..x..":"..y)
  return true
end
return false
end

function 判断满(x1,y1,x2,y2)
--keepScreen(true)
for i=1,#满字参数 do
  local x, y = findMultiColorInRegionFuzzy(满字参数[i].c,满字参数[i].str,90, x1,y1,x2,y2)
  if x > -1 then
    --sysLog("判断满"..x..":"..y)
    return true
  end
end
return false
end

function 判断寄生魂(x1,y1,x2,y2)
--keepScreen(true)
local x, y = findMultiColorInRegionFuzzy(0xdb8786,"-11|36|0xf27f82,9|35|0xf58a8c,39|61|0x3c3935,18|-9|0x351e23,-17|-5|0x3f2429,-29|61|0xd52626", 90, x1,y1,x2,y2)
if x > -1 then
  -- sysLog("判断寄生魂"..x..":"..y)
  return true
end
return false
end

修改过数据 = false
N卡判定C = 0x2c160d
N卡判定STR = "97|1|0x2d170e,96|-100|0x27140c,48|-123|0x33312d,8|-105|0x352013,1|-63|0x2d170e,98|51|0x30180f,2|50|0x30190f"
R卡判定C = 0x387bb2
R卡判定STR = "96|0|0x3575a8,96|-106|0x1151a9,7|-109|0x352114,46|-127|0x2c2a26,95|-51|0x3779b0,96|47|0x253659,82|-107|0x1b5aa9"
function 判断N卡(monster_type,white_egg,上红蛋,上N卡,上R卡)
--keepScreen(true)
--monster_type == 1代表不用管寄生魂
if 修改过数据 == false then
  if 我是国服 == false then
    sysLog("修改刷新位置")
    组队界面.刷新 = 组队界面.刷新日服
    组队界面.加入 = 组队界面.加入日服
    N卡判定C = 0x2d170d
    N卡判定STR = "96|4|0x2d170e,97|-49|0x2b160d,94|-107|0x2c170e,40|-108|0x2d170e,8|-110|0x372215,97|48|0x30180f,-1|43|0x30180f,-1|-70|0x2c160d"
    R卡判定C = 0x3779b1
    R卡判定STR = "0|-89|0x296db2,7|-110|0x603f20,19|-108|0x1f5fa9,96|-108|0x1050a9,96|-44|0x3575a9,96|6|0x3070a9,96|48|0x243559"
    table.insert(满字参数,{c = 0xffc40f,str = "-17|-1|0xfebc19,0|-5|0xfda217,9|1|0xfdcc0c,12|-3|0xf1b10f"})
    table.insert(满字参数,{c = 0xff9d19,str = "0|8|0xffd206,-11|8|0xffd305,-18|2|0xf7a227,8|7|0xfdcc0c,12|3|0xeeb112,-11|2|0xf6a12a"})
  end
  修改过数据 = true
end
point = {}
if 上R卡 == 1 then
  point  = findMultiColorInRegionFuzzyExt(R卡判定C,R卡判定STR,92, 253,449, 810,584)
end
if 上N卡 == 1 then
  t_point  = findMultiColorInRegionFuzzyExt(N卡判定C,N卡判定STR,92, 253,449, 810,584)
  if #point ~= 0 then
    for var = 1,#t_point do
      table.insert(point,t_point[var])
    end
  else
    point = t_point
  end
end
if #point ~= 0 then	
  for var = 1,#point do
    --sysLog("判断N卡"..point[var].x..":"..point[var].y)
    if monster_type == 1 then
      if white_egg == 1 and 上红蛋 == 1 then
        if  判断满(point[var].x-30,point[var].y-150,point[var].x+30,point[var].y-50) == false and 判断5星(point[var].x-10,point[var].y-40,point[var].x+120,point[var].y+120) == false and 判断蓝达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断黑达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false  then
          sysLog("判断N卡成功"..point[var].x..":"..point[var].y)
          --keepScreen(false)
          return point[var].x+50,point[var].y
        end
      elseif white_egg == 1 then
        if  判断满(point[var].x-30,point[var].y-150,point[var].x+30,point[var].y-50) == false and 判断5星(point[var].x-10,point[var].y-40,point[var].x+120,point[var].y+120) == false and 判断蓝达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断黑达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断红达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false  then
          sysLog("判断N卡成功"..point[var].x..":"..point[var].y)
          --keepScreen(false)
          return point[var].x+50,point[var].y
        end
      elseif 上红蛋 == 1 then
        if 	判断满(point[var].x-30,point[var].y-150,point[var].x+30,point[var].y-50) == false and 判断5星(point[var].x-10,point[var].y-40,point[var].x+120,point[var].y+120) == false and 判断蓝达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断黑达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断白达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false  then
          sysLog("判断N卡成功"..point[var].x..":"..point[var].y)
          --keepScreen(false)
          return point[var].x+50,point[var].y
        end
      else
        if 判断满(point[var].x-30,point[var].y-150,point[var].x+30,point[var].y-50) == false and 判断5星(point[var].x-10,point[var].y-40,point[var].x+120,point[var].y+120) == false and 判断蓝达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断黑达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断红达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断白达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false then
          sysLog("判断N卡成功"..point[var].x..":"..point[var].y)
          --keepScreen(false)
          return point[var].x+50,point[var].y
        end
      end
    else
      if white_egg == 0 then
        if 判断5星(point[var].x-10,point[var].y-40,point[var].x+120,point[var].y+120) == false and 判断蓝达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断黑达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断白达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断红达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断寄生魂(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断满(point[var].x-30,point[var].y-100,point[var].x+30,point[var].y) == false then
          sysLog("判断N卡成功"..point[var].x..":"..point[var].y)
          --keepScreen(false)
          return point[var].x+50,point[var].y
        end
      else
        if 判断5星(point[var].x-10,point[var].y-40,point[var].x+120,point[var].y+120) == false and 判断蓝达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断黑达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断红达摩(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断寄生魂(point[var].x-10,point[var].y-120,point[var].x+120,point[var].y+120) == false and 判断满(point[var].x-30,point[var].y-100,point[var].x+30,point[var].y) == false then
          sysLog("判断N卡成功"..point[var].x..":"..point[var].y)
          --keepScreen(false)
          return point[var].x+50,point[var].y
        end
      end
    end
  end
end
--keepScreen(false)
return -1,-1
end


百鬼夜行界面 = {
  {816,474,0xf3b25e},
  {891,472,0xf3b25e},
  --{277,469,0xf4ede3},
  {574,382,0xf7a37e},
  {564,340,0xf8ad8f},
  进入 = {858,472,0xf3b25e},
  邀请好友 = {276,469,0xf4ede3},
}

判定是否邀请队友 = {
  {287,481,0x473a39},
  {290,457,0x473a39},
  {265,455,0x473a39},
  {261,479,0x473a39},
  {321,469,0xc7bdb4},
  {370,475,0xc7bdb4},
}

百鬼邀请界面 = {
  {330,163,0x9f876d},
  {802,160,0x9f876d},
  {800,148,0x9f876d},
  {810,431,0xcbb59c},
  {811,296,0xcbb59c},
  拖动 = {556,485,557,190},
}

百鬼邀请界面1 = {
  {340,119,0x6a4938},
  {346,520,0x694837},
  {810,431,0xcbb59c},
  {811,296,0xcbb59c},
}
百鬼邀请位置 = {
  {438,223,0xb2a79a},
  {670,217,0xd1c4b4},
  {439,294,0x5d564f},
  {677,295,0xd6c9b9},
  {444,375,0xd6c9b9},
  {681,369,0xd6c9b9},
  {445,449,0xd6c9b9},
  {680,445,0xd6c9b9},
}

选择鬼王界面 = {
  {507,120,0xd9d0c7},
  {628,120,0xdad1c8},
  {1017,569,0xf7f1da},
  {1073,570,0xf7f1da},
  {1124,572,0xdedfdc},
  开始 = {1050,540,0xeaddcc},
}

选择鬼王 ={
  {269,410,0x050403},
  {564,412,0x030103},
  {884,390,0x060402},
}

撒豆界面 = {
  {214,594,0xf1c849},
  {476,600,0xe53d3a},
  {357,590,0x361d0f},
  {164,590,0x271818},
  点击 = {605,338,0x2b2a34},
  判定冰冻 = {1084,595,0x35252a},
  判定冰冻1 = {1069,601,0x5e4c65},
}

撒豆位置=  {
  {373,341,0x603f58},
  {605,338,0x2b2a34},
  {938,334,0x5b4763},
}

庭院界面 = {
  {954,260,0xb2ab9a},
  {950,250,0xbaae9a},
  {948,210,0xafa8b1},
  {929,213,0xb7b0bd},
  {936,300,0x969692},
  百鬼 = {803,143,0xffffd9},
  妖怪退治 = {552,109,0xa2a19e},
  斗技 = {691,126,0xffffe2},
  狩猎 = {442,132,0xfffff3},
}

百鬼契约书 = {
  {98,422,0xc4ae95},
  {99,407,0xc5af96},
  {90,207,0xb69f87},
  {100,184,0xc7b198},
  {320,498,0xe3dcd4},
  点击 = {915,612,0x1a1d43},
}

妖气封印界面 = {
  {103,215,0xb29b82},
  {117,411,0xc3ad94},
  --{80,507,0x4c2530},
  {120,131,0x8a6051},
  {989,478,0xe5dac4},
  {928,479,0xdad0ba},
  挑战 = {903,480,0xe1d5bf},
  关闭 = {1034,93,0xe7d4cf},
}

妖气开组界面 = {
  {562,459,0xf3b25e},
  {650,454,0xf3b25e},
  {386,456,0xcbb59c},
  {757,460,0xcbb59c},
  {674,173,0xcbb59c},
  点击 = {1010,92,0xa49692},
  创建 = {570,457,0xf3b25e},
  所有人可见= {535,265,0x402f11},
}

妖气开组界面日服 = {
  {550,451,0xf2b15d},
  {580,460,0xf6af5f},
  {670,448,0xeeb365},
  {391,363,0xc8b29a},
  {732,447,0xcbb59d},
  点击 = {1010,92,0xa49692},
  创建 = {573,451,0xf1b85e},
  所有人可见= {535,271,0x422f0f},
}

怪物位置 = {472,771}
标记左边 = {342,169,0x484921}
标记右边 = {823,169,0xb6954b}
标记中间 = {587,138,0x141213}
function 战斗找怪物血量(方向)
point  = findMultiColorInRegionFuzzyExt(0xaf0d0a,"3|0|0xb20e0b,6|0|0xb50e0b,-21|8|0x372215,-21|-9|0x372215", 90, 100, 0, 1135, 400)
if #point ~= 0 then	
  if 方向 == 1 or 方向 == 2 then
    table.sort(point, function(a,b) return a.x<b.x end )
  else
    table.sort(point, function(a,b) return a.x>b.x end )
  end
  for var = 1,#point do
    if 方向 == 1 or 方向 == 0 then
      if point[var].x < 怪物位置[1] then
        if 打标记次数 < 最大标记次数 then
          click(point[var].x+50,point[var].y+80)
        end
        return true
      elseif point[var].x > 怪物位置[2] then
        click(point[var].x+50,point[var].y+80)
        return true
      end
    elseif 方向 == 2 then
      if point[var].x < 怪物位置[1] then
        if 打标记次数 < 最大标记次数 then
          click(point[var].x+50,point[var].y+80)
        end
        return true
      else
        click(random_click(标记中间[1],标记中间[2]))
        return true
      end
    elseif 方向 == 3 then
      if point[var].x > 怪物位置[2] then
        if 打标记次数 < 最大标记次数 then
          click(point[var].x+50,point[var].y+80)
        end
        return true
      else
        click(random_click(标记中间[1],标记中间[2]))
        return true
      end
    end
  end
end
return false
end

右边狗粮妖术 ={
  {769,622,0x422118},
  {769,614,0x422118},
  {749,624,0x361e15},
  {788,627,0x3f2017},
  {763,629,0x3c1f14},
  点击 = {752,629,0xfffefa},
}

中间狗粮妖术 ={
  {869,622,0x422118},
  {869,614,0x422118},
  {849,614,0x422118},
  {847,624,0x452414},
  {863,629,0x402015},
  点击 = {870,623,0xfffdfb},
}

左边狗粮妖术 ={
  {971,622,0x422118},
  {971,614,0x422118},
  {949,614,0x472516},
  {947,624,0x472616},
  {964,629,0x442315},
  点击 ={963,623,0xfdf3ea},
}

战斗中调整视角 = {
  {33,512,0x953257},
  {41,512,0x9b355c},
  {40,506,0x983459},
  点击 ={33,512,0x953257},
}


个人突破打开了奖励 = {
  {611,353,0xcbb59c},
  {689,350,0xcbb59c},
  {621,261,0xcbb59c},
  {701,256,0xcbb59c},
  {452,231,0x5f4764},
  --{480,202,0x9f876d},
  {496,233,0x5e4663},
  点击 ={942,376,0x544f4a},
}

function 找附件信(范围)
--keepScreen(true)
local yy = 522
if 范围 == 1 then
  yy = 522
elseif 范围 == 2 then
  yy = 422
elseif 范围 == 3 then
  yy = 322
elseif 范围 == 4 then
  yy = 222
end
x, y = findMultiColorInRegionFuzzy(0xef864f,"16|1|0xfb8e5a,10|18|0xeacdb2,-20|-20|0xeed19b,-14|-21|0xeed29b,-30|4|0xf4d8a3,-23|26|0x474541",90, 138,102,439,yy,1,1)
if x > -1 then
  sysLog("找附件信"..x..":"..y)
  click(x,y)
  return true
end
x, y = findMultiColorInRegionFuzzy(0xefceb2,"0|-17|0xe37745,9|-17|0xc75130,-5|-9|0xfa8c54,-5|-31|0xf5d8a3,-29|-16|0xf1d7a1", 90, 138,102,439,yy,1,1)
if x > -1 then
  sysLog("找附件信"..x..":"..y)
  click(x,y)
  return true
end
x, y = findMultiColorInRegionFuzzy(0xc65b4a,"9|1|0x4ccab7,-18|-7|0xe8d2a4,11|-16|0xead2a5,-36|14|0x4a4743,22|-44|0x474541", 90, 138,102,439,yy,1,1)
if x > -1 then
  sysLog("找附件信"..x..":"..y)
  click(x,y)
  return true
end
return false
end

function 找普通信()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xf0dbb1,"-19|-5|0xe7d1a2,17|-7|0xead4a6,-4|-28|0xe5cc9c,12|4|0xe8d1a4,-27|7|0x494844,12|-32|0x494743", 90, 138,102,439,522,1,1)
if x > -1 then
  sysLog("找普通信"..x..":"..y)
  return true
end
return false
end

打标记位置 = {
  {745,111,0x4f3886},
  {858,252,0x9f938b},
  {418,161,0x261a19},
  {680,220,0x3c4738},--中间
  {567,174,0x462423},--左边
}

function 地图找石距()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xdf4f46,"4|-86|0xdf5744,60|-9|0x476bb9,-82|52|0xf15a4c,-21|-15|0xca413a,96|46|0xfeffff,-5|4|0xe55247", 90, 100, 50, 1000, 550)
--keepScreen(false)
if x > -1 then
  sysLog("地图找石距"..x..":"..y)
  --click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 点击石距() 
x, y = findMultiColorInRegionFuzzy(0xdf4f46,"4|-86|0xdf5744,60|-9|0x476bb9,-82|52|0xf15a4c,-21|-15|0xca413a,96|46|0xfeffff,-5|4|0xe55247", 90, 100, 50, 1000, 550)
--keepScreen(false)
if x > -1 then
  sysLog("地图找石距"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 地图找年兽() 
x, y = findMultiColorInRegionFuzzy(0x413957,"-51|-23|0xe07b3a,1|-73|0xf9c089,-76|-34|0xd7ad63,-107|-6|0xd9383a,26|2|0x2d263e,-12|-61|0x37ab9b", 90, 100, 50, 1000, 550)
--keepScreen(false)
if x > -1 then
  sysLog("地图找年兽"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

新提示框 = {
  {410,384,0xdf6851},
  {522,384,0xdf6851},
  {611,390,0xf3b25e},
  {724,384,0xf3b25e},
  {571,388,0xcbb59c},
  {630,234,0xcbb59c},
  确定 = {676,381,0xf3b25e},
  取消 = {469,382,0xbe5c48},
}


在其他设备登陆 = {
  {533,359,0xf3b25e},
  {613,362,0xf3b25e},
  {449,365,0xcbb59c},
  {677,376,0xcbb59c},
  {583,316,0xcbb59c},
  {553,258,0xcbb59c},
  点击 = {572,363,0xf3b25e},
}

个人突破位置 = {
  {145,85,423,180},
  {427,79,707,180},
  {723,81,996,183},	
  
  {143,185,424,290},
  {430,191,713,288},
  {721,189,999,289},
  
  {142,294,418,394},
  {429,295,712,396},
  {719,292,1000,396},
}

个人突破判断失败用 = {
  {391,106,0xcfbfac},
  {695,103,0xcfbfac},
  {1004,100,0xcfbfac},
  {388,221,0xcfbfab},
  {694,223,0xcfbfac},
  {1007,217,0xcab8a3},
  {388,343,0xcfc0ad},
  {699,338,0xcbbaa5},
  {1004,339,0xccbba7},
}

function 突破选人函数(point,rtype)
if point ==nil then
  return false
end
if #point ~= 0 then	
  local 个人突破可选位置 = {}
  for var = 1,#point do
    for i = 1,#个人突破位置 do
      if isInRange(point[var].x,point[var].y,个人突破位置[i]) and isColorArray(个人突破判断失败用[i],90)  then
        if #个人突破可选位置 ~= 0 then
          local 是否重复 = false
          for j=1,#个人突破可选位置 do
            if 个人突破可选位置[j] == i then
              是否重复= true
              break
            end
          end
          if 是否重复 == false then
            table.insert(个人突破可选位置,i)
          end
        else
          table.insert(个人突破可选位置,i)
        end
      end
    end
  end
  if #个人突破失败位置 ~= 0 then
    for j=#个人突破失败位置,1,-1 do
      for var = 1,#个人突破可选位置 do
        if 个人突破失败位置[j] == 个人突破可选位置[var] then
          table.remove(个人突破可选位置,var)
          break
        end
      end
    end
  end
  local temp_str = ""
  for var=1,#个人突破可选位置 do
    sysLog(个人突破可选位置[var])
    temp_str = temp_str..":"..var
  end
  if #个人突破可选位置 ~= 0 then
    showHD_b("勋章"..rtype..",可选位置"..temp_str)
    local rand = math.random(1,#个人突破可选位置)
    上次突破选择位置 = 个人突破可选位置[rand]
    table.insert(个人突破失败位置,上次突破选择位置)
    click(random_click(个人突破选择[上次突破选择位置][1],个人突破选择[上次突破选择位置][2]))
    mSleep(500)
    return true
  end
end
return false
end

function 勋章0()
--keepScreen(true)
--point = findMultiColorInRegionFuzzyExt(0xafa18b,"-36|-6|0xafa18b,-70|-5|0xafa18b,-108|-4|0xafa18b,-139|-4|0xafa18b,-148|-3|0xa69882,-136|-15|0xa69882,-130|-4|0xaea089,-157|7|0xcac1b1,26|-3|0xcac1b1", 93, 128,80, 1024,439)
point = findMultiColorInRegionFuzzyExt(0xa1927d,"59|1|0xa79783,153|-13|0x9a8c78,163|8|0xa0907c,-75|18|0xccbaa6,-12|14|0xd2c4b2,-5|-54|0xd2c4b2,171|-51|0xd3c5b4,-61|-63|0xcebdaa,100|-9|0xd5c8b8",93, 128,80, 1024,439)
--keepScreen(false)
if 突破选人函数(point,0) then
  return true
end
return false
end

function 勋章1()
--keepScreen(true)
point = findMultiColorInRegionFuzzyExt(0xafa18b,"-32|-1|0xafa18b,-72|-3|0xafa18b,-102|-2|0xafa18b,-104|-9|0xaea089,-112|-1|0xaea089,-92|1|0xa2957e,-98|7|0xa99b85,-158|8|0xcac1b1,25|-6|0xcac1b1",  93, 128,80, 1024,439)
--keepScreen(false)
if 突破选人函数(point,1) then
  return true
end
return false
end

function 勋章2()
--keepScreen(true)
point = findMultiColorInRegionFuzzyExt(0xafa18b,"-34|6|0xafa18b,-70|6|0xafa18b,-69|-6|0xab9d87,-78|3|0xaea089,-61|4|0xaea089,-69|13|0xaa9b85,-158|15|0xcac1b1,25|6|0xcac1b1",93,128,80, 1024,439)
--keepScreen(false)
if 突破选人函数(point,2) then
  return true
end
return false
end

function 勋章3()
--keepScreen(true)
point = findMultiColorInRegionFuzzyExt(0xafa18b,"-37|2|0xafa18b,-44|2|0xae9f89,-28|3|0xaea089,-34|-9|0xab9d87,-36|9|0xae9f89,-159|11|0xcac1b1,25|6|0xcac1b1,6|-20|0xcac1b1",93, 128,80, 1024,439)
--keepScreen(false)
if 突破选人函数(point,3) then
  return true
end
return false
end

function 勋章4()
--keepScreen(true)
point = findMultiColorInRegionFuzzyExt(0xafa18b,"-5|1|0xafa18b,0|-4|0xafa18b,5|4|0xafa18b,-1|13|0xa2947e,-8|8|0xaa9b85,2|-5|0xaea089,-6|-30|0xcac1b1,-16|19|0xcac1b1", 93, 128,80, 1024,439)
--keepScreen(false)
if 突破选人函数(point,4) then
  return true
end
return false
end

function 勋章5()
--keepScreen(true)
point = findMultiColorInRegionFuzzyExt(0xcbc0b4,"-15|-21|0xccc1b7,84|-24|0xd4cac0,88|47|0xcbc0b4,-154|49|0xc6bcae,-153|-21|0xcdc2b6",92,128,80, 1024,439)
--keepScreen(false)
if 突破选人函数(point,5) then
  return true
end
return false
end

悬赏邀请 = {
  {752,378,0x55b260},
  {765,368,0x5bb766},
  {757,461,0xda6c5a},
  {766,449,0xdf7461},
  接受 = {752,371,0x5cb767},
  拒绝 = {759,458,0xde7564},
}

体力不足界面 = {
  {517,420,0xf3b25e},
  {629,420,0xf3b25e},
  {722,218,0xd4cdc6},
  {427,222,0xd4cec6},
  {463,445,0x958a92},
  购买 = {579,420,0x9c723d},
  关闭 = {832,172,0xe8d4cf},
}

停止运行 = {
  {385,362,0x282828},
  {453,366,0x282828},
  {644,371,0x282828},
  {727,374,0x282828},
  {381,302,0x282828},
  {635,311,0x282828},
  {731,315,0x282828},
  确定 = {561,377,0x6c6c6c},
}

金币邀请 = {
  {590,429,0xdfb853},
  {590,445,0xb15c2b},
  {608,437,0x75671b},
  {615,435,0xa7572b},
}

勾玉邀请 = {--完美
  {605,444,0xc3a687},
  {618,438,0xe9351d},
  {620,432,0xec4c3b},
  {592,448,0x8b45d1},
}

体力邀请 = {
  {592,438,0x080907},
  {596,442,0x0c0d0a},
  {606,452,0x141810},
  {612,451,0x1a1f14},
}

商城界面 = {
  {430,130,0xeac89e},
  {499,128,0xe8c197},
  {928,43,0x39261b},
  {86,75,0x573d34},
}

确定买咒符 = {
  {514,416,0xf3b25e},
  {613,418,0xf3b25e},
  {630,418,0xf3b25e},
  {505,353,0xcbb59c},
  {596,360,0xcbb59c},
  {472,267,0x3f4349},
  点击 = {579,415,0x51412d},
}

function 找咒符位置()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0x838e97,"10|-27|0xa2a9af,20|-23|0xa6adb2,12|-1|0x838e96,-8|-18|0x4744a7,41|-15|0x4642b3,14|41|0xdfcabc",90, 100, 50, 1000, 550)
--keepScreen(false)
if x > -1 then
  sysLog("找咒符位置"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false

end

组队邀请 = {
  {39,230,0xd96b5a},
  {43,220,0xde715d},
  {123,233,0x56ab58},
  {138,220,0x66bf6b},
  确定= {124,230,0x4ead5c},
  取消={36,227,0xd86f5c},
}

还有组队 = {
  {39,429,0xf8f9ee},
  {45,423,0xf5f7e9},
  {22,432,0xf0eddb},
  {35,405,0xd13943},
  {50,438,0xf0eddb},
}


组队探索界面 = {
  {407,511,0xdf6851},
  {487,509,0xdf6851},
  {645,506,0xf3b25e},
  {728,506,0xf3b25e},
  {735,146,0xcbb59c},
  寮友 = {326,115,0xe2b38b},
  好友 = {430,115,0xe5ba91},
  邀请 = {689,512,0xf3b25e},
  取消 = {451,512,0xdf6851},
  第一个 = {426,201,0xaea79e},
}

换皮肤 = {
  {642,308,0xede2d0},
  {622,308,0xede2d0},
  {576,241,0xede2d0},
  {601,240,0xede2d0},
  点击= {796,322,0x4c6fa7},
}

最右狗粮妖术 = {
  {1048,624,0x452116},
  {1071,622,0x442116},
  {1073,613,0x452116},
  {1081,613,0x452116},
  {1097,618,0x452116},
  {1074,622,0x452116},
  点击= {1048,624,0x452116},
}

游戏公告 = {
  {473,89,0x4f392c},
  {673,93,0x4f392d},
  {194,247,0x8d7245},
  {204,571,0xad9377},
  {931,572,0xad9377},
  关闭 = {942,167,0xe9d1cd},
}

御魂选择界面 = {
  {90,207,0xcdc0bc},
  {59,495,0xffd321},
  {1114,249,0xe3d9ca},
  {1074,532,0x864e1c},
  大蛇 = {361,340,0x60524f},
  业原火 = {780,311,0x140e11},
  关闭 = {1098,130,0xe8d4cf},
}

新觉醒选择界面 = {
  {254,534,0x8b402c},
  {494,533,0x389385},
  {733,532,0x4787ad},
  {970,531,0x704c96},
  关闭 = {1093,139,0xe8d2ce},
}


个人突破失败判定 = {
  {400,109,0xcdbda9},
  {703,107,0xcdbda9},
  {1004,101,0xcdbda9},
  {400,228,0xcdbda9},
  {698,219,0xcdbda9},
  {1007,222,0xcdbda9},
  {395,336,0xcdbda9},
  {701,336,0xcdbda9},
  {1007,338,0xcdbda9},
}


召唤界面 = {
  {287,458,0xd2d5d2},
  {468,472,0x9cdef4},
  {664,467,0x606060},
  {854,490,0xbc68db},
  退出 = {49,25,0xf0f5fb},
  抽N卡 = {317,524,0x337373},
}

召唤界面170520 = {
  {264,508,0xb5b6b6},
  {431,496,0x94daf1},
  {662,496,0x616161},
  {914,517,0xbb66da},
  退出 = {49,25,0xf0f5fb},
  抽N卡 = {241,523,0xa9a9a9},
}

召唤出了5张卡 = {
  {486,584,0x4a3a2d},
  {675,584,0x4c3d2f},
  {918,501,0x2c232c},
  {216,75,0x817178},
  {667,24,0x481d1b},
  {974,56,0x87767c},
}

卡牌位置 = {
  {270,287,0x9fa1a0},
  {419,287,0x999b9a},
  {573,285,0x9d9f9e},
  {723,282,0xa5a6a5},
  {869,286,0x989a98},
}

再次召唤 = {
  {408,575,0xf3b25e},
  {495,582,0xf3b25e},
  {631,576,0xf3b25e},
  {694,573,0xf3b25e},
  点击 = {694,573,0xf3b25e},
}


来电界面 = {
  {962,485,0xff3b30},
  {902,478,0xff3b30},
  {963,184,0x4cd964},
  {915,143,0x4cd964},
  {975,480,0xff3b30},
}

结算满级判定范围640 = {
  {507,343,601,376},
  {707,342,803,377},
  {911,343,1006,376},
  {311,447,375,469},
  {514,448,574,468},
}

结算满级判定范围750 = {
  {604,407,677,437},
  {836,407,910,437},
  {1073,407,1150,437},
  {369,527,442,551},
  {602,526,680,552},
}

function 结算判断满级()
local 几个满级 = 0
if w==750 then
  resetScreenScale()
  for i=1,#结算满级判定范围750 do
    local x, y = findMultiColorInRegionFuzzy(0xd2ccbb,"7|2|0xdbd5c4,5|14|0xe6e1ce,13|12|0xf6f1de,6|14|0xe5dfcd",  85,结算满级判定范围750[i][1],结算满级判定范围750[i][2],结算满级判定范围750[i][3],结算满级判定范围750[i][4])
    if x > -1 then
      几个满级 = 几个满级+1
      x = -1
      y = -1
    end
  end
  setScreenScale(640,1136)
else
  for i=1,#结算满级判定范围640 do
    local x, y = findMultiColorInRegionFuzzy(0xeee9d6,"6|4|0xf6f1de,11|11|0xf8f3e0,8|12|0xe2dcca", 85,结算满级判定范围640[i][1],结算满级判定范围640[i][2],结算满级判定范围640[i][3],结算满级判定范围640[i][4])
    if x > -1 then
      几个满级 = 几个满级+1
      x = -1
      y = -1
    end
  end
end

sysLog(几个满级)
return 几个满级
end

点击检查更新 = {
  {727,467,0x73b4d3},
  {712,398,0x7fb9d2},
  {600,363,0xf4414f},
  {250,316,0xf34c5a},
  {82,39,0xd4b577},
  {680,53,0xb8b9c9},
  点击 = {474,287,0xf9d6cb},
}

判断有准备的鼓 = {
  {1003,614,0xd6a86d},
  {1016,604,0xbf8651},
  {1100,618,0xeacf9c},
  {1126,587,0x483e52},
  {1076,587,0xc29c67},
  点击 = {991,477,0xab845c},
}

兔子舞 = {
  {972,588,0x76a927},
  {958,573,0xbc401c},
  {992,571,0xac321c},
  {980,599,0x608c27},
  {979,594,0x689828},
  选择 = {970,593,0x85b12c},
  释放 = {397,403,0x8fc9db},
}

打火机= {
  {1075,604,0x001d30},
  {1076,581,0x000408},
  {1085,571,0x0dcce2},
  {1055,572,0x0f6bd5},
  {1068,606,0x001f34},
  选择 = {1075,604,0x001d30},
}

座敷平砍 = {
  {872,598,0xfefffe},
  {874,589,0xf8fff8},
  {866,590,0xfbfffa},
  {878,589,0xfcfffb},
  {873,605,0xffffff},
  选择 = {872,598,0xfefffe},
  鬼火判断 = {655,618,0xd7d3cd},
}

隐分身 = {
  {1086,601,0x652c1f},
  {1063,602,0x2a0606},
  {1056,588,0x3b0705},
  {1071,569,0x4d1d18},
  {1089,570,0x3e0c09},
  选择 = {1075,604,0x001d30},
  释放 = {392,343,0x291c10},
  魂10释放 = {549,300,0x69551d},
}

诛邪剑 = {
  {962,591,0x7d0b06},
  {971,606,0xa12d24},
  {975,570,0x420000},
  {960,577,0x350302},
  选择 = {970,593,0x85b12c},
}

博雅平砍 = {
  {867,591,0xcc5d5e},
  {882,571,0x7d0000},
  {857,568,0x280000},
  {889,613,0x340000},
  {852,593,0xa92f2f},
  选择 = {867,591,0xcc5d5e},
}

比基尼平砍 = {--
  {880,583,0xe8fdff},
  {890,588,0xf2feff},
  {888,600,0x47e2f2},
  {847,609,0x14468e},
  {857,581,0x38e1f1},
  选择 = {867,591,0xcc5d5e},
}

战斗要待机 = {
  {877,617,0x291a19},
  {947,613,0x291a19},
  {1033,616,0x291a19},
  {1079,615,0x291a19},
}

惠比寿平砍 = {
  {875,582,0x822a07},
  {860,586,0xffff85},
  {847,573,0x4b1200},
  {888,577,0xa8621a},
  选择 = {874,583,0x7d2707},
}

点怪位置 = {
  {522,199,0x302215},
  {523,114,0x284854},
  {362,203,0xd28145},
  {295,203,0xec9f21},
  {711,212,0x43525a},
  {761,202,0xa0112d},
}

清明盾 = {
  {1074,595,0xbba7ff},
  {1056,602,0xa489fe},
  {1093,602,0xa887fd},
  {1073,571,0x426aaf},
  {1059,580,0x399ee0},
  选择 = {1074,595,0xbba7ff},
}

清明平砍 = {
  {884,588,0xd4ffff},
  {878,602,0xebffff},
  {879,581,0xd2ffff},
  {889,569,0x356aab},
  {860,570,0x27316b},
  选择 = {884,588,0xd4ffff},
}

清明灭 = {
  {997,593,0xd265f9},
  {977,613,0xe9ffff},
  {971,567,0x010001},
  {946,589,0x5f4ba8},
  选择 = {997,593,0xd265f9},
}

莹草平砍 = {
  {859,579,0xffffff},
  {884,574,0x245b41},
  --{848,610,0xe8f6cc},
  {880,609,0xe2feb7},
  {898,604,0x0a2110},
  选择 = {859,579,0xffffff},
}

兔子没火 ={
  {978,590,0x273910},
  {971,568,0x3e130b},
  {949,578,0x26090b},
  {949,600,0x060708},
  {943,584,0x2c0d09},
  {858,575,0x9e4338},
  {888,587,0x26271a},
  选择 = {888,587,0x26271a},
}

惠比寿旗子 = {
  {1068,601,0xce3f21},
  {1055,595,0x90461e},
  {1062,570,0xa25a24},
  {1093,593,0xfbfbfb},
  选择 ={1068,601,0xce3f21},
}

海坊主平砍 = {
  {873,589,0x1e8eb9},
  {861,572,0x2c287c},
  {887,578,0x44c4da},
  {876,610,0xfaffff},
  {862,570,0x282674},
  选择 ={873,589,0x1e8eb9},
}

业原火挑战界面 = {
  {464,168,0xc1b8ad},
  {463,245,0xc1b8ad},
  {462,330,0xc1b8ad},
  {458,391,0xc7af94},
  {810,446,0xf3b25e},
  --{544,232,0x7d0909},
  {330,387,0x8c0c0b},
  {704,539,0xffca96},
  {724,302,0x2fae93},
  {611,349,0xeb76c3},
  贪之阵 = {370,161,0x4e4a44},
  嗔之阵 = {362,252,0xc1b8ad},
  痴之阵 = {365,322,0xada59b},
  挑战 = {843,442,0xf3b25e},
  关闭 = {928,111,0xe9d6d0},
}

妖刀平砍 = {
  {870,593,0x46546a},
  {882,599,0x323c4c},
  {856,581,0x606786},
  {873,578,0xd19b59},
  {893,575,0x722f45},
  选择 ={873,589,0x1e8eb9},
}

天狗平砍 = {
  {871,583,0x142556},
  {882,575,0x010204},
  {847,608,0xe6e5e5},
  {855,569,0x1b2f5f},
  {892,584,0x5a9fc7},
  选择 ={873,589,0x1e8eb9},
}

吸血平砍 = {
  {868,600,0x5c0d08},
  {878,609,0xfffee6},
  {894,586,0x200e1c},
  {856,569,0xa91328},
  {855,586,0x5e0806},
  选择 ={873,589,0x1e8eb9},
}

鸟平砍 = {
  {873,588,0xd8ffff},
  {885,584,0xc8ffff},
  {866,589,0xc5ffff},
  {850,572,0x1f0d34},
  {877,569,0x060c19},
  选择 ={873,589,0x1e8eb9},
}

茨木平砍 = {
  {870,599,0xdc4bae},
  {886,582,0x2e0a38},
  {853,599,0xde3bb5},
  {846,579,0x5a0b3c},
  {881,570,0x340933},
  选择 ={873,589,0x1e8eb9},
}

酒吞平砍 = {
  {888,606,0xac9079},
  {888,590,0xaa8f78},
  {856,591,0x020101},
  {885,566,0x3d657f},
  {865,572,0x020202},
  选择 ={873,589,0x1e8eb9},
}

判断是否有寮 = {
  {273,139,0x7a634c},
  {270,311,0x7a624c},
  {270,474,0x725945},
}

挂机御魂邀请界面 = {
  {407,508,0xdf6851},
  {489,514,0xdf6851},
  {567,510,0xcbb59c},
  {645,509,0xf3b25e},
  {730,517,0xf3b25e},
  {461,115,0x9f876d},
  {430,114,0x9f876d},
  {397,114,0x9f876d},
  第一个 = {440,199,0x3f3b36},
  确定 = {689,506,0xf3b25e},
  取消 = {448,515,0xdf6851},
  第二个 = {683,201,0x504c47},
}

挂机御魂邀请界面1 = {
  {407,508,0xdf6851},
  {489,514,0xdf6851},
  {567,510,0xcbb59c},
  {645,509,0xf3b25e},
  {730,517,0xf3b25e},
  {360,111,0xc1a98f},
  {406,111,0xc1a98f},
  {459,114,0xc1a98f},
}
点开了人物详情 = {
  {616,398,0xf3b25e},
  {617,462,0xf3b25e},
  {781,463,0xf3b25e},
  {776,397,0xf3b25e},
  {762,326,0xcbb59c},
  点一下 = {873,542,0x493925},
}

组队头像识别点 = {
  {349,200,0xf5eee7},
  {346,199,0x8b544d},
  {353,191,0x6a464c},
  {363,198,0x5b4e51},
  {353,210,0x6e5760},
}

组队头像3人识别点 = {
  {612,202,0xcdc5b2},
  {604,202,0x211a16},
  {610,192,0x35546c},
  {620,201,0x142e24},
  {612,209,0xf2b59b},
}

协同斗技界面 = {
  {943,507,0xddc6a9},
  {1035,508,0xe2c39f},
  {1001,564,0xebc47f},
  {1012,593,0x751f1d},
  {1082,182,0xb8661a},
  点击 = {984,519,0xe2bd8a},
}

秘闻副本界面 = {
  {452,101,0xffd37c},
  {656,101,0xffd583},
  {98,184,0xe3d9c9},
  {70,420,0x9da082},
  {1111,270,0xd9d9ce},
  关闭 = {1095,139,0xe8d4cf},
}

点开组队邀请 = {
  {52,141,0xe8ddcb},
  {32,159,0xe8ddcb},
  {37,122,0xede3d3},
  {24,158,0xede3d3},
  {24,128,0xede3d3},
  点击 = {39,143,0x8c857b},
}

阴阳术界面 = {
  {200,37,0x392925},
  {939,137,0xe9ded6},
  {920,100,0x453323},
  {976,19,0x2e211e},
  {1060,527,0xc22727},
  返回 = {53,35,0xf0f5fb},
}

阴阳寮界面 = {
  {967,520,0x1584ab},
  {938,515,0x291a19},
  {994,509,0x2b1c1a},
  {1002,559,0x1b1010},
  {844,524,0xaa0034},
  地图 = {976,570,0x0e7da9},
  关闭 = {1025,71,0xfdd5d5},
  祈愿 = {1060,263,0x583825},
  结界 = {860,555,0xab0135},
}

阴阳寮界面1 = {--这是会员的宣言那里的颜色
  {819,575,0x251515},
  {859,552,0xb10035},
  {983,553,0x127da6},
  {1026,88,0x682e36},
  {184,381,0xbda283},
  {277,374,0xbda283},
}

阴阳寮地图界面 = {
  {1054,596,0x493625},
  {1049,585,0x52402e},
  {1103,594,0x5b4b3d},
  {1107,584,0x453626},
  {1081,593,0xfaf4ec},
  {51,53,0xc2cbe0},
  寻找鬼王 = {1055,586,0x453425},
  点中间= {572,240,0x100e19},
  返回 = {55,59,0xc2cbe0},
}

用户设置界面 = {
  {770,489,0xf3b25e},
  {895,477,0xf3b25e},
  {497,492,0xc7bdb4},
  {602,201,0xc7bdb4},
  {974,317,0xc6bcb3},
  用户中心 = {656,169,0x2e180c},
}

用户设置界面170520 = {
  {755,159,0x452719},
  {623,196,0xc7bdb4},
  {492,416,0xd6c9b9},
  {930,390,0xd6c9b9},
  {938,464,0xf3b25e},
  用户中心 = {733,158,0x2a160b},
}

用户中心界面 = {
  --{121,156,0x989898},
  --{102,170,0xffffff},
  {461,527,0xffffff},
  {655,509,0xffffff},
  {74,161,0x989898},
  {870,39,0xf4f4f4},
  {919,431,0xffffff},
  切换账号 = {1031,36,0x00ac58},
}

账号登陆界面 = {
  {409,301,0x22b260},
  {464,302,0x22b260},
  {548,303,0x22b260},
  {772,303,0x22b260},
  {871,300,0x22b260},
  其他账号 = {555,436,0xffffff},
}

账号登陆界面6P = {
  {469,292,0x22b260},
  {541,294,0x22b260},
  {721,289,0x22b260},
  {816,289,0x22b260},
  {478,271,0xffffff},
  {537,270,0xffffff},
  其他账号 = {592,431,0xc5ead5},
}

选择登陆方式界面 = {
  {325,403,0x089cda},
  {321,329,0x089cda},
  {806,408,0xd22020},
  {807,324,0xd22020},
  邮箱登陆 = {804,364,0xffffff},
}

选择登陆方式界面1 = {--这是没有游客的登陆界面
  {727,410,0xd1201f},
  {690,361,0xd1201f},
  {715,321,0xd1201f},
  {770,371,0xd1201f},
  {566,372,0xffffff},
  邮箱登陆 = {730,369,0xffffff},
}

选择登陆方式界面6P = {
  {384,380,0x079ddb},
  {375,318,0x079ddb},
  {451,362,0xffffff},
  {757,384,0xd1201f},
  {754,324,0xd1201f},
  邮箱登陆 = {756,355,0xffffff},
}

选择登陆方式界面16P = {--这是没有游客的登陆界面
  {440,326,0x3cdedf},
  {441,319,0x3cdedf},
  {558,364,0xffffff},
  {701,387,0xd1201f},
  {695,323,0xd1201f},
  {719,339,0xd1201f},
  邮箱登陆 = {690,362,0xf0bbbb},
}

账号密码界面 = {
  {419,367,0x90d8ae},
  {499,363,0x90d8ae},
  {549,358,0x90d8ae},
  {766,359,0x90d8ae},
  {826,354,0x90d8ae},
  账号 = {522,183,0xffffff},
  密码 = {804,275,0xffffff},
  点一下 = {336,177,0xffffff},
  登陆= {670,359,0x90d8ae},
  小叉 = {914,57,0xcccccc},
  安卓小叉 = {864,43,0x6c6c6c},
  果盘小叉 = {901,181,0xffffff},
}

账号密码界面已输入 = {
  {289,164,0xffffff},
  {339,264,0xffffff},
  {328,374,0xffffff},
  {468,359,0x22b260},
  {668,353,0x22b260},
  回退 = {220,173,0xffffff},
}

账号密码界面6P = {
  {508,343,0x90d8ae},
  {555,347,0x90d8ae},
  {708,344,0x90d8ae},
  {820,341,0x90d8ae},
  {412,338,0xffffff},
  {415,355,0xffffff},
  账号 = {544,211,0xd8d8d8},
  密码 = {804,275,0xffffff},
  点一下 = {389,264,0xffffff},
  登陆= {580,341,0x90d8ae},
  小叉 = {837,116,0xcecece},
  安卓小叉 = {837,116,0xcecece},
}

添加好友界面 = {
  {544,175,0x630a0a},
  {599,174,0x940b0b},
  {982,180,0xc7bdb4},
  {1092,293,0xbc6719},
  输入 = {552,126,0xcfc8c1},
  点一下 = {420,183,0xc7bdb4},
  搜索 = {958,123,0xffca7c},
  关闭 = {1054,69,0xe8ceca},
  第一个 = {352,251,0x413d38},
  申请 = {677,398,0xf3b25e},
  同意 = {951,247,0x51ab5b},
  点头像 = {214,252,0x2b2b29},
  有同意按钮 = {959,56,0xdadada},
  有同意按钮ip5 = {953,70,0xffffff},
}

鬼王挑战界面 = {
  {325,423,0x7d0808},
  {714,485,0x0c0d0a},
  --{562,488,0x747678},
  {810,481,0xf3b25e},
  {891,479,0xf3b25e},
  挑战 = {847,479,0xe9ab5b},
  第二个 = {287,295,0xc7af95},
  第三个 = {283,370,0xc7af95},
}

用户协议界面 = {
  {326,557,0xcf4231},
  {398,552,0xcf4231},
  {483,556,0xcf4231},
  {646,563,0x23b260},
  {741,563,0x23b260},
  接受 = {740,559,0x23b260},
}

用户协议界面IP6 = {
  {339,568,0xcf4231},
  {502,565,0xcf4231},
  {644,574,0x23b260},
  {810,570,0x23b260},
  接受 = {707,571,0x23b260},
}

被封号了= {
  {399,388,0xdf6851},
  {520,389,0xdf6851},
  {609,385,0xf3b25e},
  {737,382,0xf3b25e},
  {443,268,0xcbb59c},
  {460,269,0xcbb59c},
  {669,266,0xcbb59c},
  {686,266,0xcbb59c},
  确定 = {462,388,0xdf6851},
}

下载语音包= {
  {427,383,0xdf6851},
  {491,384,0xdf6851},
  {638,381,0xf3b25e},
  {700,383,0xf3b25e},
  {573,392,0xcbb59c},
  取消 = {459,385,0xdf6851},
}

关联手机 = {
  {424,398,0xf3b25e},
  {501,398,0xf3b25e},
  {639,400,0xf3b25e},
  {705,400,0xf3b25e},
  {570,397,0xcbb59c},
  取消 = {460,393,0xf3b25e},
}

阴阳寮申请 = {
  {595,156,0xdf6851},
  {686,155,0xdf6851},
  {756,155,0xf3b25e},
  {856,154,0xf3b25e},
  同意 =  {806,148,0xf3b25e},
  取消 = {640,154,0xdf6851},
}

阴阳寮申请1 = {
  {563,323,0xfffa81},
  {568,302,0xfffc93},
  {546,357,0xba8a4e},
  {581,438,0x3f1712},
  {543,376,0x624428},
  {580,467,0x31110e},
}

function 点击进入空间()
keepScreen(true)
local x, y = findMultiColorInRegionFuzzy(0xf3b25e,"6|-71|0xf3b25e,5|65|0xf3b25e,173|74|0xcbb59c,168|-7|0xf3b25e,169|-72|0xf3b25e", 95, 76,28,486,609)
keepScreen(false)
if x > -1 then
  click(x,y)
  return true
end
return false
end

空间界面 = {
  {455,428,0x6f0707},
  {916,558,0xf3b25e},
  {954,561,0xf3b25e},
  {999,559,0xf3b25e},
  {692,99,0x397db0},
  赞 = {222,302,0xefe2ce},
  留言栏 = {574,566,0xe3dcd4},
  点一下= {288,240,0xf8f8f5},
  留言按钮= {954,558,0xf3b25e},
  关闭 = {1043,63,0xe7d1cc},
}

百鬼点开了说明 = {
  {340,325,0xcbb59c},
  {474,326,0xcbb59c},
  {623,326,0xcbb59c},
  {798,326,0xcbb59c},
  {875,333,0xcbb59c},
  点一下 = {610,509,0x433e39},
}

function 找聊天组队()
x, y = findMultiColorInRegionFuzzy(0xde7000,"3|-6|0xde7000,42|-7|0xde7000,43|1|0xde7000,34|8|0xde7000,39|-1|0xde7000", 93,69,26, 475,563,1,1)
if x > -1 then
  click(x+100,y+20)
  return true
end
return false
end

网络连接出错 = {
  {345,389,0xeadadf},
  {432,393,0xf0e0e2},
  {482,393,0xefdee2},
  {678,393,0xebdedf},
  {773,393,0xdddce3},
  {349,221,0xf3dbe1},
  {772,224,0xd9d6db},
  点击 = {581,400,0xf7d3d7},
}

式神碎片界面= {
  {364,276,0xc7af94},
  {425,274,0xc7af94},
  {711,201,0xe9eaea},
  {750,195,0xe1e5ea},
  --{244,421,0x4182d4},
  关闭 = {931,143,0xe9d7d1},
}

登陆后活动界面 = {
  {73,83,0xc8c8c8},
  {45,87,0xc5c5c5},
  {48,44,0xd9d9d9},
  {70,49,0xd8d8d8},
  返回 = {83,88,0xcccccc},
  拖动 = {809,367,201,341},
  探索 = {445,122,0xffffc1},
  町中 = {524,250,0xc4b9a2},
}

登陆后活动界面1 = {
  {73,83,0xe8ebed},
  {45,87,0xe8ebed},
  {48,44,0xe8ebed},
  {70,49,0xe8ebed},
}
登陆后活动界面2 = {--这是ios的
  {40,46,0xffffff},
  {100,51,0xffffff},
  {185,49,0xffffff},
  {353,48,0xffffff},
  返回 = {1080,42,0xffffff},
}

登陆后活动界面果盘 = {
  {45,69,0xc7c7c7},
  {155,70,0xc7c7c7},
  {255,66,0xc9c9c9},
  {355,67,0xc8c8c8},
  {490,62,0x000000},
  返回 = {42,43,0xd0d0d0},
}

登陆后活动界面海马玩 = {
  {28,18,0xd9d9d9},
  {47,18,0xdcdcdc},
  {72,17,0xd9d9d9},
  {19,28,0xd3d3d3},
  --{93,217,0xf7e171},
}

账号密码界面B站 = {
  {390,379,0x23ade5},
  {468,372,0x23ade5},
  {668,376,0x23ade5},
  {752,373,0x23ade5},
  {486,472,0xffffff},
  账号 = {625,193,0xf2f2f2},
  密码 = {671,287,0xf2f2f2},
  点一下 = {295,242,0xffffff},
  登陆= {562,372,0x23ade5},
  小叉 = {685,191,0xafb0a8},
  安卓小叉 = {837,116,0xcecece},
}

申请加好友 = {
  {436,395,0xf3b25e},
  {514,392,0xf3b25e},
  {633,398,0xf3b25e},
  {710,398,0xf3b25e},
  {570,383,0xcbb59c},
  取消 = {474,390,0xf3b25e},
}

SSR判定 = {
  {241,451,0xe07938},
  {252,451,0xeb8e45},
  {259,451,0xeb9246},
}
SSR判定模拟器 = {
  {247,450,0xe27a3d},
  {260,450,0xe3873a},
  {276,450,0xd95e30},
}

SR判定 = {
  {257,506,0x851bba},
  {264,506,0x821ab8},
  {273,506,0x7018ad},
}

SR判定模拟器 = {
  {239,451,0x631f95},
  {254,451,0x7a25a0},
  {265,450,0x781db4},
}

R判定 = {
  {246,451,0x0d50a3},
  {255,451,0x0e55aa},
  {273,451,0x1c4a91},
}

祈愿界面 = {
  {1065,266,0xc36a19},
  {1075,161,0x553725},
  {1076,377,0x523523},
  {1080,491,0x563723},
  --{981,550,0x1888ae},
}

捐赠判定 = {
  {925,135,0xf3b25e},
  {917,233,0xf3b25e},
  {921,327,0xf3b25e},
  {917,430,0xf3b25e},
}

点赞判定 = {
  {260,389,0xf3b25e},
  {260,461,0xf3b25e},
  {427,464,0xf3b25e},
  {428,385,0xf3b25e},
  --{365,323,0xf2e8d6},
  赞 = {364,324,0xf1e6d3},
  点一下 = {695,410,0x85786c},
}

结算SR判定 = {
  {233,158,0x6816b6},
  {233,168,0x6d17ba},
  {233,183,0x7b19cc},
}

结算R判定 = {
  {233,163,0x0b4698},
  {233,182,0x0c4aa3},
  {233,192,0x0d4bb7},
}

结算金币判定 = {
  {244,170,0x464340},
  {245,232,0x45423f},
  {275,176,0xdfb95d},
}

打开卷轴小号等级不足 = {
  {1107,575,0xddccc6},
  {350,558,0xe2dfdc},
  {261,548,0xdfd3d0},
  {197,545,0x7891bd},
}

结界界面= {
  {843,531,0x2e2725},
  {915,521,0x952a2a},
  {1014,180,0xe9e442},
  {925,325,0xd9bfb3},
  返回 = {38,42,0xaac1ef},
  式神育成 = {574,342,0xc9aea3},
  结界卡 = {917,320,0x0e0800},
  吸收 = {937,172,0xbb8213},
}

结界界面竹林= {
  {880,494,0x2e2221},
  {894,492,0x2c2325},
  {931,483,0x94161b},
  {47,322,0x2d3d7a},
  {130,319,0x5d6697},
}

结界界面斗鱼= {
  {946,558,0x251f21},
  {963,556,0x251d21},
  {69,194,0x0c59ae},
  {38,308,0x2c4453},
  {1109,288,0x18242e},
}

式神育成界面= {
  {43,629,0x3d3c54},
  {1067,607,0x26382b},
  {1073,207,0xa8371f},
  {1081,177,0xa8371f},
  {1078,148,0xa8371f},
  我的寄养 = {1017,371,0xcfc9b9},
  好友寄养 = {1024,206,0xc8c1b0},
  拖到寄养 = {1015,177,0x272420},
  全部 = {61,583,0xd6bf75},
  选N = {43,382,0x3d3b35},
  最后一个 = {988,547,0xfff13c},
}

寄养位置 = {
  {955,552,0xb0b4b7},
  {825,561,0xada392},
  {693,547,0xf1cdb7},
  {561,552,0xe3c9b7},
  {424,542,0x835f2b},
  {292,552,0x0a6c97},
  {156,550,0xebddc6},
}

好友寄养界面= {
  {341,112,0x9f876d},
  {371,110,0x9f876d},
  {765,115,0x9f876d},
  {787,113,0x9f876d},
  拖动= {559,368,561,152},
}

好友寄养界面1= {
  {341,116,0xc1a98f},
  {367,119,0xc1a98f},
  {755,118,0xc1a98f},
  {783,117,0xc1a98f},
  {654,563,0x654433},
  拖动= {559,368,561,152},
}

好友寄养位置 = {
  {449,183,0xbdb5ac},
  {706,189,0xcec6bc},
  {441,274,0x383530},
  {699,262,0xcec6bc},
  {442,364,0xcec6bc},
  {697,351,0xcac2b8},
  {444,445,0xcec6bc},
  {698,434,0xc9c2b8},
  {439,514,0xcdc5bb},
  {697,511,0xcec6bc},
}

结界卡界面 = {
  {80,125,0xd691ae},
  {71,132,0x6b382f},
  {63,83,0x66372f},
  {503,425,0xf1eeea},
  {567,476,0xeae8de},
  关闭 = {1047,65,0xe8d4cf},
}

结界卡星数 = {
  {714,298,0xf1772c},
  {727,299,0xf38a32},
  {740,299,0xf38a32},
  {753,299,0xf38a32},
  {766,299,0xf38a32},
}

太鼓卡 = {
  {707,285,0x812d31},
  --{729,286,0x802c30},
  --{752,283,0xa83e32},
  {703,326,0x6c0a15},
  {698,336,0x6e0914},
  {759,325,0x8e0813},
  {759,329,0x880811},
  {686,384,0xcec6bc},
  {685,389,0xcec6bc},
}

斗鱼卡 = {
  {703,279,0x68a0a2},
  {712,278,0x528893},
  {704,325,0x6c0a15},
  {711,338,0x6b0913},
  {681,386,0xcec6bc},
  {682,393,0xcec6bc},
}

伞卡 = {
  {720,285,0xb49059},
  {722,286,0xb49059},
  {734,286,0x967955},
  {692,326,0x650b17},
  {700,338,0x6d0a15},
  {741,332,0x8b0714},
  {676,387,0xcec6bc},
  {701,390,0xcec6bc},
}

经验卡 = {
  {708,286,0x1aa9d3},
  {719,286,0x1cb5dc},
  {733,287,0x1cb5dc},
  {745,288,0x1cbcdf},
  {702,384,0xcec6bc},
  {718,382,0xcec6bc},
  {727,385,0xcec6bc},
}

变异卡 = {
  {696,323,0x6c0a15},
  {696,334,0x650a14},
  {719,324,0x7e0812},
  {743,323,0x8e0715},
  {672,382,0xcec6bc},
  {715,385,0xcec6bc},
  {739,384,0xcec6bc},
  {694,388,0xcec6bc},
  {767,393,0xcec6bc},
  判定点 = {748,266,0x665243},
}

百绘罗伊 = {
  {293,592,0xf3b25e},
  {405,595,0xf3b25e},
  {625,591,0xf3b25e},
  {719,592,0xf3b25e},
  {844,318,0x8d7245},
  关闭 = {840,245,0xe5a5b2},
}

确认寄养 = {
  {441,486,0xdf6851},
  {516,482,0xdf6851},
  {567,485,0xcbb59c},
  {610,485,0xf3b25e},
  {692,484,0xf3b25e},
  确定 = {657,486,0xf3b25e},
}

第二回合 = {
  {551,382,0xeecf92},
  {590,378,0xebc783},
  {615,439,0x881509},
  {587,447,0x640e06},
  {519,313,0x272420},
  {536,276,0xdcc8b0},
  {535,331,0x272420},
  {507,332,0x272420},
}

第三回合 = {
  {214,22,0x372215},
  {220,33,0x261817},
  {654,14,0xffba30},
}

第三回合业原火 = {
  {518,324,0x272420},
  {532,336,0x272420},
  {554,328,0x272420},
  {608,331,0x272420},
  {515,324,0x272420},
  {518,313,0x272420},
}

第三回合业原火日服 = {
  {500,325,0x272420},
  {503,308,0x272420},
  {519,340,0x272420},
  {480,344,0x272420},
  {544,331,0x272420},
  {619,338,0x272420},
  {640,331,0x272420},
}

阴阳寮界面没有寮 = {
  {786,469,0xf3b25e},
  {904,473,0xf3b25e},
  {779,542,0x4c3926},
  {775,587,0x443120},
  {1013,541,0x1888ae},
  地图 = {1010,564,0x0e4158},
}

模拟器无响应 = {--这是海马玩
  {490,373,0x282828},
  {634,378,0x282828},
  {654,240,0xf3f3f3},
  {476,239,0xf3f3f3},
  {402,296,0x282828},
  确定 = {718,383,0x888888},
}

模拟器无响应天天 = {
  {491,399,0x282828},
  {540,414,0x282828},
  {587,416,0x282828},
  {560,291,0x282828},
  {645,291,0x282828},
  {711,410,0x282828},
  确定 = {653,425,0x282828},
}

断线期间结束战斗 = {
  {526,373,0xf4b25f},
  {604,373,0xf4b25f},
  {529,335,0xccb49b},
  {590,341,0xccb49b},
  {554,411,0xccb49b},
  {661,389,0xccb49b},
  确定 = {569,373,0xf4b25f},
}

登陆公告 = {
  {145,59,0xcec4bb},
  {268,59,0xcec6bc},
  {882,56,0xcec6bc},
  {1039,156,0xcfc5be},
  关闭 = {1015,72,0xe8d4cf},
}

妖怪退治红蛋 = {
  {563,278,0xffedd8},
  {547,277,0xf8f5f4},
  {586,276,0xebe5e4},
  {585,329,0xde4338},
  {541,328,0xde4338},
  点击 = {563,278,0xffedd8},
  返回 = {52,55,0xc4cce1},
  返回1 = {39,42,0xc2cbe0},
}

妖怪退治挑战 = {
  {260,221,0xc7b196},
  {338,218,0xc7af94},
  {429,221,0xc7af94},
  {273,296,0xc7b095},
  {373,293,0xc7af94},
  {467,295,0xc7af94},
  {289,400,0x640a0a},
  {840,464,0xf3b25e},
  挑战 = {840,464,0xf3b25e},
}

式神录界面  ={
  {53,30,0xedf4fb},
  {252,31,0x734620},
  {606,38,0x362210},
  {619,260,0xd9d0bf},
  {1095,23,0x734921},
  {21,568,0xe0cf7e},
  {47,573,0xfaf1e3},
  碎片红点 = {135,557,0xff1e1e},
  点击 = {108,582,0x6a6a6a},
  详细 = {1100,348,0x181010},
  退出 = {53,32,0xeaf2fa},
}

式神录界面170520  ={
  {36,40,0xfff1ee},
  {38,74,0xd9c08b},
  {224,12,0x30231f},
  {619,260,0xd9d0bf},
  {21,568,0xe0cf7e},
  {47,573,0xfaf1e3},
  碎片红点 = {135,557,0xff1e1e},
  点击 = {108,582,0x6a6a6a},
  详细 = {1100,348,0x181010},
  退出 = {53,32,0xeaf2fa},
}

式神召唤界面  = {
  {141,118,0x4a3522},
  {380,125,0x493522},
  {441,128,0x493422},
  --{53,30,0xedf4fb},
  --{252,31,0x734620},
  --{606,38,0x362210},
  {619,260,0xd9d0bf},
  {106,550,0x000000},
  召唤 = {852,366,0xa07a3c},
}

町中点到人了 = {
  {725,393,0xede2d0},
  {795,460,0xede2d0},
  {725,526,0xede2d0},
  {727,363,0xede2d0},
  点击 = {357,319,0x101419},
}

樱花提示 = {
  {408,381,0xf5c48f},
  {431,207,0x911c2a},
  {439,201,0x8c1b29},
  {417,190,0xefceb9},
  点击 = {395,169,0x535832},
}

新好友寄养界面 = {
  {670,503,0xf3b25e},
  {798,498,0xf3b25e},
  {596,482,0xcbb59c},
  {555,182,0xcbb59c},
  {905,184,0xcbb59c},
  {894,451,0xcbb59c},
  进入结界 = {730,498,0xf3b25e},
  拖动 = {363,520,359,137},
}

新好友寄养界面选择 = {
  {357,183,0x4b4640},
  {357,281,0xd6c9b9},
  {361,375,0xd6c9b9},
  {366,477,0xd6c9b9},
}

普攻判定阴阳师 = {
  {1052,526,0x452116},
  {1073,526,0x452116},
  {1077,530,0x452116},
  {1090,531,0x442015},
  {1097,522,0x452116},
  点击 = {1075,498,0xe6d6c1},
}

普攻判定中 = {
  {869,626,0x452116},
  {850,626,0x452116},
  {848,615,0x533024},
  {888,631,0x442116},
  {895,622,0x452116},
  --{876,631,0x452116},
  点击 = {877,597,0xbbaa96},
}

普攻判定左2 = {
  {650,626,0x452116},
  {668,627,0x452116},
  {687,631,0x442116},
  {693,622,0x452116},
  {667,628,0x452116},
  点击 = {671,590,0xa8a4a6},
}

普攻判定左1 = {
  {769,625,0x452116},
  {750,626,0x452116},
  {750,628,0x452116},
  {795,622,0x452116},
  {776,630,0x452116},
  --{788,632,0x59372a},
  点击 = {773,595,0xffe9e6},
}

普攻判定右2 = {
  {952,625,0x452116},
  {970,625,0x452116},
  {970,628,0x452116},
  {989,631,0x432015},
  {995,622,0x452116},
  点击 = {970,587,0xe5deda},
}

普攻判定右1 = {
  {1053,625,0x452116},
  {1071,625,0x452116},
  {1071,628,0x452116},
  {1078,630,0x452116},
  {1091,631,0x432015},
  {1097,622,0x452116},
  点击 = {1080,590,0xe02732},
}

手动攻击 = {
  {37,597,0xf8f3e0},
  --{38,587,0xf8f3e0},
  {38,582,0xf8f3e0},
  点击 = {53,586,0x32291d},
}

一倍速 = {
  {129,605,0xf8f3e0},
  {129,607,0xf7f1df},
  {129,609,0xf6f0dd},
  点击 = {129,607,0xf7f1df},
}

阴阳寮选人参数 = {
  {c=0xa79782,str = "34|14|0xb3a28d,105|13|0xb3a28d,142|24|0x9f8e7a,140|1|0xab9b86,2|22|0xa99984,17|21|0xd3c5b4,178|-50|0xcab8a3,122|2|0xd5c8b8,17|20|0xd4c6b5"},--0
  {c=0x7a756f,str = "-10|13|0xb94131,15|5|0x7f3226,35|1|0xb3a28d,145|2|0xb3a28d,179|-60|0xcbb9a4,52|14|0xd3c4b2,88|-8|0xd5c8b8,122|11|0xd3c5b4,98|1|0xb3a28c"},	--1
  {c=0xa9a49e,str = "5|-22|0xc04e3e,41|-22|0xb8483a,71|-1|0xb3a28c,109|-16|0xb09f8a,371|2|0xae9c87,406|-17|0xb09e89,442|4|0xa49580,53|1|0xd4c6b5,18|-16|0xd5c8b8"},--2
  {c=0xbab5af,str = "71|1|0xaeaaa3,76|-24|0xaf4535,4|-24|0xac3d2f,105|-10|0xb3a28d,146|-10|0xb3a28d,180|-71|0xcab8a2,88|-17|0xd5c8b8,53|0|0xd3c5b4,18|-17|0xd5c8b8"},--3
  {c=0x9a958f,str = "107|0|0x938e88,69|0|0x9d9892,31|-15|0xa09b95,5|-23|0xaf4536,110|-23|0xb24435,140|3|0xa79681,147|-20|0x9e8f7b,182|-73|0xc8b59f,53|0|0xd4c6b5"},--4
  {c=0xa7a29c,str = "35|0|0xa7a29c,69|-1|0xa9a49d,139|0|0xb2ada6,181|-73|0xc8b59f,135|-14|0xa8a39c,18|-18|0xd5c8b8,51|3|0xd3c5b3,87|-20|0xd5c8b8,122|3|0xd3c5b3"},--5
}
function 阴阳寮选人函数(num)
point = findMultiColorInRegionFuzzyExt(阴阳寮选人参数[num].c,阴阳寮选人参数[num].str, 93, 479,119, 1022,574,1,1)
--print(point)
if #point ~= 0 then	
  local temp_table = {}
  for var = 1,#point do
    if var == 1 then
      table.insert(temp_table,point[var])
    else
      local 能插入 = true
      for varss = 1,#temp_table do
        if math.abs((point[var].x-temp_table[varss].x)) < 50 then
          能插入 = false
          break
        end
      end
      if 能插入 then
        table.insert(temp_table,point[var])
      end
    end
  end
  --print(temp_table)
  if #temp_table ~= 0 then
    local 随机点一个 = math.random(1,#temp_table)
    click(temp_table[随机点一个].x,temp_table[随机点一个].y)
    mSleep(1000)
    return true
  end
end
return false
end

探索玩法介绍 = {
  {556,430,0xd3c7c0},
  {766,410,0xd72b21},
  {932,237,0x8d7245},
  {942,147,0xe8d4cf},
  {198,559,0xac9378},
  关闭 = {937,151,0xe8d4cf},
}

探索副本解锁 = {
  {339,405,0xc1abb1},
  {817,386,0x8d7145},
  {813,463,0xac9377},
  {532,175,0x686564},
  {592,179,0x62605f},
  关闭 = {937,151,0xe8d4cf},
}

御灵界面 = {
  {81,309,0xe3daca},
  {66,361,0xe2d9c9},
  {659,100,0xffd685},
  {1068,357,0xebe0d0},
  {1097,140,0xe8d4cf},
  关闭 = {1097,140,0xe8d4cf},
}

御灵选种类界面 = {
  {230,369,0x7368a6},
  {459,354,0x4c1b22},
  {680,349,0x6f2b13},
  {941,368,0xb78734},
}

御灵挑战界面 = {
  {805,440,0xf3b25e},
  {883,441,0xf3b25e},
  {390,391,0xc7af94},
  {423,145,0xc1b9ae},
  {451,393,0xc7af95},
  挑战 = {842,440,0xf3b25e},
  关闭 = {930,108,0xe9d6d0},
}

御灵选层= {
  {391,152,0xc1b8ae},
  {399,219,0x75706a},
  {399,286,0x75706a},
  {397,350,0x504b47},
}

式神详情界面= {
  {87,318,0x484039},
  {84,285,0x4c3829},
  {81,257,0xd9d0bf},
  {1091,18,0x734921},
  {848,547,0xe5d6c8},
  {874,326,0xded1c7},
  御魂 = {1069,235,0x81746d},
}

式神详情界面170520= {
  {87,318,0x484039},
  {84,285,0x4c3829},
  {81,257,0xd9d0bf},
  {1015,20,0x2c1f1c},
  {848,547,0xe5d6c8},
  {874,326,0xded1c7},
  御魂 = {1069,235,0x81746d},
}

式神详情御魂界面 = {
  {87,318,0x484039},
  {84,285,0x4c3829},
  {81,257,0xd9d0bf},
  {1091,18,0x734921},
  {768,212,0xe96d12},
  更换 = {774,218,0xe86109},
}

式神详情御魂界面170520 = {
  {87,318,0x484039},
  {84,285,0x4c3829},
  {81,257,0xd9d0bf},
  {1015,20,0x2c1f1c},
  {768,212,0xe96d12},
  更换 = {774,218,0xe86109},
}

更换御魂界面 = {
  {571,482,0xe8ddb4},
  {987,486,0xe8ddb4},
  {988,583,0xa43846},
  {1026,583,0xa73645},
  {1092,140,0xffe3c8},
  位置 = {215,118,0x402f11},
  强化 = {611,404,0xf3b25e},
}

随便选御魂 = {
  {132,283,0xf6e5ce},
  {241,286,0xffda3d},
  {340,284,0x8a9075},
  {451,280,0xffff7c},
  {127,399,0x3b312b},
  {238,398,0xfff5e3},
  {343,400,0xd5ddd9},
  {470,395,0x4e4875},
}

御魂强化界面 = {
  {828,574,0xf3b25e},
  {944,572,0xf3b25e},
  {95,128,0x493422},
  {210,128,0x493422},
  {382,138,0x7b5638},
  第一个 = {126,222,0x0c0206},
  强化 = {891,571,0x775c38},
  排序 = {409,121,0xd3cdbc},
  由低到高 = {403,256,0x282521},
}

御魂强化成功 = {
  {720,543,0xf3b25e},
  {807,543,0xf3b25e},
  {823,234,0xdd3f3f},
  {623,524,0xdecdbc},
  {884,548,0xddccbb},
  确定 = {761,542,0xf3b25e},
}

送心位置 = {
  {397,228,0xffba00},
  {395,312,0xffba00},
  {399,391,0xe19935},
  {396,476,0xffba00},
  {397,564,0xf18a5d},
}

任务界面 = {
  {422,140,0xe4ddcd},
  {433,251,0xe4ddcd},
  {686,366,0xe4ddcd},
  {707,486,0xe4ddce},
  {1009,545,0xc1b6ad},
  任务 = {1084,197,0xbd6c22},
  完成 = {857,132,0xf3b25e},
  关闭 = {1048,65,0xe8d5cf},
}

章节判定 = {
  {c=0xf3eddb,str =	"-12|0|0x3e2311,17|-4|0xf8f3e0,34|-5|0xf8f3e0,24|3|0x3d2310,27|3|0x3d2210,49|3|0xf8f3e0,63|1|0x3e2311,9|0|0xf8f3e0,-4|-13|0xf8f3e0"},--1
  {c=0x3d2312,str = "10|2|0xeee9d6,28|6|0xf8f3e0,40|5|0xf8f3e0,39|-2|0x402411,28|-1|0x3f2311,32|-7|0xf8f3e0,3|-8|0xeee9d6,58|5|0xf8f3e0,68|0|0x402412"},--2
  {c=0xefe9d7,str = "-5|-12|0xf8f3e0,4|-12|0xf8f3e0,24|-10|0xf8f3e0,24|-3|0xf8f3e0,17|6|0xf8f3e0,31|5|0xf8f3e0,48|4|0xf8f3e0,61|0|0x3e2311,-11|-3|0x402411"},--3
  {c=0xf6f1de,str = "-5|-13|0xf8f3e0,8|0|0xf8f3e0,16|-8|0xf8f3e0,26|-9|0xf8f3e0,23|3|0xf8f3e0,31|3|0xf8f3e0,49|3|0xf8f3e0,60|-1|0x3e2311,-10|-2|0x3c2211"},--4
  {c=0xf1ebd9,str = "-5|-12|0xf8f3e0,8|1|0xf8f3e0,-11|1|0x3e2311,21|-2|0xf8f3e0,24|-9|0xf8f3e0,25|6|0xf8f3e0,32|6|0xf8f3e0,48|4|0xf8f3e0,61|1|0x3e2311"},--5
  {c=0xf3eedb,str = "7|2|0xf7f2df,-5|-13|0xf8f3e0,18|-6|0xf8f3e0,24|-9|0xf8f3e0,24|4|0x3d2210,30|3|0xf8f3e0,30|-7|0xf7f2df,48|3|0xf8f3e0,63|-3|0x402411"},--6
  {c=0xf2edda,str = "-5|-13|0xf8f3e0,8|-1|0xf8f3e0,18|-2|0xf8f3e0,23|-3|0xf8f3e0,29|5|0xf8f3e0,32|-5|0xf8f3e0,48|3|0xf8f3e0,61|0|0x3e2311,-11|0|0x3e2311"},--7
  {c=0xf0ebd8,str = "-5|-13|0xf8f3e0,8|0|0xf8f3e0,17|-2|0xf6f1de,23|1|0x3f2311,32|1|0xf8f3e0,27|-5|0xf8f3e0,48|4|0xf8f3e0,63|1|0x3e2311,13|-7|0x402411"},--8
  {c=0xf8f3e0,str = "-5|-13|0xf7f1df,7|1|0xf8f3e0,19|-6|0xf8f3e0,23|-9|0xf8f3e0,27|6|0xf8f3e0,33|6|0xf7f2df,48|2|0xf8f3e0,61|1|0x3e2311,-12|-3|0x3f2311"},--9
  {c=0xefead7,str = "-5|-12|0xf8f3e0,6|3|0xeee9d6,24|-4|0xf8f3e0,48|4|0xf8f3e0,48|-12|0xf8f3e0,56|-8|0xd6d0bf,40|-6|0xf0ebd8,24|-8|0xf8f3e0,17|-3|0xf8f3e0"},--10
  {c=0xf2edda,str = "-4|-14|0xf8f3e0,18|-5|0xf8f3e0,25|-12|0xf8f3e0,41|-5|0xf8f3e0,58|-6|0xf8f3e0,48|-13|0x402412,49|0|0x3e2311,57|4|0x3c2110,73|2|0xf8f3e0"},--11
  {c=0xf7f2df,str = "17|-2|0xf8f3e0,32|1|0x3e2311,42|-3|0x3f2311,48|-2|0x3f2412,55|-2|0x3f2411,48|-8|0xf8f3e0,48|4|0xf8f3e0,55|4|0xf8f3e0,72|4|0xf8f3e0"},--12
  {c=0xefead7,str = "17|-2|0xf8f3e0,31|1|0x3e2311,29|-8|0x362010,24|-4|0xf8f3e0,46|-10|0xf5efdd,49|-3|0xf8f3e0,41|6|0xf8f3e0,55|5|0xf8f3e0,72|4|0xf8f3e0"},--13
  {c=0xf5f0dd,str = "17|-4|0xf8f3e0,24|-9|0xf8f3e0,30|-11|0x412412,30|0|0x3e2311,40|-8|0xf8f3e0,57|-8|0xf8f3e0,54|3|0xf6f1de,73|3|0xf8f3e0,46|-9|0xf8f3e0"},--14
  {c=0xf5f0dd,str = "18|-4|0xf8f3e0,31|0|0x3e2311,49|5|0xf8f3e0,51|0|0xf8f3e0,47|-10|0xf8f3e0,41|-7|0x402411,44|0|0xf4eedc,72|3|0xf8f3e0,82|-4|0x3f2411"},--15
  {c=0xf1ecd9,str = "17|-3|0xf8f3e0,29|0|0x3f2311,24|-10|0xf8f3e0,30|-10|0x402511,48|-7|0xf8f3e0,55|-7|0xf8f3e0,54|4|0xf8f3e0,47|4|0x3d2210,72|3|0xf8f3e0"},--16
  {c=0xf6f1de,str = "18|-2|0xf7f2df,30|-9|0x412511,24|3|0xf8f3e0,31|3|0x3e2211,40|0|0xf8f3e0,47|-5|0xf8f3e0,52|6|0xf8f3e0,54|-8|0x3e2311,72|4|0xf8f3e0"},--17
  {c=0xf8f3e0,str = "17|-4|0xf8f3e0,32|-2|0x361f10,31|-10|0x3f2411,24|-10|0xf8f3e0,42|-4|0xf7f2df,46|3|0x3d2310,56|0|0xf8f3e0,51|-5|0xf8f3e0,72|2|0xf8f3e0"},--18
  {c=0xf8f3e0,str = "7|4|0xf7f2df,18|4|0xf8f3e0,27|1|0xf8f3e0,40|2|0xf8f3e0,57|0|0xf2edda,49|9|0x3d2211,44|-9|0x412512,22|9|0x3d2210,-6|0|0xf6f1de"},--番外1
  {c=0xf5f0dd,str = "17|-4|0xf8f3e0,24|-10|0xf8f3e0,19|1|0x3c2211,31|-10|0x402411,52|6|0xf8f3e0,56|6|0xf8f3e0,46|-9|0xf8f3e0,43|-5|0xf8f3e0,72|2|0xf8f3e0"},--19
  {c=0xf5efdc,str = "19|4|0xf8f3e0,25|-2|0x3f2412,25|-9|0xf8f3e0,42|-3|0xf8f3e0,55|0|0x3e2311,55|-10|0x412511,73|3|0xf8f3e0,82|-1|0x3f2411,73|-12|0xf8f3e0"},--20
  {c=0xeee9d6,str = "20|4|0xf8f3e0,26|-3|0x3f2312,26|-9|0xf8f3e0,49|-4|0xf8f3e0,65|-3|0xf8f3e0,67|6|0x3d2110,76|-11|0x402512,96|3|0xf8f3e0,106|-1|0x3f2311"},--21
  {c=0xf0ebd9,str = "17|4|0xf8f3e0,22|-3|0x3f2411,26|-9|0xf8f3e0,48|-4|0xf8f3e0,67|4|0xf8f3e0,73|-3|0x3f2411,75|-4|0x3e2411,97|3|0xf5efdc,105|-1|0x3f2311"},--22
  {c=0xf5efdc,str = "19|4|0xf8f3e0,28|-3|0x3f2311,27|-9|0xf8f3e0,49|-3|0xf8f3e0,66|6|0xf8f3e0,75|-3|0xf7f2df,73|-10|0xf8f3e0,81|-3|0x402411,97|3|0xf8f3e0"},--23
}

function 章节选择(num)
local x = -1
local y=-1
if 章节判定[num].c == 0 then
  return false
end
keepScreen(true)
x, y = findMultiColorInRegionFuzzy(章节判定[num].c,章节判定[num].str,90,980,127, 1099,554,1,1)
--x, y = findMultiColorInRegionFuzzy(章节判定[num].c,章节判定[num].str,90,640,127, 909,517,1,1)
if x > -1 then
  keepScreen(false)
  sysLog(num.."识别"..x..":"..y)
  --click(x,y)
  return x,y
end
keepScreen(false)
return x,y
end

选择区域 = {
  {212,116,0x06182e},
  {318,116,0x0e1f36},
  {386,72,0x704729},
  {718,56,0x5e3b1f},
  {840,105,0x0e1f34},
  点击= {82,229,0x190e0e},
}

阴阳寮对手位置 = {
  {579,160,0xd5c8b8},
  {890,159,0xd5c8b8},
  {582,282,0xd5c8b8},
  {885,276,0xd5c8b8},
  {580,401,0xd5c8b8},
  {884,401,0xd5c8b8},
  {581,519,0xd5c8b8},
  {886,520,0xd5c8b8},
}

勋章判定数组 = {
  {
    {
      {669,181,0xb3a28d},			{665,181,0xb3a28d},			{672,181,0xb3a28d},			{668,177,0xb3a28d},			{668,185,0xb3a28d},
    },
    {
      {633,181,0xb3a28d},			{633,173,0xb3a28d},			{633,185,0xb3a28d},			{627,180,0xb3a28d},			{638,180,0xb3a28d},
    },
    {
      {598,180,0xb3a28d},			{598,174,0xb3a28d},			{598,185,0xb3a28d},			{592,180,0xb3a28d},			{605,180,0xb3a28d},
    },
    {
      {562,180,0xb3a28d},			{562,174,0xb3a28d},			{562,184,0xb3a28d},			{560,179,0xb3a28d},			{567,179,0xb3a28d},
    },
    {
      {528,179,0xb3a28d},		{528,173,0xb3a28d},		{528,185,0xb3a28d},		{533,180,0xb3a28d},		{523,180,0xb3a28d},
    },
    失败 = {701,117,0xccbca7},
  },--1
  {
    {
      {969,180,0xb3a28d},			{969,175,0xb3a28d},			{969,183,0xb3a28c},			{964,179,0xb3a28d},			{973,179,0xb3a28d},
    },
    {
      {935,180,0xb3a28d},			{940,175,0xb3a28d},			{930,183,0xb3a28c},			{935,179,0xb3a28d},			{935,179,0xb3a28d},
    },
    {
      {898,180,0xb3a28d},			{900,175,0xb3a28d},			{893,183,0xb3a28c},			{898,179,0xb3a28d},			{898,179,0xb3a28d},
    },
    {
      {864,180,0xb3a28d},			{869,175,0xb3a28d},			{860,183,0xb3a28c},			{864,179,0xb3a28d},			{864,179,0xb3a28d},
    },
    {
      {828,180,0xb3a28d},			{833,175,0xb3a28d},			{823,183,0xb3a28c},			{828,179,0xb3a28d},			{828,179,0xb3a28d},
    },
    失败 = {1001,116,0xccbba7},
  },--2
  {
    {
      {670,301,0xb3a28d},			{670,296,0xb3a28d},			{670,305,0xb3a28c},			{664,300,0xb3a28d},			{675,300,0xb3a28d},
    },
    {
      {634,301,0xb3a28d},			{639,296,0xb3a28d},			{630,305,0xb3a28c},			{634,300,0xb3a28d},			{634,300,0xb3a28d},
    },
    {
      {597,301,0xb3a28d},			{602,296,0xb3a28d},			{592,305,0xb3a28c},			{597,300,0xb3a28d},			{597,300,0xb3a28d},
    },
    {
      {565,301,0xb3a28d},			{569,296,0xb3a28d},			{560,305,0xb3a28c},			{565,300,0xb3a28d},			{565,300,0xb3a28d},
    },
    {
      {526,301,0xb3a28d},			{530,296,0xb3a28d},			{521,305,0xb3a28c},			{526,300,0xb3a28d},			{526,300,0xb3a28d},
    },
    失败 = {700,241,0xcebeab},
  },--3
  {
    {
      {970,300,0xb3a28d},			{970,295,0xb3a28d},			{970,304,0xb3a28c},			{967,300,0xb3a28d},			{974,300,0xb3a28d},
    },
    {
      {933,300,0xb3a28d},			{930,295,0xb3a28d},			{936,304,0xb3a28c},			{933,300,0xb3a28d},			{933,300,0xb3a28d},
    },
    {
      {899,300,0xb3a28d},			{902,295,0xb3a28d},			{896,304,0xb3a28c},			{899,300,0xb3a28d},			{899,300,0xb3a28d},
    },
    {
      {864,300,0xb3a28d},			{867,295,0xb3a28d},			{861,304,0xb3a28c},			{864,300,0xb3a28d},			{864,300,0xb3a28d},
    },
    {
      {828,300,0xb3a28d},			{831,295,0xb3a28d},			{825,304,0xb3a28c},			{828,300,0xb3a28d},			{828,300,0xb3a28d},
    },
    失败 = {1004,245,0xcfbeaa},
  },--4
  {
    {
      {670,422,0xb3a28d},			{670,419,0xb3a28d},			{670,425,0xb3a28c},			{667,422,0xb3a28d},			{673,422,0xb3a28d},
    },
    {
      {634,422,0xb3a28d},			{634,419,0xb3a28d},			{634,425,0xb3a28c},			{634,422,0xb3a28d},			{634,422,0xb3a28d},
    },
    {
      {600,422,0xb3a28d},			{600,419,0xb3a28d},			{600,425,0xb3a28c},			{600,422,0xb3a28d},			{600,422,0xb3a28d},
    },
    {
      {563,422,0xb3a28d},			{563,419,0xb3a28d},			{563,425,0xb3a28c},			{563,422,0xb3a28d},			{563,422,0xb3a28d},
    },
    {
      {529,422,0xb3a28d},			{529,419,0xb3a28d},			{529,425,0xb3a28c},			{529,422,0xb3a28d},			{529,422,0xb3a28d},
    },
    失败 = {702,364,0xcfbfab},
  },--5
  {
    {
      {970,420,0xb3a28d},			{970,416,0xb3a28d},			{970,423,0xb3a28c},
    },
    {
      {935,420,0xb3a28d},			{935,416,0xb3a28d},			{935,423,0xb3a28c},
    },
    {
      {899,420,0xb3a28d},			{899,416,0xb3a28d},			{899,423,0xb3a28c},
    },
    {
      {865,420,0xb3a28d},			{865,416,0xb3a28d},			{865,423,0xb3a28c},
    },
    {
      {833,420,0xb3a28d},			{833,416,0xb3a28d},			{833,423,0xb3a28c},
    },
    失败 = {1002,366,0xcfc0ad},
  },--6
  {
    {
      {669,541,0xb3a28d},		{669,537,0xb3a28d},		{669,545,0xb3a28c},
    },
    {
      {632,541,0xb3a28d},		{632,537,0xb3a28d},		{632,545,0xb3a28c},
    },
    {
      {598,541,0xb3a28d},		{598,537,0xb3a28d},		{598,545,0xb3a28c},
    },
    {
      {564,541,0xb3a28d},		{564,537,0xb3a28d},		{564,545,0xb3a28c},
    },
    {
      {529,541,0xb3a28d},		{529,537,0xb3a28d},		{529,545,0xb3a28c},
    },
    失败 = {699,480,0xcebeaa},
  },--7
  {	
    {
      {970,541,0xb3a28d},			{970,537,0xb3a28d},			{970,545,0xb3a28c},
    },
    {
      {935,541,0xb3a28d},			{935,537,0xb3a28d},			{935,545,0xb3a28c},
    },
    {
      {900,541,0xb3a28d},			{900,537,0xb3a28d},			{900,545,0xb3a28c},
    },
    {
      {864,541,0xb3a28d},			{864,537,0xb3a28d},			{864,545,0xb3a28c},
    },
    {
      {829,541,0xb3a28d},			{829,537,0xb3a28d},			{829,545,0xb3a28c},
    },
    失败 = {1003,481,0xcdbda9},
  },--8
}

战斗回放界面 ={
  {851,187,0xdfcdb3},
  {860,331,0xdfcdb3},
  {866,459,0xdfcdb3},
  {1053,454,0x5c3c27},
  {1050,329,0x5f3d29},
  {907,49,0x493625},
  关闭 = {1023,63,0xe8d4cf},
}

评论界面 = {
  {906,559,0xf3b25e},
  {1002,558,0xf3b25e},
  {561,555,0xe3dcd4},
  {941,115,0xcbb59c},
  {916,252,0xe67b16},
  关闭 = {1033,66,0xe8d4cf},
}

更换式神界面日服 = {
  {985,591,0xeace9b},
  {1085,589,0xf1daac},
  {1029,539,0xffffbb},
  {1093,619,0x45465e},
  {26,38,0xd6c4a1},
}


观战界面1 = {
  {991,595,0xefd7a8},
  {1033,579,0xd9ac70},
  {1031,545,0xffffbf},
  {1117,595,0x4c4766},
  {38,601,0x514a6a},
  {74,607,0x2d3f32},
}

好友界面1 = {
  {258,102,0xedcc8a},
  {735,353,0xfff97d},
  {736,329,0xffff98},
  {743,457,0x96442b},
  {1073,514,0x5e3c2b},
}

确认强化界面 = {
  {415,380,0xf3b25e},
  {491,381,0xf3b25e},
  {637,371,0xf3b25e},
  {712,378,0xf3b25e},
  {564,377,0xcbb59c},
  确认 = {674,372,0x443829},
}

教学任务界面 = {
  {192,247,0x8d7245},
  {206,123,0x5e3c23},
  {847,117,0x3a2920},
  {940,246,0x8d7245},
  {927,571,0xa99179},
  关闭 = {941,160,0xe8d4cf},
}

战斗胜利日服 = {
  {439,135,0xa71b11},
  {481,133,0xa11b11},
  {451,101,0x7d1910},
  {543,135,0xbe9a63},
  {640,131,0xb9945c},
  {755,117,0xe9ddb2},
  点击 = {551,488,0x2e4747},
}

新战斗胜利日服 = {
  {435,186,0xa51b11},
  {478,182,0xa31b11},
  {456,148,0x841d13},
  {536,177,0xa38a5a},
  {640,156,0xd4bb82},
  {756,164,0xebe1b9},
  点击 = {551,488,0x2e4747},
}

登陆后活动界面日服 = {
  {72,21,0xc9b399},
  {244,27,0xc9b399},
  {367,17,0xbfa991},
  {1060,22,0xc9b399},
  {924,39,0x000000},
  返回 = {1061,41,0xcb9749},
}

实名认证界面 = {
  {429,408,0xdf6851},
  {508,413,0xdf6851},
  {552,419,0xcbb59c},
  {645,429,0xf3b25e},
  {691,395,0xf3b25e},
  取消 = {470,410,0xdf6851},
}

更换式神界面出御魂 = {
  {699,110,0x974646},
  {697,165,0x996828},
  {702,209,0x4c7236},
  {685,255,0xe3ddd8},
  {682,295,0xe3ddd8},
  关闭 = {1043,72,0xe8d4cf},
}

羁绊提升界面= {
  {375,124,0x6c422b},
  {725,98,0x6b4522},
  {685,114,0xebc977},
  {588,113,0xeccb89},
  {486,128,0xd29e4c},
  关闭 = {1043,72,0xe8d4cf},
}

用户设置界面日服 = {
  {680,510,0xf3b25e},
  {819,487,0xf3b25e},
  {815,512,0xf3b25e},
  {601,501,0xc7bdb4},
  {446,498,0xc7bdb4},
}

战斗失败日服 = {
  {429,117,0x5e5468},
  {472,126,0x5b5265},
  {439,91,0x4e4657},
  {549,182,0xb9b087},
  {635,112,0xd2cec2},
  {718,145,0xa7a093},
}

新战斗失败日服 = {
  {432,176,0x62596e},
  {472,174,0x5e5468},
  {440,142,0x504859},
  {538,220,0x9d8c63},
  {630,164,0xc9c4b7},
  {728,198,0x8c8477},
}

挂机御魂邀请界面日服 = {
  {443,494,0xdf6851},
  {510,512,0xdf6851},
  {563,513,0xcbb59c},
  {634,513,0xf3b25e},
  {732,506,0xf3b25e},
  {343,103,0x9f876d},
  {730,108,0x9f876d},
}

第二回合日服 = {
  {486,337,0x272420},
  {525,334,0x272420},
  {568,327,0x272420},
  {621,330,0x272420},
  {642,333,0x272420},
  {517,320,0xdcc097},
}

function 战斗结束后点开了人()
x, y = findMultiColorInRegionFuzzy(0xf3b25e,"-2|-70|0xf3b25e,124|-74|0xf3b25e,287|2|0xf3b25e,292|-70|0xf3b25e,146|-33|0xcbb59c,165|-5|0xf3b25e,255|-132|0xcbb59c", 95, 0, 0, 1135, 639)
if x > -1 then		
  return true
end
return false
end

function 御魂强化界面找强化()
keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xf3b25e,"-84|3|0xf3b25e,51|2|0xf3b25e,128|6|0xf3b25e,24|-6|0xcbb59c,-107|7|0xcab49b", 90,504,182, 836,604)
keepScreen(false)
if x > -1 then		
  sysLog("御魂强化界面找强化")
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

麒麟鬼王地图界面 = {
  {44,53,0xc2cbe0},
  {1035,483,0x351c0d},
  {1061,485,0x341b0e},
  {1079,483,0x351c0d},
  {1076,516,0x2a140b},
  挑战 = {1072,488,0x331b0e},
}

麒麟鬼王地图界面1 = {
  {1036,152,0x341c0e},
  {1067,152,0x341d0d},
  {1112,151,0x351d0e},
  {56,52,0xa9b7d5},
  {1122,110,0x402512},
  挑战 = {1042,154,0x341c0e},
}

麒麟鬼王挑战界面 = {
  {603,556,0xc7bdb4},
  {856,565,0xb72f39},
  {836,564,0xc72732},
  {856,552,0xd82d3b},
  {993,550,0xc7bdb4},
  挑战 = {283,553,0xf3b25e},
}

阴界之门挑战界面 = {
  {570,555,0xc7bdb4},
  {358,251,0x170b2a},
  {266,95,0x741b39},
  {256,316,0x261542},
  {931,554,0xc7bdb4},
  挑战 = {304,551,0xf3b25e},
}

if ver == "iOS" then 
  
else
  判断卷是0 = 判断卷是0模拟器
end

个人突破失败判定用 = {--失败或者打过了都用这个
  {388,105,0xd0c1ae},
  {703,106,0xccbaa6},
  {1006,99,0xccbaa6},
  {388,223,0xd0c0ad},
  {695,220,0xcebeaa},
  {1004,218,0xccbba6},
  {390,341,0xcebeaa},
  {696,341,0xcebeaa},
  {1001,343,0xcfbfac},
}

个人突破判定打完用 = {
  {197,174,0x69625a},
  {497,172,0x69625a},
  {804,174,0x69625a},
  {194,288,0x69625a},
  {501,292,0x69625a},
  {803,286,0x69625a},
  {195,409,0x69625a},
  {499,406,0x69625a},
  {805,407,0x69625a},
}

个人突破勋章判定用 = {
  {
    {
      {218,161,0xb3a28d},			{223,161,0xb3a28d},			{215,160,0xb3a28d},
    },
    {
      {252,160,0xb3a28d},			{256,161,0xb3a28d},			{249,160,0xb3a28d},
    },
    {
      {289,161,0xb3a28d},			{292,161,0xb3a28d},			{286,161,0xb3a28d},
    },
    {
      {323,160,0xb3a28d},		{327,160,0xb3a28d},		{318,160,0xb3a28d},
    },
    {
      {359,160,0xb3a28d},		{356,160,0xb3a28d},		{361,160,0xb3a28d},
    },
    失败 = {387,103,0xd0c1ae},
  },--1
  {
    {
      {522,160,0xb3a28d},			{519,160,0xb3a28d},			{524,160,0xb3a28d},
    },
    {
      {559,159,0xb3a28d},			{554,160,0xb3a28d},			{564,160,0xb3a28d},
    },
    {
      {595,159,0xb3a28d},			{591,159,0xb3a28d},			{602,159,0xb1a18b},
    },
    {
      {629,160,0xb3a28d},	{625,160,0xb3a28d},	{636,160,0xb3a18c},
    },
    {
      {666,160,0xb4a18c},	{659,160,0xb3a28c},	{669,161,0xb4a18c},
    },
    失败 = {703,106,0xccbaa6},
  },--2
  {
    {
      {830,160,0xb3a28d},			{825,160,0xb3a28d},			{833,161,0xb3a28d},
    },
    {
      {864,160,0xb3a28d},	{859,161,0xb3a28d},	{870,159,0xb3a28d},
    },
    {
      {900,159,0xb3a28d},	{897,159,0xb3a28d},	{904,159,0xb3a28d},
    },
    {
      {936,159,0xb3a28d},	{932,159,0xb3a28d},	{939,159,0xb3a28d},
    },
    {
      {970,159,0xb3a28d},	{966,159,0xb3a28d},	{974,160,0xb3a28d},
    },
    失败 = {1006,99,0xccbaa6},
  },--3
  {
    {
      {218,280,0xb3a28d},			{223,280,0xb3a28d},			{215,280,0xb3a28d},
    },
    {
      {252,280,0xb3a28d},			{256,280,0xb3a28d},			{249,280,0xb3a28d},
    },
    {
      {289,280,0xb3a28d},			{292,280,0xb3a28d},			{286,280,0xb3a28d},
    },
    {
      {323,280,0xb3a28d},		{327,280,0xb3a28d},		{318,280,0xb3a28d},
    },
    {
      {359,280,0xb3a28d},		{356,280,0xb3a28d},		{361,280,0xb3a28d},
    },
    失败 = {388,223,0xd0c0ad},
  },--4
  {
    {
      {523,281,0xb3a28d},	{517,281,0xb3a28d},	{526,281,0xb3a28d},
    },
    {
      {558,280,0xb3a28d},	{553,280,0xb3a28d},	{564,280,0xb3a28d},
    },
    {
      {595,279,0xb3a28d},	{589,279,0xb3a28d},	{601,279,0xb3a28d},
    },
    {
      {628,279,0xb3a28d},	{622,279,0xb3a28d},	{635,280,0xb3a28d},
    },
    {
      {664,280,0xb3a28d},	{659,280,0xb3a28d},	{674,282,0xb3a28d},
    },
    失败 = {695,220,0xcebeaa},
  },--5
  {
    {
      {830,280,0xb3a28d},			{825,280,0xb3a28d},			{833,280,0xb3a28d},
    },
    {
      {864,280,0xb3a28d},	{859,280,0xb3a28d},	{870,280,0xb3a28d},
    },
    {
      {900,280,0xb3a28d},	{897,280,0xb3a28d},	{904,280,0xb3a28d},
    },
    {
      {936,280,0xb3a28d},	{932,280,0xb3a28d},	{939,280,0xb3a28d},
    },
    {
      {970,280,0xb3a28d},	{966,280,0xb3a28d},	{974,280,0xb3a28d},
    },
    失败 = {1004,218,0xccbba6},
  },--6
  {
    {
      {218,400,0xb3a28d},			{223,400,0xb3a28d},			{215,400,0xb3a28d},
    },
    {
      {252,400,0xb3a28d},			{256,400,0xb3a28d},			{249,400,0xb3a28d},
    },
    {
      {289,400,0xb3a28d},			{292,400,0xb3a28d},			{286,400,0xb3a28d},
    },
    {
      {323,400,0xb3a28d},		{327,400,0xb3a28d},		{318,400,0xb3a28d},
    },
    {
      {359,400,0xb3a28d},		{356,400,0xb3a28d},		{361,400,0xb3a28d},
    },
    失败 = {390,343,0xcfbfac},
  },--7
  {
    {
      {522,400,0xb3a28d},			{519,400,0xb3a28d},			{524,400,0xb3a28d},
    },
    {
      {559,400,0xb3a28d},			{554,400,0xb3a28d},			{564,400,0xb3a28d},
    },
    {
      {595,400,0xb3a28d},			{591,400,0xb3a28d},			{602,400,0xb1a18b},
    },
    {
      {629,400,0xb3a28d},	{625,400,0xb3a28d},	{636,400,0xb3a18c},
    },
    {
      {666,400,0xb4a18c},	{659,400,0xb3a28c},	{669,400,0xb4a18c},
    },
    失败 = {696,341,0xcebeaa},
  },--8
  {
    {
      {830,400,0xb3a28d},			{825,400,0xb3a28d},			{833,400,0xb3a28d},
    },
    {
      {864,400,0xb3a28d},	{859,400,0xb3a28d},	{870,400,0xb3a28d},
    },
    {
      {900,400,0xb3a28d},	{897,400,0xb3a28d},	{904,400,0xb3a28d},
    },
    {
      {936,400,0xb3a28d},	{932,400,0xb3a28d},	{939,400,0xb3a28d},
    },
    {
      {970,400,0xb3a28d},	{966,400,0xb3a28d},	{974,400,0xb3a28d},
    },
    失败 = {1001,343,0xcfbfac},
  },--9
}

邮件有体力附件 = {
  {512,475,0x0c0d0a},
  {507,467,0x070806},
  {504,484,0x5e4664},
  {527,456,0xff7e2c},
  {539,448,0x5f4665},
}



商店街 = {
  {233,590,0x807a6c},
  {406,573,0x7e5833},
  {551,589,0xb4b252},
  {665,593,0x2a5792},
  {991,594,0x932929},
  退出 = {42,59,0xf0f5fb}
}


实名认证 = {
  {519,504,0x6a0405},
  {535,466,0x7f0711},
  {551,162,0x850807},
  {452,116,0x8d0907},
  点击 = {534,482,0x76060c},
}

确认实名 = {
  {501,492,0xf3b25e},
  {562,467,0xf3b25e},
  {639,489,0xf3b15e},
  {758,478,0xcbb59c},
  点击 = {146,395,0x4e3636},
}

土蜘蛛界面 = {
  {568,526,0x76180e},
  {996,521,0xf3dab0},
  {1015,556,0x6c1b1a},
  {1021,444,0xe0d3c1},
  --{453,88,0xc8a255},
  关闭 = {1011,78,0xe9d0cd},
  挑战 = {1001,478,0xefd4a6},
}

庭院更换站街式神 = {
  {647,561,0xf3b25e},
  {777,563,0xf3b25e},
  {709,562,0xf3b25e},
  {1063,83,0xe8d4cf},
  关闭 = {1063,83,0xe8d4cf},
}

组队邀请判定是否是副本 = {
  {377,241,0xebdfd0},
  {379,241,0xe8dbca},
  {381,241,0xe8dbc9},
  {383,241,0xe6d9c5},
  {385,241,0xe7dbc8},
  {381,243,0xe9decd},
  {381,245,0xede4d6},
  {381,235,0xebe0d1},
}

输入法界面 = {
  {953,602,0x007aff},
  {1107,605,0x007aff},
  {978,591,0x007aff},
  {1078,601,0x007aff},
  {1014,523,0xa7a8af},
  点一下 = {821,182,0xc7bdb4}
}

阴阳寮击破判定点 = {
  {188,147,0x5f2514},
  {185,313,0x5f2413},
  {187,478,0x5e2414},
}

function 找到组队队友()
keepScreen(true)
for i=1,#组队判定头像1的表 do
  --sysLog(i.."-----------------")
  --sysLog(组队判定头像1的表[i].c)
  --sysLog(组队判定头像1的表[i].str)
  x, y = findMultiColorInRegionFuzzy(组队判定头像1的表[i].c,组队判定头像1的表[i].str, 85,309,143,818,496)
  if x > -1 then		
    sysLog("找到组队队友"..i)
    click(random_click(x+100,y))
    mSleep(1000)
    if (功能 == 4 and 御魂开组几人==3) or (功能 == 3 and 觉醒开组几人==3) or (功能 == 6 and 组队突破几人==3) then
      for j=1,#组队判定头像2的表 do
        x1, y1 = findMultiColorInRegionFuzzy(组队判定头像2的表[j].c,组队判定头像2的表[j].str, 85,309,143,818,496)
        if x1 > -1 then	
          click(random_click(x1+100,y1))
          mSleep(1000)
          keepScreen(false)
          return true
        end
      end
      keepScreen(false)
      return false
    end
    keepScreen(false)
    return true
  end
end
keepScreen(false)
return false
end