 主界面 = {
	{1221,32,0xd5c4a2},
	{1219,48,0xd5c4a2},
	{1295,45,0xd5c4a2},
	{1259,643,0xd9c9c0},
	{1234,684,0xdacac2},
	探索 = {603,124,0x27190b},
	打开菜单 = {1255,666,0x45080d},
	组队 = {250,652,0xd4ccbb},
	邮件 = {1218,41,0xc5b591},
}

 主界面1 = {
	{1306,682,0xdacac2},
	{1021,629,0xc03333},
	{672,646,0xc4bcb4},
	{380,654,0xa12c2c},
	{252,651,0xd4ccbb},
}
 
 主界面没打开卷轴 = {
	{1239,705,0xd3b07f},
	{1248,679,0xd9c7c2},
	{1271,638,0xe0d0cb},
	{1293,619,0xdeb673},
}

主界面打开卷轴 = {
	{1309,726,0x9e403d},
	{1303,707,0xd7b481},
	{1303,673,0xdbcac5},
	{1307,611,0xcca772},
	{564,686,0xda6b29},
}

 邮件界面 = {
	{112,657,0xf2d5a3},
	{126,678,0xe1b36c},
	{141,659,0xf2d5a3},
	{158,679,0x291a19},
	{92,684,0x241616},
  未读 = {229,199,0xca5d4b},
  收取 = {876,637,0xf3b25e},
  关闭 = {1227,82,0xe9d7d1},
}

  退出战斗 = {
	{419,376,0xf4b25f},
	{497,378,0xf4b25f},
	{630,374,0xf4b25f},
	{713,375,0xf4b25f},
	取消 = {452,376,0xf4b25f},
}

 推图中 = {
	{34,57,0xeef6fe},
	{38,52,0xeef6fe},
	{39,63,0xedf5fd},
	{1018,19,0xd5c4a2},
	{1082,32,0xd5c4a2},
  锁定式神 = {887,570,0x4b5ee9},
	右边 = {842,492,0xc7bdb4},
	左边 = {288,448,0x944487},
	退出 = {44,62,0x616569},
	确认退出 = {690,358,0xf4b25f},
 }

退出探索 = {
	{404,359,0xf4b25f},
	{482,354,0xf4b25f},
	{636,365,0xf4b25f},
	{736,358,0xf4b25f},
	确认退出 = {690,358,0xf4b25f},
}

剧情中 = {
	{36,27,0xd5c4a2},
	{46,34,0xd5c4a2},
	{32,45,0xd5c4a2},
	{95,42,0xd4c3a1},
	{106,40,0xd5c4a3},
}

战斗结束领奖 = {
	{631,266,0xbc4e25},
	{681,263,0xbd4523},
	{629,391,0xbb461a},
	{709,399,0xb9431b},
	{655,339,0xe6e0cd},
	点击 = {649,379,0x9a1f11},
}

领奖结束 = {
	{640,535,0xbc4f26},
	{709,547,0xbb3c1a},
	{668,586,0x000000},
	{595,622,0x670a0c},
	{782,539,0xd19118},
	点击 = {655,567,0x6c1915},
}

战斗胜利 = {
	{856,158,0xf4edce},
	{851,188,0xd9c392},
	{953,174,0xe3d1a6},
	{953,213,0xa58857},
	{530,213,0xa21b11},
	点击 = {856,158,0xf4edce},
}

战斗失败 = {
	{879,188,0xd3cec1},
	{962,191,0xa49b8c},
	{764,177,0xc0baac},
	{642,274,0xbeb588},
	{537,205,0x61586d},
}

发现妖怪 = {
}

副本大地图 = {
}

副本选图 = {
}

副本探索界面 = {
}

获得奖励提示 = {
	{546,240,0xe0d08e},
	{598,235,0xf6e6b8},
	{703,250,0xead9a0},
	{779,230,0xf4ebbb},
	{889,310,0xc2a991},
	{951,405,0x8a693f},
	点击 = {896,592,0x3b3836},
}

战斗准备 = {
	{1137,722,0xeacf9c},
	{1237,709,0xe6c790},
	{1291,717,0xe7c993},
	{1229,673,0x413a34},
	{1256,647,0xebc87f},
	点击 = {1214,586,0xe8ceb8},
}

跳过对话 = {
	{762,479,0x56aef3},
	{762,474,0x4945e0},
	{762,487,0x3a33dc},
	{754,487,0x4a3add},
	点击 = {762,479,0x56aef3},
}

快进 = {
	{986,73,0x7a59ec},
	{1002,95,0x5959e1},
	{1011,67,0x4f47c7},
	{980,77,0x6443de},
	点击 = {1014,79,0x456485},
}

提示框 = {
	{498,448,0xdd6951},
	{605,444,0xdd6951},
	{725,450,0xf4b25f},
	{833,443,0xf4b25f},
	取消 = {545,444,0xda6850},
	确定 = {786,443,0xf4b25f},
}

觉醒选择界面 = {
	{162,192,0xbf787c},
	{490,208,0xe8f4e0},
	{913,262,0xe9e7e5},
	{1058,197,0x13c3f9},
	点击 = {1108,312,0xffe3b9},
}

觉醒挑战界面 = {
	{533,479,0xf4b25f},
	{615,478,0xf4b25f},
	{718,473,0xfc842b},
	{809,472,0xf4b25f},
	{879,475,0xf4b25f},
	组队 = {574,483,0xf4b25f},
	挑战 = {845,478,0xf4b25f},
	拖到前4层 = {360,174,358,379},
	拖到后4层 = {358,379,360,174},
	拖动 = {366,276,361,164},
	拖动1 = {361,164,366,276},
}

觉醒选择第几层 = {
	{354,180,0x34312e},
	{360,245,0x75706a},
	{358,312,0x75706a},
	{357,377,0x45423e},
}

战斗中 = {
	{14,654,0x5b537b},
	{1309,92,0x3d2a1a},
	{1306,61,0x302114},
	{1328,64,0xf1b547},
	自动战斗 = {64,693,0x51432f},
}

组队界面有左边 = {
	{95,233,0x8d7245},
	{73,142,0xe5cb70},
	{94,267,0xe7ce98},
	{85,286,0x751a1c},
	{1238,227,0x8d7245},
	{1239,263,0xf1deab},
	{405,256,0x775742},
	{405,317,0x775742},
}

组队界面 = {
	{95,233,0x8d7245},
	{73,142,0xe5cb70},
	{94,267,0xe7ce98},
	{85,286,0x751a1c},
	{1238,227,0x8d7245},
	{1239,263,0xf1deab},
	{407,301,0xc7bdb4},
	{405,371,0xc7bdb4},
	刷新 = {794,651,0x705736},
	创建 = {1088,652,0xf3b25e},
	加入 = {1107,207,0x784c2c},
	拖动 = {265,623,258,198},
	妖力封印 = {264,605,0xfdd881},
	石距 = {260,486,0xe8d6c1},
	点一下 = {447,655,0xc7bdb4},
	关闭= {1245,133,0xe8d7d1},
}

组队详情= {
	{243,628,0xdf6851},
	{383,627,0xdf6851},
	{863,626,0xfe9d3d},
	{851,636,0x0d0f0b},
	离开队伍 = {308,627,0xdf6851},
	开始战斗 = {1089,627,0xf3b25e},
	开组2人 = {467,263,0x777777},
	开组3人 = {779,260,0x777777},
}

创建队伍 = {
	{371,599,0xdf6851},
	{471,605,0xdf6851},
	{694,591,0xcbb59c},
	{872,598,0xf3b25e},
	{959,602,0xf3b25e},
  创建 = {919,594,0x7e5d31},
  取消 =  {417,591,0xdf6851},
  买体力 = {972,100,0xd6c4a1},
}

邀请队友 = {
	{403,508,0xdd6951},
	{487,504,0xdd6951},
	{649,511,0xf4b25f},
	{727,512,0xf4b25f},
	取消 = {448,508,0xdd6951},
}

进入队伍 = {
	{1105,217,0xdabc66},
	{1106,328,0x6e4425},
	{1107,436,0x67361e},
	{1106,542,0x6b3b22},
}

聊天界面 = {
	{28,713,0xec915f},
	{81,718,0xec915f},
	{388,708,0xfaf2ea},
	{449,712,0xf4b25f},
	{535,719,0xf4b25f},
	关闭 = {555,35,0xf8a8b5},
}
被顶号了 = {
	{529,359,0xf4b25f},
	{604,353,0xf4b25f},
	{686,358,0xccb49b},
	{460,363,0xccb49b},
	{589,318,0xccb49b},
	点击 = {571,361,0xf4b25f},
}

登陆界面 = {
	{573,526,0xffffff},
	{587,521,0xffffff},
	{583,354,0xffffff},
	{538,213,0xffffff},
	{563,141,0xffffff},
	点击= {575,524,0xfffff7},
}

点击进入游戏 = {
	{730,562,0x282f88},
	{409,575,0x11198d},
	{579,322,0x101062},
	{589,231,0x0e0e50},
	{576,201,0x0e0e48},
	点击= {649,537,0x443c4b},
}

登陆后活动界面 = {
	{73,83,0xc8c8c8},
	{45,87,0xc5c5c5},
	{48,44,0xd9d9d9},
	{70,49,0xd8d8d8},
	返回 = {83,88,0xcccccc},
	拖动 = {809,367,201,341},
	探索 = {450,116,0xffffbd},
}

登陆后活动界面1 = {
	{73,83,0xe8ebed},
	{45,87,0xe8ebed},
	{48,44,0xe8ebed},
	{70,49,0xe8ebed},
	}
	function 个人攻击()
return false
end
function 准备时识别满字()
return false
end
function 更换时识别满字()
return false
end
function 判断白达摩()
return false
end
function 判断红达摩()
return false
end
function 判断黑达摩()
return false
end
function 判断N卡()
return false
end

function 选择阴阳寮对手()
	return false
end
function 判断击破()
	return false
end
function 阴阳寮攻击()
	return false
end

function 地图找宝箱()
	return false
end

function 找关闭按钮()
--keepScreen(true)
x, y = findMultiColorInRegionFuzzy(0xe8d4cf,"11|-9|0xe8d1cd,1|-20|0x6b313b,-21|2|0x723539,21|0|0x682c41,1|16|0x753743", 93, 0, 0, 1333, 749)
--keepScreen(false)
--sysLog("找关闭按钮"..x..":"..y)
if x > -1 then
  sysLog("找关闭按钮"..x..":"..y)
  click(random_click(x,y))
  mSleep(500)
  return true
end
return false
end

function 找小怪()
	return false
end

function 找boss()
	return false
end


function 找经验怪()
	return false
end

function 副本结束领奖()
		return false
end

function 找剧情对话()
	return false
end

function 大眼睛()
	return false
end

function 问号()
	return false
end

function 判断选哪个队伍(y)
	if y < 278 then
		click(random_click(进入队伍[1][1],进入队伍[1][2]))
	elseif y < 380 then
		click(random_click(进入队伍[2][1],进入队伍[2][2]))
	elseif y < 486 then
		click(random_click(进入队伍[3][1],进入队伍[3][2]))
	else
		click(进入队伍[4][1],进入队伍[4][2])
	end
end

识别参数750 = {
{c=0x33302b,str = "-13|5|0xddb97c,14|5|0x34302c,18|10|0x312e29,44|12|0x292622,44|-6|0x282521,53|0|0xdfcdb3,22|3|0xdeb97d,56|3|0xdfcdb3"},--椒图
{c=0x413d38,str = "-16|8|0xddbc86,13|14|0x302d28,22|1|0x292622,38|14|0x2e2b26,65|-4|0x282521,57|0|0x55524a,68|14|0x312e29,79|3|0xdfcdb3,32|4|0x5f5b53"},--鬼使黑
{c=0x2d2a25,str = "0|-7|0x57544c,0|-18|0x5e5a52,6|-13|0x2b2823,-24|-7|0xdab272,25|-5|0x272420,30|-2|0x2a2723,35|-13|0x4a4740,47|-9|0xdfcdb3,24|-18|0x312e2a"},--骨女
{c=0x34312c,str = "-7|7|0xdfcdb3,-15|14|0x292622,-22|8|0xdbb273,23|7|0xd9af6e,31|4|0x272420,17|4|0x292622,55|5|0x2e2b26,57|16|0x34312c,72|11|0xdfcdb3"},--二口女
{c=0x47433d,str ="14|4|0x272420,16|-9|0x272420,-11|-3|0xd9b070,43|3|0x272420,28|-1|0x383530,76|2|0x33302b,71|-12|0x35312c,93|-7|0xdfcdb3,66|-5|0x2f2c28"},--海坊主
{c=0x423e38,str="4|8|0x282521,-17|7|0xd6c9b9,18|8|0x2d2925,32|8|0xd6c9b9,26|-5|0x292622,19|-5|0x2f2b27,46|5|0x312d28,58|14|0x272420,59|0|0xd6c9b9"},--鸟
{c=0x302d28,str="14|9|0x646158,15|-2|0x413e38,33|12|0x2b2824,47|0|0x37342f,61|8|0x35322d,76|11|0x292622,98|7|0x2f2c28,103|2|0x282521,98|-1|0x2c2925"},--经验
{c=0x34302c,str="-19|0|0xdeb97c,9|-4|0x2b2824,36|2|0x292622,29|-7|0x2d2a25,53|3|0x312e29,67|6|0x312e29,94|-3|0x282521,88|-6|0x302d29,-9|-2|0x3b3832"},--金币
{c=0x2b2824,str="11|-1|0x757268,-14|0|0xdab171,46|9|0x2b2824,66|11|0x292622,95|11|0x272420,102|-2|0x44403a,34|7|0x2d2a25,46|9|0x2b2824,40|-7|0x36332e"},--跳跳
{c=0x2a2723,str = "11|1|0x2c2925,26|-4|0x413e38,40|-4|0x45423c,42|7|0x5e5a52,1|7|0x2c2925,9|-10|0x2c2924,59|-3|0xdfcdb3"},--石距
}

function 识别函数(第几个)
	local x = -1
	local y=-1
			if 识别参数750[第几个].c == 0 then
			return false
		end
	x, y = findMultiColorInRegionFuzzy(识别参数750[第几个].c,识别参数750[第几个].str, 90, 548,173,672,579)
	--sysLog(第几个.."识别"..x..":"..y)
	if x > -1 then
		sysLog(第几个.."识别"..x..":"..y)
		判断选哪个队伍(y)
		mSleep(100)
		判断选哪个队伍(y)
		return true
	end
	return false
end


战斗中调整视角 = {
	{32,513,0x923155},
	{40,512,0x9b355c},
	{40,506,0x983459},
	点击 ={40,512,0x9b355c},
}

个人突破打开了奖励 = {
	{545,407,0xccb49b},
	{559,338,0xccb49b},
	{436,407,0xea2d10},
	{412,415,0x5e4566},
	{407,385,0x5f4667},
	点击 ={736,403,0x2a2824},
}

打标记位置 = {
	{745,111,0x4f3886},
	{803,404,0xbdd6f2},
}

悬赏邀请 = {
	{885,441,0x55b260},
	{896,427,0x5bb766},
	{888,539,0xde7461},
	{900,526,0xdf7260},
	接受 = {880,437,0x58be6a},
	拒绝 = {894,541,0xdb7463},
}

好友界面 = {
	{580,645,0xe3c798},
	{1005,645,0xeac8a2},
	{1077,643,0xf3b25e},
	{1167,650,0xf4b160},
  关闭 = {1232,72,0xd67a8f},
}

体力不足界面 = {
	{615,499,0xf3b25e},
	{729,497,0xf3b25e},
	{601,396,0x0e100c},
	{825,382,0xd6c9b9},
	{516,393,0xd6c9b9},
	购买 = {672,497,0xf3b25e},
	关闭 = {973,204,0xe8d4cf},
}