
function new_ui_new()
  local w_,h_ = getScreenSize() --w < h
  local h = w_
  local w = h_
  ui:new(w,h,"启动挂机","结束运行","cloud_ear_yys.dat") 
  
  local p = ui:newPage("挂机设置")
	p:addImage(10,14,"bg2.jpg","left",{0,0})
  p:newLine()
	p:addLebel(10,1,"功能选择：",25,"left","255,0,0")
	p:newLine()
  --p:addLebel(2,1,"功能选择:") 
  --p:newLine()
  if version == 1 then
    if ver == "iOS" then 
      local b = p:newBox(12,0.6)
      b:addRadioBoxGroup(9,20,"功能选择","0","肝体力","结界突破","寮突破","小功能","挂机等邀请")--,"自动剧情","自动进小号鬼王","自动斗技","自动协同斗技","百鬼夜行","自动抽N卡","自动兔子（测试）","自动找寄养","自动召唤碎片","一键日常")
    else
      local b = p:newBox(10,0.55)
      b:addRadioBoxGroup(9,20,"功能选择","0","肝体力","结界突破","寮突破","小功能","挂机等邀请")--,"自动剧情","自动进小号鬼王","自动斗技","自动协同斗技","百鬼夜行","自动抽N卡","自动兔子（测试）","自动找寄养","自动召唤碎片","一键日常")
    end
  end
	
	--p:newLine()
  --p:addLebel(10,1,"肝体力顺序:自动按照次数由少到多的排序",25,"left","255,0,0")
  p:newLine()


	--p:addImage(10,8.2,"bg2.jpg","left",{0,155})

  p:addLebel(10,1,"肝体力配置：",25,"left","255,0,0")
	p:newLine()
  p:addCheckBoxGroup(1.4,1.2,"要去探索","","探索")  
  p:addComboBox(2,1,"组队探索",0,"单刷","组队")
  p:addComboBox(1.2,1,"推图次数",0,"999","1","2","3","4","5","6","7","8","9","10","20","30")
  p:addLebel(0.6,0.8,"次",25)
  p:addLebel(1.4,0.8,"判定方式:",25)
  p:addComboBox(2.4,1,"判定方式",0,"打BOSS算一次","退出副本算一次")
  p:newLine()
 
  p:addCheckBoxGroup(1.4,1.2,"要去御魂","","御魂")  
  p:addComboBox(1.8,1,"刷御魂材料几层",3,"第一层","第二层","第三层","第四层","第五层","第六层","第七层","第八层","第九层","第十层")
  p:addComboBox(1.8,1,"御魂组队单刷",0,"单刷","开组","混组","开组邀请")
  p:addComboBox(1.4,1,"御魂开组刷设置",3,"2人","3人")
  p:addComboBox(1.4,1,"刷御魂次数",0,"999","1","2","3","4","5","6","7","8","9","10","20","30","40","50","60","70","80","90","100","150","200","300","500") 
  p:addLebel(0.8,1,"次",25) 
  p:newLine()
	
  p:addCheckBoxGroup(1.4,1.2,"要去觉醒","","觉醒")  
  p:addComboBox(1.4,1,"刷觉醒材料设置",3,"业火轮","风转符","水灵鲤","天雷鼓") 
  p:addComboBox(1.4,1,"刷觉醒材料几层",3,"第一层","第二层","第三层","第四层","第五层","第六层","第七层","第八层","第九层","第十层")
  p:addComboBox(1.8,1,"觉醒组队单刷",0,"单刷","开组","混组","开组邀请")
  p:addComboBox(1.2,1,"觉醒开组刷设置",3,"2人","3人")
  p:addComboBox(1.4,1,"刷觉醒次数",0,"999","1","2","3","4","5","6","7","8","9","10","20","30","40","50","60","70","80","90","100","150","200","300","500")
  p:addLebel(0.8,1,"次",25) 
  p:newLine()
	
  p:addCheckBoxGroup(1.8,1.2,"要去业原火","","业原火")  
  p:addComboBox(2,1,"业原火设置",3,"贪之阵","嗔之阵","痴之阵")
  p:addComboBox(1.4,1,"刷业原火次数",0,"999","1","2","3","4","5","6","7","8","9","10","20","30","40","50","60","70","80","90","100","150","200","300","500")
  p:addLebel(0.8,1,"次",25) 
  p:newLine()
	
  p:addCheckBoxGroup(1.4,1.2,"要去御灵","","御灵")  
  p:addComboBox(2,1,"刷御灵设置",3,"神龙","白藏主","黑豹","孔雀") 
  p:addComboBox(2,1,"刷御灵设置几层",3,"第一层","第二层","第三层")
  p:addComboBox(1.4,1,"刷御灵次数",0,"999","1","2","3","4","5","6","7","8","9","10","20","30","40","50","60","70","80","90","100","150","200","300","500")
  p:addLebel(0.8,1,"次",25) 
  p:newLine()
	
  p:addCheckBoxGroup(1.4,1.2,"要去妖气","","妖气")  
  p:addComboBox(1.4,1,"妖气封印次数",0,"999","1","2","3","4","5","6","7","8","9","10","20","30","40","50","60","70","80","90","100","150","170","180","190","200","300","500")
  p:addLebel(0.8,1,"次",25) 
  p:newLine()
	
  p:addCheckBoxGroup(1.8,1.2,"要去挑战","","式神挑战")  
  p:addComboBox(2,1,"式神挑战章节",3,"第一章","第二章","第三章","第四章","第五章","第六章","第七章","第八章","第九章","第十章","第十一章","第十二章","第十三章","第十四章","第十五章","第十六章","第十七章","第十八章") 
  p:addComboBox(2,1,"式神挑战第几个",3,"第一个","第二个","第三个")
  p:addComboBox(1.4,1,"式神挑战次数",0,"999","1","2","3","4","5","6","7","8","9","10","20","30","40","50","60","70","80","90","100","150","170","180","190","200","300","500")
  p:addLebel(0.8,1,"次",25) 
  p:newLine()
	
  p:addLebel(2,1,"肝体力结束:",25) 
  if ver == "iOS" then 
    local b = p:newBox(10,0.8)		
    b:addRadioBoxGroup(9,6,"次数不足","0","锁屏","阴阳寮突破","从头再来","等10分钟从头再来","挂机等邀请","挂机等寄养") 
  else
    local b = p:newBox(10,1.2)		
    b:addRadioBoxGroup(9,6,"次数不足","0","锁屏","阴阳寮突破","从头再来","等10分钟从头再来","挂机等邀请","挂机等寄养") 
  end
	p:newLine()
	
  p:addLebel(2,1,"体力不足:",25) 
  if ver == "iOS" then 
    local b = p:newBox(10,0.8)		
    b:addRadioBoxGroup(9,6,"体力不足","0","领体力","锁屏","挂机等邀请","继续挂着","阴阳寮突破","挂机等寄养") 
  else
    local b = p:newBox(10,1.2)		
    b:addRadioBoxGroup(9,6,"体力不足","0","领体力","锁屏","挂机等邀请","继续挂着","阴阳寮突破","挂机等寄养") 
  end
	p:newLine()
	
	

	
	--p:addImage(10,5,"bg2.jpg","left",{0,1050})

  p:addLebel(10,1,"功能结合(如下功能可以跟肝体力，或等邀请结合):",25,"left","255,0,0") 
  p:newLine()
  local b = p:newBox(10,0.5)
  b:addCheckBoxGroup(10,10,"定期妖气","","突破卷满20去突破","定期去阴阳寮突破","定期石距","定期年兽","定期金币妖怪","定期经验妖怪")
  p:newLine()


  --p:newLine()
	--p:addLebel(3.5,1,"点击延迟随机化，从") 
  --p:addComboBox(1.6,1,"延迟随机最小值",1,"0秒","0.5秒","1秒","1.5秒","2秒","2.5秒","3秒","3.5秒","4秒","4.5秒","5秒","5.5秒","6秒","6.5秒","7秒","7.5秒","8秒","8.5秒","9秒","9.5秒","10秒") 
  --p:addLebel(0.4,1,"到") 
  --p:addComboBox(1.6,1,"延迟随机最大值",2,"0秒","0.5秒","1秒","1.5秒","2秒","2.5秒","3秒","3.5秒","4秒","4.5秒","5秒","5.5秒","6秒","6.5秒","7秒","7.5秒","8秒","8.5秒","9秒","9.5秒","10秒") 
	延迟随机最小值 = "0.5秒"
	延迟随机最大值 = "1.5秒"
	
	p:newLine()
	--p:addImage(10,1.5,"bg2.jpg","left",{0,1600})	 
  p:addLebel(2,1,"小功能选择:",25,"left","255,0,0")  
  p:addComboBox(2.8,1,"小功能选择",0,"自动剧情","自动进小号鬼王","自动斗技","自动协同斗技","百鬼夜行","自动抽N卡","自动兔子（测试）","自动找寄养","自动召唤碎片","一键日常")
	p:newLine()
	p:addLebel(10,0.8,"建议反馈请加群649832015 ",25)
	p:newLine()

	
	--p:newLine()
  --if ver == "iOS" then 
  --   p:addCheckBoxGroup(1.2,1.2,"随机发呆","","每隔") 
  --   p:addComboBox(1,1.2,"随机发呆间隔小","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  --  p:addLebel(0.2,1.2,"-",25,"left","6,6,6") 
  --   p:addComboBox(1,1.2,"随机发呆间隔大","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  --  p:addLebel(1.2,1.2,"分钟，发呆",25,"left","6,6,6")  
  --   p:addComboBox(1,1.2,"随机发呆时间小","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","30","40","50","60","70","80","90","100","110","120","150","180")
  --  p:addLebel(0.2,1.2,"-",25,"left","6,6,6")  
  --   p:addComboBox(1,1.2,"随机发呆时间大","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","30","40","50","60","70","80","90","100","110","120","150","180")
  --  p:addLebel(0.4,1.2,"秒",25,"left","6,6,6")  
  --else
  --  p:addCheckBoxGroup(1.4,1.2,"随机发呆","","每隔") 
  --   p:addComboBox(1,1.2,"随机发呆间隔小","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  --  p:addLebel(0.2,1.2,"-",25,"left","6,6,6") 
  --   p:addComboBox(1,1.2,"随机发呆间隔大","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  --  p:addLebel(1.4,1.2,"分钟，发呆",25,"left","6,6,6")  
  --   p:addComboBox(1,1.2,"随机发呆时间小","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","30","40","50","60","70","80","90","100","110","120","150","180")
  --  p:addLebel(0.2,1.2,"-",25,"left","6,6,6")  
  --   p:addComboBox(1,1.2,"随机发呆时间大","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","30","40","50","60","70","80","90","100","110","120","150","180")
  --  p:addLebel(0.4,1.2,"秒",25,"left","6,6,6")  
  --end

  --p:newLine()	
  ----p:newLine() 
  --p:addLebel(10,0.8,"这个功能，探索，妖气，业原火，御灵，寮突破，百鬼有效。",25)	
  --p:newLine()
  --p:addLebel(10,0.8,"随机点击是个好东西，但可能会造成脚本不稳定！！",25,"left","255,0,0")
  --p:newLine()	
  --p:addLebel(10,0.8,"另外脚本每次点击本身就是随机的，这个是增加无意义随机点击。",25,"left","255,0,0")
  --p:newLine()
  --if ver == "iOS" then 
  --   p:addCheckBoxGroup(1.2,1.2,"随机点击","","每隔") 
  --   p:addComboBox(1,1.2,"随机点击间隔小","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","30","40","50","60","70","80","90","100","110","120","150","180")
  --  p:addLebel(0.2,1.2,"-",25,"left","6,6,6") 
  --   p:addComboBox(1,1.2,"随机点击间隔大","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","30","40","50","60","70","80","90","100","110","120","150","180")
  --  p:addLebel(2.2,1.2,"秒，随机点击一下",25,"left","6,6,6")  
  --else
  --  p:addCheckBoxGroup(1.4,1.2,"随机点击","","每隔") 
  --   p:addComboBox(1,1.2,"随机点击间隔小","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","30","40","50","60","70","80","90","100","110","120","150","180")
  --  p:addLebel(0.2,1.2,"-",25,"left","6,6,6") 
  --   p:addComboBox(1,1.2,"随机点击间隔大","0","0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","30","40","50","60","70","80","90","100","110","120","150","180")
  --  p:addLebel(3,1.2,"秒，随机点击一下",25,"left","6,6,6")  
  --end

  if ver == "iOS" then 
  else
    p:newLine()
    p:newLine()
    p:newLine()
  end
	
	
  local p1 = ui:newPage("探索")
  --p1:newLine()
	 --p:addLebel(10,0.8,"换狗粮的设置，请在‘探索’分页详细配置！！",25,"left","255,0,0")
  --p:newLine()
  --if ver == "iOS" then 
    --local b = p:newBox(8,0.5)  
    --b:addRadioBoxGroup(8,8,"选图方式","0","极速选图","右边拖动选图（稳定）","点右边选图")  
  --else
    --local b = p:newBox(8,1)  
    --b:addRadioBoxGroup(8,8,"选图方式","0","极速选图","右边拖动选图（稳定）","点右边选图")  
  --end
	p1:addImage(10,11,"bg2.jpg","left",{0,0})
  p1:newLine()
  p1:addLebel(2.4,1,"探索章节:",25)  
  p1:addComboBox(2.8,1,"拖动选图",0,"第一章","第二章","第三章","第四章","第五章","第六章","第七章","第八章","第九章","第十章","第十一章","第十二章","第十三章","第十四章","第十五章","第十六章","第十七章","第十八章","番外一","第十九章","第二十章","第二十一章","第二十二章","第二十三章")
  p1:addComboBox(2,1,"推图难度",3,"普通","困难")
  --p:newLine()
  --p:addLebel(2.4,1,"右边选图:",25)  
  --p:addComboBox(2.8,1,"推图设置",3,"右边第一张图","右边第二张图","右边第三张图","右边第四张图")
  --p:addLebel(10,0.8,"记得要去探索设置分页里面做详细设置！！",25,"left","255,0,0")
  p1:newLine()
  p1:addLebel(2.4,1,"怪物选择:",25)
  local b = p1:newBox(8,0.5)
  b:addCheckBoxGroup(10,6,"怪物选择","","boss","经验怪","御魂怪","金币怪","任意怪")
  p1:newLine()
  if w ==768 or w == 1024 or w == 1536 or w == 2048 then
    p1:addLebel(10,0.8,"平板因为分辨率太大，导致选怪效率很差，比手机选怪差了9倍效率。",25,"left","255,100,100")
    p1:newLine()
  end
  --p:addLebel(10,0.8,"选怪的时候建议是BOSS+经验（御魂金币），不要同时选BOSS+经验+金币这样的",25)
  --p:newLine()
	
  if ver == "iOS" then 
    local b = p1:newBox(8,0.5)
    b:addCheckBoxGroup(10,1.5,"自动换狗粮","0","自动换狗粮","日服用户") --,"组队探索（你是队长）"
  else
    local b = p1:newBox(8,0.8)
    b:addCheckBoxGroup(12,3,"自动换狗粮","0","自动换狗粮","日服用户") --,"日服玩家勾选这个"
  end
  --p1:newLine()
  --p1:addLebel(9,1,"日服台服玩家记得勾选。国服玩家不要勾选，主要是对观战狗粮的处理。",25)
  p1:newLine()
  --p1:addLebel(9,1,"现在默认排除5星狗粮，大家可以放心升5星白蛋了。",25)
  --p1:newLine()
  -- p1:addLebel(2,1,"组队设置:")  p1:addComboBox(2,1,"组队设置",0,"寮友","好友")
  -- p1:newLine()
  p1:addLebel(1.5,1,"邀请失败",25) p1:addComboBox(1,1,"邀请失败次数",0,"99999","1","2","3","4","5","6","7","8","9","10","20","30") p1:addLebel(1.8,1,"次停止脚本",25)
  p1:newLine()
	
  --p1:addLebel(2.4,1,"换狗粮速度:") 
  --local b = p1:newBox(10,0.5)
  --b:addRadioBoxGroup(8,7,"狗粮拖动速度","","普通模式","极速模式")
  --p1:newLine()
  --p1:addLebel(1,1,"每打",25) p1:addComboBox(1.4,1,"几次检测一次满",0,"0","1","2","3","4","5","6","7","8","9","10","15","20","30") p1:addLebel(5.8,1,"场探索，检测一次满级狗粮。",25) 
  --p1:newLine()
  --p1:addLebel(9,1,"选0就可以了，每一场都检测。如果想快点刷可以选个5左右的。",25)
  --p1:newLine()
  if ver == "iOS" then 
    p1:addLebel(2,1,"狗粮选择:",25) 
    local b = p1:newBox(10,0.5)
    b:addCheckBoxGroup(9,7,"狗粮选择","0","N卡","R卡","上红蛋","上白蛋")
    p1:newLine()
    --p1:addLebel(2,1,"狗粮位置:",25) 
    --local b = p1:newBox(10,0.5)
    --b:addCheckBoxGroup(9,7,"狗粮位置","","左边","中间","右边","阴阳师左边","阴阳师右边")
    --p1:newLine()
    --p1:addLebel(2,1,"狗粮普攻:",25) 
    --local b = p1:newBox(10,0.5)
    --b:addCheckBoxGroup(9,7,"狗粮普攻","","左边","中间","右边","阴阳师左边","阴阳师右边")
  else
    p1:addLebel(1.6,1,"狗粮选择:",25) 
    local b = p1:newBox(10,0.5)
    b:addCheckBoxGroup(9,7,"狗粮选择","0","N卡","R卡","上红蛋","上白蛋")
    --p1:newLine()
    --p1:addLebel(1.6,1,"狗粮位置:") 
    --local b = p1:newBox(10,0.5)
    --b:addCheckBoxGroup(9,7,"狗粮位置","","左边","中间","右边","阴阳师左边","阴阳师右边")
    --p1:newLine()
    --p1:addLebel(1.6,1,"狗粮普攻:") 
    --local b = p1:newBox(10,0.5)
    --b:addCheckBoxGroup(9,7,"狗粮普攻","","左边","中间","右边","阴阳师左边","阴阳师右边")
  end
  p1:newLine()
  --p1:addLebel(10,0.8,"这个位置是进入更换式神界面你看到的左中右。狗粮队长千万不要放右边。观战部分是自动处理。",25,"left","255,100,100")
  --p1:newLine()
  --p1:addLebel(10,0.8,"阴阳师左边和右边代表的是组队探索模式下，作为队长，他带的那2只式神。",25)
  --p1:newLine()
  p1:addLebel(10,0.8,"狗粮队长请放在远离观战的地方。",25,"left","255,100,100")
  p1:newLine()
  p1:addLebel(3,1,"第1回合标记:",25) p1:addComboBox(3,1,"推图打标记",0,"标记BOSS","标记小怪（右）","标记小怪（中）","标记小怪（左）","不标记")
  p1:newLine()
  p1:addLebel(3,1,"第2回合标记:",25) p1:addComboBox(3,1,"推图打标记2",0,"标记BOSS","标记小怪（右）","标记小怪（中）","标记小怪（左）","不标记")
  p1:newLine()
  p1:addLebel(3,1,"BOSS第1回合标记:",25) p1:addComboBox(3,1,"推图BOSS打标记1",0,"标记BOSS","标记小怪（右）","标记小怪（中）","标记小怪（左）","不标记")
  p1:newLine()
  p1:addLebel(3,1,"BOSS第2回合标记:",25) p1:addComboBox(3,1,"推图BOSS打标记2",0,"标记BOSS","标记小怪（右）","标记小怪（中）","标记小怪（左）","不标记")
  p1:newLine()
  p1:addLebel(2,1,"选狗粮方式:",25) 
  local b = p1:newBox(10,0.5)
  b:addRadioBoxGroup(8,7,"选狗粮方式","","前面的不满N卡","拖到最后的1级N卡")
  p1:newLine()
  p1:addLebel(3,1,"选狗粮拖动次数:",25) p1:addComboBox(2.8,1,"选狗粮拖动次数",0,"10次","15次","20次","30次","40次","50次","60次","70次","80次","90次","100次")
  p1:newLine()
  p1:addLebel(1.6,1,"如果打了",25) p1:addComboBox(1.4,1,"打怪超过N个",0,"99","1","2","3","4","5") p1:addLebel(5.4,1,"只指定怪物，则刷到出boss为止。",25) 
  p1:newLine()
  p1:addLebel(0.8,1,"失败",25) p1:addComboBox(1,1,"失败次数",0,"1","2","3","4","5") p1:addLebel(1.8,1,"次退出副本",25)
  p1:addLebel(0.2,1,"")
  p1:addLebel(1.5,1,"总共失败",25) p1:addComboBox(1,1,"总共失败次数",0,"999","1","2","3","4","5","6","7","8","9","10","20","30") p1:addLebel(2,1,"次停止脚本",25)
  p1:newLine()
  p1:addLebel(2,1,"副本内拖动",25) p1:addComboBox(2,1,"副本内拖图次数","5","0","1","2","3","4","5","6","7","8","9","10") p1:addLebel(3,1,"次到副本尽头",25)
  
	
	local p2 = ui:newPage("御魂觉醒")
	p2:addImage(10,6,"bg2.jpg","left",{0,0})

  p2:newLine()
  if ver == "iOS" then 
    p2:addLebel(3,1,"标记点击次数",25) p2:addComboBox(1.4,1,"标记点击次数","4","1","2","3","4","5","6","7","8","9","10") 
  else
    p2:addLebel(3,1,"标记点击次数",25) p2:addComboBox(1.4,1,"标记点击次数","4","1","2","3","4","5","6","7","8","9","10") 
  end
  p2:newLine()
  p2:addLebel(3,1,"御魂第一回合标记:",25) p2:addComboBox(2,1,"御魂打标记",0,"标记中间","标记左边","标记右边","先左后右","先右后左","先左后中","先右后中","不标记")
  p2:newLine()
  p2:addLebel(3,1,"御魂第二回合标记:",25) p2:addComboBox(2,1,"御魂打标记2",0,"标记中间","标记左边","标记右边","先左后右","先右后左","先左后中","先右后中","不标记")
  p2:newLine()
  p2:addLebel(3,1,"御魂第三回合标记:",25) p2:addComboBox(2,1,"御魂打标记3",0,"标记中间","标记左边","标记右边","先左后右","先右后左","先左后中","先右后中","丑女茨木标记","不标记")
  p2:newLine()
  --p2:addLebel(10,0.8,"3回合新增丑女茨木标记方式，要求丑女快点茨木慢点，空出足够时间给上稻草人，然后切换右边。",25,"left","255,100,100")
  --p2:newLine()
  p2:addLebel(10,0.8,"注意，御魂，挂机等邀请，邀请魂10，业原火，都会用到这个标记。",25,"left","255,100,100")
  p2:newLine()
  p2:addLebel(3,1,"御魂觉醒失败",25) p2:addComboBox(1.4,1,"御魂觉醒失败次数",0,"99","1","2","3","4","5","6","7","8","9","10") p2:addLebel(5.4,1,"次停止脚本",25) 
  p2:newLine()
  if ver == "iOS" then 
    p2:addLebel(3,1,"御魂觉醒连续失败",25) p2:addComboBox(1.4,1,"御魂觉醒连续失败次数",0,"99","1","2","3","4","5","6","7","8","9","10") p2:addLebel(5.4,1,"次停止脚本",25) 
  else
    p2:addLebel(3,1,"御魂觉醒连续失败",25) p2:addComboBox(1.4,1,"御魂觉醒连续失败次数",0,"99","1","2","3","4","5","6","7","8","9","10") p2:addLebel(5.4,1,"次停止脚本",25) 
  end
  p2:newLine()
 
  p2:addLebel(3,1,"开组-最低等级:",25)  p2:addComboBox(2,1,"开组等级",0,"不设置","1级","6级","11级","16级","21级","26级","31级","36级","41级","46级","51级","56级","60级")
	p2:newLine()
	local b = p2:newBox(10,0.5)
  b:addCheckBoxGroup(8,7,"御魂失败继续","","御魂失败也继续邀请或者接受邀请")
  --p2:newLine()
  -- local b = p2:newBox(10,0.5)
  --b:addRadioBoxGroup(8,7,"组队单刷","0","单刷","开组刷","混组刷")  
  --p2:newLine()
  -- p2:addLebel(3,1,"开组-几人开始:")  p2:addComboBox(2,1,"开组刷设置",3,"2人","3人")
  p2:newLine()
	
	--	p2:newLine()
  --p:addLebel(10,1,"【===========================================】") 
  --	p:newLine()
	
  local p3 = ui:newPage("突破")
	p3:addImage(10,11,"bg2.jpg","left",{0,0})

  p3:newLine()
  local b = p3:newBox(10,0.5)
  if ver == "iOS" then 
    b:addCheckBoxGroup(10,1.5,"突破标记","0","突破打标记") 
  else
    b:addCheckBoxGroup(12,3,"突破标记","0","突破打标记") --,"日服玩家勾选这个"
  end
  p3:newLine()
  p3:addLebel(2,1,"个人突破:",25) 
  if ver == "iOS" then 
    local b = p3:newBox(10,0.5)
    b:addRadioBoxGroup(8,9,"突破设置","0","个人突破(3胜刷新)","个人突破(9场刷新)")  
  else	
    local b = p3:newBox(10,0.8)
    b:addRadioBoxGroup(8,9,"突破设置","0","个人突破(3胜刷新)","个人突破(9场刷新)")  
  end
  p3:newLine()
  p3:addLebel(2,1,"个人突破顺序:",25) 
  if ver == "iOS" then 
    local b = p3:newBox(10,0.5)
    b:addRadioBoxGroup(8,9,"个人突破顺序","0","优先打勋章少的","优先打勋章多的")  
  else	
    local b = p3:newBox(10,0.8)
    b:addRadioBoxGroup(8,9,"个人突破顺序","0","优先打勋章少的","优先打勋章多的")  
  end
  p3:newLine()
  p3:addLebel(2,1,"个人突破结束:",25) 
  if ver == "iOS" then 
    local b = p3:newBox(10,0.5)
    b:addRadioBoxGroup(8,9,"个人突破结束","0","锁屏","挂机等邀请")  
  else	
    local b = p3:newBox(10,0.8)
    b:addRadioBoxGroup(8,9,"个人突破结束","0","锁屏","挂机等邀请")  
  end
  p3:newLine()
  p3:addLebel(2,1,"阴阳寮突破:",25) 
  local b = p3:newBox(10,1.2)
  b:addRadioBoxGroup(8,9,"阴阳寮突破设置","0","阴阳寮突破(不下拉)","阴阳寮突破(下拉)","阴阳寮突破(打第一个)","根据勋章选择")  
  p3:newLine()
  p3:addLebel(2,1,"寮突破优先打",25) p3:addComboBox(1,1,"攻击勋章",0,"0","1","2","3","4","5") p3:addLebel(3,1,"个勋章及以下的人",25)
  p3:newLine()
  p3:addLebel(2,1,"突破结束判定:",25) 
	local b = p3:newBox(10,0.5)
  b:addRadioBoxGroup(8,9,"突破结束判定","0","第一页全破或者失败算结束","打到90%算结束")  
  p3:newLine()
  p3:addLebel(2,1,"突破等待:",25) 
  local b = p3:newBox(10,0.5)
  b:addRadioBoxGroup(8,9,"突破等待","0","不等，直接进","等10分钟再操作","等10分钟并且锁屏")  
  p3:newLine()
  p3:addLebel(10,0.8,"要用锁屏功能的，一定要关闭锁屏密码。否则无法唤醒手机。",25)
  p3:newLine()
  p3:addLebel(2,1,"寮突破CD:",25) 
  local b = p3:newBox(10,0.5)
  b:addRadioBoxGroup(8,9,"寮突破CD","0","10分钟","10-12分钟再进","12-15分钟再进")  
  p3:newLine()
  p3:addLebel(2,1,"接受邀请:",25) 
  local b = p3:newBox(10,0.5)
  b:addRadioBoxGroup(8,9,"突破接受邀请","0","突破时不接受邀请","突破时接受邀请")  
  p3:newLine()
  p3:addLebel(2,1,"组队突破:",25) 
  local b = p3:newBox(10,0.5)
  b:addRadioBoxGroup(8,9,"组队突破","0","只打单人突破","只打组队突破","单人组队都突破")  
  p3:newLine()
  p3:addLebel(2,1,"几人开组:",25) 
  local b = p3:newBox(10,0.5)
  b:addRadioBoxGroup(8,9,"组队突破几人","0","2人","3人","只开组不邀请")  
  p3:newLine()
  --p3:addLebel(10,0.8,"个人：优先找牌子少的打，如果没有就随机打。个人突破（刷新），代表9个全打一遍然后刷新。",25)
  --p3:newLine()
  --p3:addLebel(10,0.8,"阴阳寮：不下拉，会直接在第一页搜索没有牌子的人，随机打。下拉，会往后拉然后再打。",25)
  -- p3:newLine()
  --p:addLebel(10,1,"【===========================================】") 
  -- p:newLine()
	
	
  local p4 = ui:newPage("妖气")
	p4:addImage(10,5,"bg2.jpg","left",{0,0})
	
  p4:newLine()
  p4:addLebel(2.5,1,"妖气封印延迟:",25) p4:addComboBox(2,1,"妖气延迟",0,"不延迟","0.1秒","0.2秒","0.3秒","0.4秒","0.5秒","0.6秒","0.7秒","0.8秒","0.9秒","1.0秒","1.1秒","1.2秒","1.3秒","1.4秒","1.5秒","2秒","3秒","4秒","5秒")
  p4:newLine()
  --p4:addLebel(2.5,1,"妖气封印次数:") p4:addComboBox(2,1,"妖气封印次数",0,"999次","1次","2次","3次","4次","5次","10次","20次","30次","40次","50次","60次","70次","80次","90次","100次","110次","120次","130次","140次","150次","160次","170次","180次","190次","200次")
  --p4:newLine()
  p4:addLebel(10,0.8,"有时候点太快了，可能会导致上错车。各位可以根据自己实际情况适当加延迟。",25)
  p4:newLine()
  if ver == "iOS" then 
    local b = p4:newBox(10,0.5)		
    b:addRadioBoxGroup(9,6,"匹配还是挤车","0","匹配模式","抢车模式") 
  else
    local b = p4:newBox(10,0.8)		
    b:addRadioBoxGroup(9,6,"匹配还是挤车","0","匹配模式","抢车模式") 
  end
  p4:newLine()
  if ver == "iOS" then 
    p4:addCheckBoxGroup(5,1,"妖气做不做队长",0,"队长离开，我也离开") 
  else
    p4:addCheckBoxGroup(6,1,"妖气做不做队长",0,"队长离开，我也离开") 
  end
  p4:newLine()
  p4:addLebel(2.5,1,"妖气封印选择:",25) 
  if ver == "iOS" then 
    local b = p4:newBox(8,1.5)
    b:addCheckBoxGroup(7,12,"妖气封印选择","","椒图","鬼使黑","骨女","二口女","海坊主","姑获鸟","跳跳哥哥","经验妖怪","金币妖怪","石距","年兽","饿鬼","组队突破","小松丸")
    --b:addCheckBoxGroup(8,7,"妖气封印选择","","椒图","鬼使黑","骨女","二口女","海坊主","姑获鸟")
    --  	p4:newLine()
  else
    local b = p4:newBox(8,2)
    b:addCheckBoxGroup(7,16,"妖气封印选择","","椒图","鬼使黑","骨女","二口女","海坊主","姑获鸟","跳跳哥哥","经验妖怪","金币妖怪","石距","年兽","饿鬼","组队突破","小松丸")
  end
  p4:newLine()
  --p4:addLebel(10,0.8,"新增一个结界突破的，主要是配合大佬，从这里进大佬的组队突破车。",25)
  --p4:newLine()
  --p4:addLebel(10,0.8,"石距 年兽 经验 金币，可以多选了，我会自动切换。但是不要用妖气去混合，这个无法切换。",25)
  --p4:newLine()
	
  local p5 = ui:newPage("杂项")
  p5:addImage(10,15,"bg2.jpg","left",{0,0})
	p5:newLine()
  p5:addLebel(10,1,"通用配置:",25,"left","255,0,0") 
  p5:newLine()
  if ver == "iOS" then 
    local b = p5:newBox(10,2.5)
    b:addCheckBoxGroup(10,10,"推图结合","","推图时拒绝邀请","发现石距震动提醒","发现石距铃声提醒","自动接受好友申请","开启脚本提示","开启点击提示","发现石距自动打","发现年兽自动打","不检测自动战斗","不做日常祈愿和强化","不做日常突破","不强制普攻改妖术","自动斗技","关闭统计")
  else
    local b = p5:newBox(10,2.9)
    b:addCheckBoxGroup(10,19,"推图结合","","推图时拒绝邀请","发现石距震动提醒","发现石距铃声提醒","自动接受好友申请","开启脚本提示","开启点击提示","发现石距自动打","发现年兽自动打","不检测自动战斗","不做日常祈愿和强化","不做日常突破","不强制普攻改妖术","自动斗技","关闭统计")
  end
	
  p5:newLine()
  p5:addCheckBoxGroup(1.2,1.2,"自动鬼王","","在") 
  p5:addComboBox(1.2,1.2,"自动鬼王小时",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23")
  p5:addLebel(0.2,1.2,":",25,"left","6,6,6")   
  p5:addComboBox(1.2,1.2,"自动鬼王分钟",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  p5:addLebel(3,1.2,"时，参加鬼王。",25,"left","6,6,6")  
  p5:newLine()
  --p5:newLine()
  p5:addLebel(2,1,"日常结束:",25) 
  if ver == "iOS" then 
    local b = p5:newBox(10,0.5)		
    b:addRadioBoxGroup(9,6,"日常结束","0","锁屏","震动提醒","探索","御魂","阴阳寮突破") 
  else
    local b = p5:newBox(10,0.8)		
    b:addRadioBoxGroup(9,6,"日常结束","0","锁屏","震动提醒","探索","御魂","阴阳寮突破") 
  end
  p5:newLine()
  p5:addLebel(3.6,1,"有人加寮:",25)  p5:addComboBox(2,1,"有人加寮",0,"不处理","自动拒绝","自动同意")
  p5:newLine()
  p5:addLebel(3.6,1,"领体力次数:",25)  p5:addComboBox(2,1,"买体力次数",0,"1","2","3","4","5","6","7","8","9","10","99")
  p5:newLine()
  p5:addLebel(3.6,1,"百鬼设置:",25)  p5:addComboBox(2,1,"百鬼设置",0,"不邀请队友","邀请队友")
  p5:newLine()
  p5:addLebel(3.6,1,"清明技能(跳兔子):",25)  p5:addComboBox(2,1,"清明技能",0,"一直普攻","一直放灭")
  p5:newLine()
  local b = p5:newBox(8,0.5)
  b:addRadioBoxGroup(8,4,"无限魂十","","过山兔本","无限魂10兔子")
  p5:newLine()
  --p:addLebel(10,0.8,"如果要无限魂10，你们打开御魂界面选好魂10再用。",25)
  --p:newLine()
  --p:addLebel(2,1,"体力不足判定:")  p:addComboBox(2.8,1,"体力不足判定时间","5","1分钟","2分钟","3分钟","4分钟","5分钟","6分钟","7分钟","8分钟","9分钟","10分钟","11分钟","12分钟","13分钟","14分钟")
  --p:newLine()
  p5:addLebel(2.5,1,"重连次数:",25)  p5:addComboBox(2,1,"重连次数",0,"999次","0次","1次","2次","3次","4次","5次","6次","7次","8次","9次","10次","20次","30次")
  p5:newLine()
  p5:addLebel(2.5,1,"重连等待:",25)  p5:addComboBox(2,1,"重连等待",0,"立刻重连","1分钟","2分钟","3分钟","4分钟","5分钟","10分钟","15分钟","20分钟","30分钟","60分钟")
  p5:newLine()	
  
  p5:addCheckBoxGroup(1.2,1.2,"暂停时段一","","在") 
  p5:addComboBox(1.2,1.2,"时段1开始时间小时",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23")
  p5:addLebel(0.2,1.2,":",25,"left","6,6,6")   
  p5:addComboBox(1.2,1.2,"时段1开始时间分钟",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  p5:addLebel(0.4,1.2,"到",25,"left","6,6,6")  
  p5:addComboBox(1.2,1.2,"时段1结束时间小时",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23")
  p5:addLebel(0.2,1.2,":",25,"left","6,6,6")  
  p5:addComboBox(1.2,1.2,"时段1结束时间分钟",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  
  p5:addLebel(3,1.2,"之间，暂停脚本。",25,"left","6,6,6")  
  p5:newLine()	
  p5:addCheckBoxGroup(1.2,1.2,"暂停时段二","","在") 
  p5:addComboBox(1.2,1.2,"时段2开始时间小时",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23")
  p5:addLebel(0.2,1.2,":",25,"left","6,6,6")   
  p5:addComboBox(1.2,1.2,"时段2开始时间分钟",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  p5:addLebel(0.4,1.2,"到",25,"left","6,6,6")   
  p5:addComboBox(1.2,1.2,"时段2结束时间小时",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23")
  p5:addLebel(0.2,1.2,":",25,"left","6,6,6")   
  p5:addComboBox(1.2,1.2,"时段2结束时间分钟",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  
  p5:addLebel(3,1.2,"之间，暂停脚本。",25,"left","6,6,6")  	
  p5:newLine()	
  p5:addCheckBoxGroup(2.4,1.2,"是否有停止时间","","脚本运行")
  p5:addComboBox(1.6,1.2,"脚本停止时间",0,"10","20","30","40","50","60","70","80","90","100","110","120","130","140","150","160","170","180","190","200","210","220","230","240","270","300","360","420","480","540","600")
  p5:addLebel(3,1.2,"分后，锁屏。",25,"left","6,6,6")  
  p5:newLine()
  --p5:addLebel(10,0.8,"这里勾上，然后设置时间段，在这个时间段脚本暂停。时间格式是1330代表13点30分",25)
  --p5:newLine()
  --p5:addLebel(10,0.8,"这个的用处在于，你如果挂机手机放家里，中午在外面想玩一会儿，可以设置12-13点之间暂停。",25)
  --p5:addLebel(10,1,"【===========================================】") 
  p5:newLine()
  p5:addLebel(2,1,"悬赏邀请:",25)
  local b = p5:newBox(10,0.5)
  b:addCheckBoxGroup(8,4,"悬赏邀请","","自动接勾玉邀请","自动接体力邀请","自动接金币邀请")
  p5:newLine()
  
	
	local p8 = ui:newPage("寄养配置")
	p8:addImage(10,6,"bg2.jpg","left",{0,0})
  p8:newLine()
  p8:addLebel(10,0.8,"选择“挂机等寄养”后本页配置生效。",25)
  p8:newLine()
  p8:addLebel(10,0.8,"寄养成功则每隔6小时去占坑,如果没成功推图时每隔N分钟的设置去找坑",25)
  p8:newLine()
  if ver == "iOS" then 
    p8:addLebel(1.0,1,"寄养",25) 
    p8:addComboBox(1.6,1,"寄养星数",0,"1","2","3","4","5","6") 
    p8:addLebel(1.6,1,"星以上的",25) 
    p8:addCheckBoxGroup(8,1,"寄养什么","","斗鱼","太鼓","伞","经验","美食")
  else	
    p8:addLebel(1.0,1,"寄养",25) 
    p8:addComboBox(1.6,1,"寄养星数",0,"1","2","3","4","5","6") 
    p8:addLebel(1.6,1,"星以上的",25) 
    p8:newLine()
    local b = p8:newBox(10,0.5)
    b:addCheckBoxGroup(10,6,"寄养什么","","斗鱼","太鼓","伞","经验","变异")
  end
  p8:newLine()
  if ver == "iOS" then 
    p8:addCheckBoxGroup(2,1.2,"预计下次在","","预计下次在") 
  else
    p8:addCheckBoxGroup(2.8,1.2,"预计下次在","","预计下次在") 
  end
  --p:addLebel(2.0,1,"推图时，每隔")  
  p8:addComboBox(1.2,1.2,"下次寄养小时",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23")
  p8:addLebel(1,0.8,"时",25,"left","6,6,6")  
  p8:addComboBox(1.2,1.2,"下次寄养分钟",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  p8:addLebel(3,1.2,"分，要去抢坑。",25,"left","6,6,6")  
  p8:newLine()
  if ver == "iOS" then 
    p8:addCheckBoxGroup(2,1.2,"是否推图寄养","","挂机时每隔") 
  else
    p8:addCheckBoxGroup(2.8,1.2,"是否推图寄养","","挂机时每隔") 
  end
  --p:addLebel(2.0,1,"推图时，每隔")  
  p8:addComboBox(1.2,1.2,"寄养间隔小时",0,"0","1","2","3","4","5","6")
  p8:addLebel(1,1.2,"小时",25,"left","6,6,6")  
  p8:addComboBox(1.2,1.2,"寄养间隔",0,"0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31","32","33","34","35","36","37","38","39","40","41","42","43","44","45","46","47","48","49","50","51","52","53","54","55","56","57","58","59")
  p8:addLebel(3,1.2,"分钟去检查一下寄养。",25,"left","6,6,6")  
  p8:newLine()
  p8:addLebel(3,1,"找不到合适寄养时:",25) 
  --local b = p8:newBox(6,0.5)
  p8:addRadioBoxGroup(6,1,"找不到合适寄养时","0","不寄养","随意寄养")  
  p8:newLine()
  p8:addLebel(3,1,"好友数量:",25) 
  p8:addComboBox(1.2,1.2,"好友数量",0,"10","20","30","40","50","60","70","80")
  

  --local p6 = ui:newPage("组队说明")
  --p6:newLine()
  --p6:addLebel(10,0.8,"组队探索初版，还会有不少问题，欢迎各位反馈。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"时间仓促，还不能保证稳定性，建议各位还是多盯着一点。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"组队功能不适合组野，建议各位双开，自己带自己。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"组队功能不能自动领体力，建议先领了体力在刷。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"首先，准备2个号。队员号的设置和单刷一样的，选好你的狗粮队长，狗粮位置，狗粮普攻。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"然后用队员号，邀请一次队长号。邀请成功，进入副本后，退出来。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"这样，在队长号的好友的第一位，会显示最近受邀，也就是刚才邀请你的那个队员。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"接着，用队员号开挂机等邀请。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"用队长号，选推图，并且在推图结合那里，有一个叫做组队探索（你是队长）的功能，选上。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"这里我需要强调一点，因为组队模式，战斗前准备只有30秒，所以很可能换狗粮来不及。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"建议用拖到最后N卡的方式，并且减少你的卡片数量。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"目前只测试了邀请好友，邀请寮友的方式没测。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"如果是队长带2狗粮，队员带1输出2狗粮的话。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"建议输出位放在更换式神界面左边（战斗准备界面，最下面那只式神）",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"然后队长和队员，都勾选狗粮位置（普攻），除了左边以外的所有选项。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"如果是队长带输出，队员带3狗粮的话。",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"建议输出位放在更换式神界面左边（战斗准备界面，最下面那只式神）",25)
  --p6:newLine()
  --p6:addLebel(10,0.8,"然后队员把狗粮位置普攻全选，队长把除了“阴阳师左边”的全选。",25)
  
  --local p7 = ui:newPage("兔子说明")
  --p7:newLine()
  --p7:addLebel(10,0.8,"这个是专门用来过山兔本的。也可以用来魂10。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"通关要求，1速兔子，散件最少201速。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"2速兔子，带招财，165速左右。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"3速输出。这个输出必须是惠比寿/莹草/座敷/海坊主，之一",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"如果是惠比寿，需要开场手动操作一下，在安全的时候放下旗子，清明和惠比寿一起输出",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"如果是莹草，清明带灭和盾，功能中勾选一直放灭。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"如果是座敷，带涅槃。低于4火我会打火，清明一直灭。这个效率很低但是基本不断火。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"如果是海坊主，清明和海坊主一起输出即可。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"4速清明，带灭和盾，是普攻还是一直灭就看配置，盾我会自动放。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"56都是觉醒兔子带招财即可。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"由于改版后，清明不能无限套盾，所以在打的时候有概率被青蛙砸死，请随时关注。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"除了以上式神之外，还支持博雅的诛邪剑和分身。",25)
  --p7:newLine()
  --p7:addLebel(10,0.8,"茨木，妖刀，吸血姬，天狗，鸟，酒吞 的平砍。",25)
	
  local ret,result = ui:show()
  
  if ret == 0 then lua_exit() end
  --print(result)
  return result
end
